<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration (suite)</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 10 avril 2007</p>
<h1>Configuration (suite) </h1>
<h3> 6. Fichiers image</h3>
<p> Ici, il s'agit de param&eacute;trer les fichiers des images que nous allons acqu&eacute;rir, ouvrir ou enregistrer. Voici la bo&icirc;te de dialogue que vous obtenez par un clic gauche de la souris sur Fichiers image... : </p>
<img src="../images/image20.gif" alt="" width="336" height="285" />
<p>Cette bo&icirc;te de dialogue permet d'acc&eacute;der &agrave; 2 cat&eacute;gories de param&eacute;trage. </p>
<p>D'une part, il est possible de modifier l'extension des fichiers image que vous allez acqu&eacute;rir. Pour cela il suffit de d&eacute;finir le nouveau nom de votre extension (3 caract&egrave;res maximum) en modifiant le champ qui suit le libell&eacute; Vous pouvez choisir votre extension. Par d&eacute;faut cette extension est .fit. </p>
<p>Si vous ne disposez pas de beaucoup d'espace sur votre disque dur, vous pouvez opter pour les fichiers image au format compress&eacute; en cochant la case pr&eacute;c&eacute;dent Fichiers image compress&eacute;s (.gz). </p>
<p>Si vous avez gard&eacute; l'extension par d&eacute;faut .fit et que vous avez coch&eacute; l'option Fichiers image compress&eacute;s (.gz), alors vos images seront sauvegard&eacute;es avec l'extension .fit.gz. </p>
<p>D'autre part, il est possible de d&eacute;finir par l'interm&eacute;diaire d'une glissi&egrave;re la qualit&eacute; du format Jpeg, c'est un nombre variant de 5 &agrave; 100, par d&eacute;faut il est initialis&eacute; &agrave; 80. En effet Aud'ACE poss&egrave;de une fonctionnalit&eacute; int&eacute;ressante qui vous permet de sauvegarder, par exemple une image apr&egrave;s traitement, sous le format Jpeg afin d'illustrer une page web, inutile dans ce cas de passer par de multiples transformations pour arriver au but, Aud'ACE le fait en un simple clic de la souris : Vous ouvrez le menu d&eacute;roulant Fichier et vous choisissez l'option Enregistrer en Jpeg... </p>
<p>Une fois vos choix faits, vous devez les valider en appuyant sur le bouton OK ou Appliquer de la fen&ecirc;tre Fichiers image. Comme d'habitude, &agrave; la fermeture du logiciel, la sauvegarde de la nouvelle configuration vous sera demand&eacute;e. </p>
<h3> 7. Alarme sonore de fin de pose</h3>
<p> Ce param&eacute;trage vous permet de d&eacute;finir le moment o&ugrave; un signal sonore sera &eacute;mis par votre micro ordinateur pour vous avertir de l'imminence de la fin de la pose CCD. Cette option est int&eacute;ressante, si ne poss&eacute;dant pas d'obturateur sur votre cam&eacute;ra CCD, vous d&eacute;cidez de faire une obturation manuelle devant le tube de l'instrument. </p>
<p>En cliquant avec le bouton gauche de la souris sur Alarme sonore de fin de pose..., voici la bo&icirc;te de dialogue qui appara&icirc;t sur votre &eacute;cran : </p>
<img src="../images/image21.gif" alt="" width="318" height="131" />
<p>Vous avez donc le choix entre Active l'alarme sonore ou non, en cochant ou non la case qui pr&eacute;c&egrave;de ce commentaire. Dans le cas o&ugrave; vous avez choisi d'activer l'alarme sonore, vous devez indiquer &agrave; quel moment doit retentir ce signal, en renseignant le champ qui pr&eacute;c&egrave;de sec. avant la fin de la pose. Dans l'exemple de notre capture d'&eacute;cran, l'alarme retentira 2 secondes avant la fin de la pose CDD. </p>
<p>L&agrave; aussi, votre choix doit &ecirc;tre valid&eacute; par un appui sur le bouton OK ou Appliquer. La sauvegarde de la nouvelle configuration vous sera demand&eacute;e &agrave; la fermeture du logiciel. </p>
<h3> 8. Type de fen&ecirc;tre</h3>
<p>En cliquant avec le bouton gauche de la souris sur Type de fen&ecirc;tre... vous avez la bo&icirc;te de dialogue suivante &agrave; votre &eacute;cran : </p>
<img src="../images/image30.gif" alt="" width="356" height="151" />
<p>Ici c'est le choix du formatage des boutons de validation, d'aide et d'annulation qui vous est propos&eacute;. Vous pouvez donc choisir d'avoir toutes les bo&icirc;tes de dialogue avec 4 boutons (OK, Appliquer, Aide et Fermer) ou seulement avec 3 boutons (Appliquer, Aide et Fermer). C'est tout simplement une question de go&ucirc;t. Aud'ACE est livr&eacute;e par d&eacute;faut avec une configuration &agrave; 4 boutons. </p>
<p>Les boutons OK et Appliquer permettent de valider la modification des param&egrave;tres accessibles dans la bo&icirc;te de dialogue. Le bouton Appliquer assure seulement la validation du param&eacute;trage, il faut ensuite faire dispara&icirc;tre la bo&icirc;te en appuyant sur le bouton Fermer. Le bouton OK assure quant &agrave; lui les deux fonctions, il valide le nouveau param&eacute;trage et ensuite ferme la bo&icirc;te. </p>
<p>Le bouton Aide permet d'acc&egrave;der &agrave; l'aide de la bo&icirc;te de dialogue. </p>
<p>Enfin le bouton Fermer permet (s'il n'est pas pr&eacute;c&eacute;d&eacute; d'un appui sur Appliquer) la fermeture de la bo&icirc;te sans la prise en compte de la nouvelle configuration. </p>
<p>L&agrave; aussi, le choix de votre configuration (&agrave; 3 ou 4 boutons) doit &ecirc;tre valid&eacute; par un appui sur le bouton OK ou Appliquer. Comme d'habitude, la sauvegarde de la nouvelle configuration vous sera demand&eacute;e &agrave; la fermeture du logiciel. </p>
<h3> 9. Apparence</h3>
<p>En cliquant avec le bouton gauche de la souris sur Apparence... vous avez la bo&icirc;te de dialogue suivante qui s'ouvre sur votre &eacute;cran : </p>
<img src="../images/image56.gif" alt="" width="318" height="340" />
<p>Dans le cas pr&eacute;sent on a acc&egrave;s aux couleurs diurnes de l'interface Aud'ACE, c'est &agrave; dire &agrave; des couleurs pour une utilisation de jour. </p>
<p>Si vous souhaitez utiliser Aud'ACE avec ses couleurs nocturnes, pour par exemple acqu&eacute;rir des images la nuit et ainsi ne pas &ecirc;tre &eacute;bloui par votre &eacute;cran, il vous suffit de cliquer avec le bouton gauche de votre souris sur Nocturne. Vous changez dynamiquement toutes les couleurs de l'interface Aud'ACE et vous obtenez ceci pour la bo&icirc;te Apparence : </p>
<img src="../images/image57.gif" alt="" width="318" height="340" />
<p>Dans tous les cas, vous devez valider votre choix par un appui sur le bouton OK ou Appliquer. Comme d'habitude, &agrave la fermeture du logiciel il vous sera propos&eacute; de sauvegarder cette nouvelle configuration. </p>
<p>Si l'interface Aud'ACE en couleurs diurnes est : </p>
<img src="../images/image05.gif" alt="" width="738" height="511" />
<p>Alors en couleurs nocturnes, elle peut prendre l'apparence suivante : </p>
<img src="../images/image58.gif" alt="" width="737" height="511" />
<p>Bien entendu, il vous est tout &agrave; fait possible de personnaliser les couleurs de votre interface que ce soit pour une utilisation diurne ou une utilisation nocturne. Rien de plus simple. Apr&egrave;s avoir s&eacute;lectionn&eacute; le mode diurne ou nocturne, il vous faut cliquer avec le bouton gauche de votre souris sur le bouton qui d&eacute;finit la couleur que vous souhaitez modifier. Si par exemple, vous souhaitez changer la couleur du fond g&eacute;n&eacute;ral de l'interface (couleur d&eacute;nom&eacute;e 'backColor'), il vous suffit d'appuyer sur son bouton. Vous obtenez : </p>
<img src="../images/image59.gif" alt="" width="509" height="472" />
<p>Apr&egrave;s avoir s&eacute;lectionn&eacute; la nouvelle couleur, appuyez sur le bouton OK de la bo&icirc;te S&eacute;lection de la couleur : backColor. La totalit&eacute; de l'interface Aud'ACE se pare de cette nouvelle couleur : </p>
<img src="../images/image60.gif" alt="" width="739" height="511" />
<p>Vous devez valider votre choix en appuyant sur le bouton OK ou Appliquer de la bo&icirc;te Apparence. </p>
<p>Si ce choix ne vous convient pas, il est tout &agrave; fait possible de revenir en arri&egrave;re. Vous devez quitter le logiciel Aud'ACE et r&eacute;pondre non &agrave l'invitation qui vous est faite de sauvegarder cette nouvelle configuration. Au prochain d&eacute;marrage, Aud'ACE se parera de ces anciennes couleurs. </p>
<p>Si par m&eacute;garde vous avez valid&eacute; la nouvelle configuration, il vous faudra ouvrir la bo&icirc;te Apparence et cliquer sur le bouton Couleurs d'origine pour revenir aux r&eacute;glages 'usine'. Une nouvelle bo&icirc;te de dialogue s'affiche et vous invite &agrave; r&eacute;tablir ou non les couleurs d'origine. </p>
<img src="../images/image61.gif" alt="" width="338" height="126" />
<p> Pour votre information voici &agrave; titre d'exemple les principales fonctions des noms des diff&eacute;rents boutons : </p>
<ul>
<li>activeBackColor : Couleur sp&eacute;cifique utilis&eacute;e dans les tableaux bicolores. </li>
<li>activeTextColor : Couleur prise par le libell&eacute; d'un bouton quand on appuye dessus. </li>
<li>backColor : Couleur g&eacute;n&eacute;rale du fond de l'interface. </li>
<li>backColor2 : Couleur sp&eacute;cifique de certains fonds de l'interface. </li>
<li>canvas : Couleur des surfaces dans lesquelles s'affichent les images. </li>
<li>drag_rectangle : Couleur du rectangle trac&eacute; avec la souris pour s&eacute;lectionner une zone. </li>
<li>entryBackColor : Couleur du fond d'une zone de saisie de donn&eacute;es en mode normal. </li>
<li>entryBackColor2 : Couleur du fond d'une zone de saisie de donn&eacute;es en mode inactif. </li>
<li>entryTextColor : Couleur du texte dans une zone de saisie de donn&eacute;es. </li>
<li>listBox : Couleur du fond des listes d&eacute;roulantes avec ascenseur. </li>
<li>textColor : Couleur g&eacute;n&eacute;rale des textes, hors zones de saisie des donn&eacute;es. </li>
</ul>
<p>Le plus simple est encore de changer les couleurs une &agrave; une et d'observer les &eacute;volutions dans l'interface Aud'ACE. </p>
<h3> 10. S&eacute;lection des outils</h3>
<p>Bien que cette option ne soit pas accessible par le menu d&eacute;roulant Configuration, il est important d'en parler ici. </p>
<p>Ce param&eacute;trage permet de s&eacute;lectionner les outils que l'on souhaite accessibles &agrave; partir du menu d&eacute;roulant Outils et d'y associer &eacute;ventuellement un raccourci par l'interm&eacute;diaire de touches du clavier. En cliquant avec le bouton gauche de la souris sur S&eacute;lection des outils... vous avez par exemple la bo&icirc;te de dialogue suivante qui s'affiche &agrave; l'&eacute;cran : </p>
<img src="../images/image23.gif" alt="" width="425" height="364" />
<p>Par d&eacute;faut au premier d&eacute;marrage du logiciel tous les outils disponibles dans le r&eacute;pertoire "\audace\plugin\tool\" sont s&eacute;lectionn&eacute;s et donc accessibles &agrave; partir du menu d&eacute;roulant Outils. On a donc par exemple le r&eacute;sultat suivant : </p>
<img src="../images/image24.gif" alt="" width="639" height="507" />
<p>Il est tout &agrave; fait possible de limiter les outils disponibles avec le menu d&eacute;roulant &agrave; ceux que l'on utilise couramment. Pour cela, il suffit de faire le choix en d&eacute;cochant (l'outil n'appara&icirc;tra plus dans le menu) ou en cochant (l'outil appara&icirc;tra &agrave; nouveau dans le menu) des cases et en associant &eacute;ventuellement un raccourci &agrave; certains outils. Par exemple, on peut avoir r&eacute;alis&eacute; les choix suivants : </p>
<img src="../images/image25.gif" alt="" width="425" height="364" />
<p>L'association d'un raccourci &agrave; un outil se fait par l'interm&eacute;diaire du <img src="../images/image15.gif" alt="" width="18"
 height="18" /> qui suit le nom de l'outil. Il ouvre le choix aux raccourcis suivants : F2 &agrave; F11, Ctrl+A &agrave; Ctrl+Z (sauf &agrave; Ctrl+O, Ctrl+Q et Ctrl+S qui sont d&eacute;j&agrave; utilis&eacute;s dans le menu d&eacute;roulant Fichier) et bien s&ucirc;r &agrave; 'pas de raccourci' (choix 'vide').</p>
<p>Par simple validation, en cliquant tout simplement sur le bouton OK ou Appliquer, le nouveau param&eacute;trage des outils est instantan&eacute;ment pris en compte. Il en r&eacute;sulte le nouveau menu d&eacute;roulant Outils ci-dessous conforme &agrave; ce choix : </p>
<img src="../images/image26.gif" alt="" width="639" height="507" />
<p>La sauvegarde de cette nouvelle configuration vous sera demand&eacute;e &agrave; la fermeture du logiciel comme pour toute autre modification du param&eacute;trage.</p>
<p>Nota important : Pour que l'ouverture d'un outil par l'interm&eacute;diaire des raccourcis soit active, il faut que la fen&ecirc;tre principale d'Aud'ACE soit active, c'est &agrave; dire avec la barre des titres en bleue. Si c'est la Console qui est active, l'appui sur les raccourcis est inactif.</p>
<p>Remarque : L'outil qui est associ&eacute; au raccourci clavier F2 s'affichera automatiquement au prochain d&eacute;marrage du logiciel. C'est l'outil par d&eacute;faut. </p>
</body>

</html>
