<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Aide</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 17 mars 2005</p>
<h1>Aide </h1>
<p> Comme tout logiciel digne de ce nom, Aud'ACE vous permet d'acc&eacute;der &agrave; une aide compl&egrave;te par le menu d&eacute;roulant Aide : </p>
<img src="../images/image38.gif" alt="" width="639" height="161" />
<h3> 1. Sommaire</h3>
<p> Un simple clic de souris sur Sommaire ouvre la fen&ecirc;tre suivante pour naviguer dans l'arborescence de l'aide : </p>
<img src="../images/image54.gif" alt="" width="638" height="484" />
<h3> 2. Index des fonctions</h3>
<p> Par un simple clic sur Index des fonctions, vous avez acc&egrave;s &agrave; toutes les fonctions disponibles du logiciel. Elles sont g&eacute;n&eacute;ralement accompagn&eacute;es d'une description plus ou moins d&eacute;taill&eacute;e. </p>
<img src="../images/image40.gif" alt="" width="639" height="159" />
<h3> 3. Acc&egrave;s au Site Web</h3>
<p>Vous avez deux possibilit&eacute;s pour acc&eacute;der au Site Web : </p>
<p>Soit directement via une liaison Internet par l'option Site Web (Internet), mais attention il faut &eacute;galement avoir correctement configur&eacute; le Navigateur Web dans la bo&icirc;te de dialogue des Editeurs (Configuration --&gt; Editeurs) : </p>
<img src="../images/image42.gif" alt="" width="769" height="163" />
<p>Soit en acc&eacute;dant &agrave; une copie locale du site web sur votre disque dur par l'option Site Web (copie sur le disque dur)... Cette copie doit imp&eacute;rativement &ecirc;tre dans le r&eacute;pertoire \gui\audace\doc_html\web_site. Et bien s&ucirc;r la rubrique Navigateur Web doit &ecirc;tre correctement configur&eacute;e dans la bo&icirc;te de dialogue des Editeurs (Configuration --&gt; Editeurs) : </p>
<img src="../images/image43.gif" alt="" width="768" height="162" />
<h3> 4. Acc&egrave;s &agrave; la documentation sous forme de fichiers pdf</h3>
<p> Certaines documentions sont uniquement accessibles sous la forme de fichiers pdf. Pas de probl&egrave;me, si vous avez correctement configur&eacute; Aud'ACE en d&eacute;finissant la localisation d'Acrobat Reader dans la rubrique Voir les notices (.pdf) (Configuration --&gt; Editeurs), un simple clic de souris sur Notices (.pdf)... : </p>
<img src="../images/image44.gif" alt="" width="639" height="159" />
<p>Et la bo&icirc;te de dialogue suivante s'ouvre : </p>
<img src="../images/image45.gif" alt="" width="563" height="419" />
<p>Dans notre exemple nous avons choisi de visualiser la notice d&eacute;crivant la cam&eacute;ra MASCOT (Mini All Sky Cloud Observation Tool) de surveillance du ciel pour les VLT (Very Large Telescopes) &agrave; La Silla pilot&eacute;e par Aud'ACE. Apr&egrave;s avoir s&eacute;lectionn&eacute; le fichier mascot.pdf, il vous suffit d'appuyer sur le bouton Ouvrir. Acrobat Reader se lance et ouvre le document s&eacute;lectionn&eacute;. Une autre fa&ccedil;on consiste &agrave; double cliquer sur l'ic&ocirc;ne du fichier choisi, l&agrave; aussi Acrobat Reader se lance et ouvre automatiquement la notice d&eacute;sir&eacute;e. </p>
<h3> 5. A propos de ...</h3>
<p> Un simple clic de souris sur A propos de ... : </p>
<img src="../images/image55.gif" alt="" width="639" height="159" />
<p> Et la fen&ecirc;tre suivante s'ouvre : </p>
<img src="../images/image39.gif" alt="" width="343" height="481" />
<p>Elle vous communique diverses informations comme la version du logiciel que vous &ecirc;tes en train d'utiliser, la version de l'interpr&eacute;teur Tcl/Tk trouv&eacute;, la date de mise &agrave; jour, la certitude que ce logiciel est libre et gratuit, le lien hypertexte qui permet une connexion directe au site officiel, le copyright, ainsi que les noms des diff&eacute;rentes personnes ayant contribu&eacute;es au d&eacute;veloppement et &agrave; la traduction, respectivement en anglais, en italien, en espagnol, en allemand et en danois de la pr&eacute;sente distribution. </p>
<p>Vous disposez avec ce menu Aide de tous les &eacute;l&eacute;ments n&eacute;cessaires pour utiliser correctement Aud'ACE. Il ne vous reste plus qu'&agrave; vous lancer.</p>
</body>

</html>
