<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration de la cam&eacute;ra</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 26 juin 2006</p>
<h1>Configuration de la cam&eacute;ra </h1>
<p> Pour r&eacute;gler les param&egrave;tres de connexion d'une cam&eacute;ra, il faut ouvrir la fen&ecirc;tre de configuration des cam&eacute;ras. Pour cela, vous devez aller dans le menu d&eacute;roulant Configuration, puis cliquer sur Cam&eacute;ra... : </p>
<img src="../../images/image62.gif" alt="" width="639" height="507" />
<p> La fen&ecirc;tre de configuration des cam&eacute;ras se pr&eacute;sente sous la forme suivante : </p>
<img src="../../images/image63.gif" alt="" width="628" height="394" />
<p> Vous pouvez constater que le logiciel supporte un certain nombre de cam&eacute;ras. Il vous suffit de cliquer sur les diff&eacute;rents onglets disponibles (Audine, Hi-SIS, SBIG, CB245, Starlight, Kitty, WebCam, AudiNet, EthernAude, TH7852A, SCR1300XTC, APN) pour explorer les possibilit&eacute;s de pilotage. </p>
<p> Dans la partie inf&eacute;rieure de la fen&ecirc;tre ci-dessus, vous constatez la pr&eacute;sence, derri&egrave;re une case &agrave; cocher, du message suivant : Connexion automatique de cette cam&eacute;ra au prochain d&eacute;marrage </p>
<img src="../../images/image64.gif" alt="" width="338" height="22" />
<p> Si apr&egrave;s avoir coch&eacute; cette case, vous appuyez sur le bouton OK ou Appliquer, &agrave; la fermeture du logiciel, celui-ci vous demandera d'enregistrer la nouvelle configuration. </p>
<img src="../../images/image65.gif" alt="" width="343" height="23" />
<p> Au prochain d&eacute;marrage du logiciel, vous n'aurez pas &agrave; reconfigurer votre cam&eacute;ra. Avec cette option, la cam&eacute;ra Audine (dans notre exemple) se connecte automatiquement en utilisant le param&eacute;trage pr&eacute;c&eacute;demment choisi. </p>
<p> Vous pouvez v&eacute;rifier ceci en notant apr&egrave;s l'ouverture du logiciel la pr&eacute;sence de audine (pour notre exemple) en face de Cam&eacute;ra dans la partie inf&eacute;rieure droite de la fen&ecirc;tre principale (voir l'exemple ci-dessous). </p>
<img src="../../images/image66.gif" alt="" width="639" height="81" />
<p> Cette option est int&eacute;ressante pour la plupart des utilisateurs car ils ne poss&egrave;dent g&eacute;n&eacute;ralement qu'une seule cam&eacute;ra. Elle leur &eacute;conomise quelques manipulations dans les menus. </p>
<img src="../../images/image67.gif" alt="" width="627" height="47" />
<p> Enfin cette fen&ecirc;tre comporte 4 boutons dans sa partie inf&eacute;rieure dont les fonctions sont les suivantes : </p>
<ul>
  <li> OK : Applique le param&eacute;trage choisi pour la cam&eacute;ra d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et ferme la fen&ecirc;tre de configuration des cam&eacute;ras.</li>
  <li> Appliquer : Applique le param&eacute;trage choisi pour la cam&eacute;ra d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et laisse la fen&ecirc;tre de configuration des cam&eacute;ras ouverte.</li>
  <li> Aide : Permet d'acc&eacute;der directement à l'aide pour la configuration de la cam&eacute;ra choisie par l'onglet s&eacute;lectionn&eacute;.</li>
  <li> Fermer : Ferme la fen&ecirc;tre de configuration des cam&eacute;ras sans prendre en compte les param&egrave;tres modifi&eacute;s.</li>
</ul>
<p> Vous pouvez acc&eacute;der au param&eacute;trage de chaque cam&eacute;ra en cliquant <a href="../../../../doc_html/french/09configuration/02camera/1020cameras.htm">ici</a>. </p>
</body>

</html>
