<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=ISO-8859-1" />
  <title>Tutoriel sur la d&eacute;termination des param&egrave;tres
&eacute;lectroniques d'une cam&eacute;ra CCD</title>
</head>
<body style="color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee"
 vlink="#551a8b">
<p class="date">Date de
mise &agrave; jour : 19 septembre 2012<br />
</p>
<h1>Tutoriel sur la d&eacute;termination des param&egrave;tres
&eacute;lectroniques d'une cam&eacute;ra CCD</h1>
Dans le cadre de la caract&eacute;risation des performances d'une
cam&eacute;ra CCD, la d&eacute;termination de param&egrave;tres
essentiels, tels que le gain et le bruit de lecture constitue une
&eacute;tape indispensable. Notamment, ces param&egrave;tres pourront
&ecirc;tre introduits dans l'Exposure Time Calculator afin de simuler
les performances theoriques attendues et les confronter ensuite aux
images r&eacute;elles. <br />
<br />
Dans ce document, nous commen&ccedil;ons par d&eacute;crire la
th&eacute;orie utilis&eacute;e pour
caract&eacute;riser les param&egrave;tres &eacute;lectroniques d'une
cam&eacute;ra CCD puis nous
d&eacute;crivons
les fonctions int&eacute;gr&eacute;es dans le logiciel AudeLA.<br />
<h1>1. Les param&egrave;tres &eacute;lectroniques d'une cam&eacute;ra
CCD</h1>
L'utilisateur d'une cam&eacute;ra CCD ne dispose que de sa
cam&eacute;ra reli&eacute;e &agrave; AudeLA, une pi&egrave;ce dans
laquelle on peut faire l'obcurit&eacute; compl&egrave;te ou mettre un
niveau de lumi&egrave;re constant. Il n'est pas n&eacute;cessaire de
d&eacute;monter la cam&eacute;ra ni d'utiliser des voltm&egrave;tres ou
oscilloscopes. Les proc&eacute;dures sont simples &agrave;
r&eacute;aliser.<br />
<br />
Un pixel du capteur CCD g&eacute;n&egrave;re un niveau que l'on peut
lire avec AudeLA sous la forme d'un nombre not&eacute; ADU (pour Analog
Digital Unit). Ce niveau est constitu&eacute; de plusieurs sources de
signaux que nous d&eacute;crirons en d&eacute;tail par la suite: Le
bias, le thermique et le signal photonique. M&ecirc;me en
op&eacute;rant le plus proprement possible, chacune de ces composantes
est affect&eacute;e d'une incertitude (le bruit) qui se traduit par le
fait que deux image r&eacute;alis&eacute;es dans des conditions
identiques n'ont pas la m&ecirc;me valeur de niveau dans les pixels. <br />
<br />
A d&eacute;part, le capteur CCD voit arriver des photons. Leur
int&eacute;raction avec le silicium du pixel g&eacute;n&egrave;re des
&eacute;lectrons pi&eacute;g&eacute;s dans le pixel. On appelle
rendement quantique &eacute;quivalent, le nombre d'&eacute;lectrons
g&eacute;n&eacute;r&eacute;s pour un photon incident sur le pixel. Ce
nombre est toujours inf&eacute;rieur &agrave; l'unit&eacute; et souvent
exprim&eacute; en pourcents (100% pour un rendement quantique de 1
&eacute;lectron/photon). Le rendement quantique &eacute;quivalent est
d'environ 60% pour un capteur CCD classique (&eacute;clair&eacute; par
l'avant) et peut atteindre 95% pour les excellents capteurs CCD amincis
(&eacute;clair&eacute;s par l'arri&egrave;re).<br />
<br />
A la sortie de l'&eacute;lectronique environnant la cam&eacute;ra CCD,
le pixel contient un niveau en ADU. L'&eacute;lectornique peut donc
&ecirc;tre consid&eacute;r&eacute;e comme une conversion entre des
&eacute;lectrons et des ADU. Cette conversion est un param&egrave;tre
important qu'il faut d&eacute;terminer. On l'appelle commun&eacute;ment
le gain (not&eacute; G par la suite). Il s'exprime en electrons/ADU. En
g&eacute;n&eacute;ral, une cam&eacute;ra commercial est
r&eacute;gl&eacute;e de fa&ccedil;on&nbsp;&agrave; avoir un gain
compris entre 1 et 5 &eacute;lectron/ADU. Les cam&eacute;ras simples
n'ont qu'un seul gain. Parfois, l'&eacute;lectronique de la
cam&eacute;ra permet de choisir deux ou trois gains diff&eacute;rents
qui sont g&eacute;r&eacute;s par le logiciel de pilotage. Il convient
de se renseignenr sur ces fonctionnalit&eacute;s.<br />
<br />
Connaissant la valeur du gain d'une cam&eacute;ra, on peut alors
exprimer les niveaux des pixels soit en ADU, soit en &eacute;lectrons.<br />
<br />
Comme il a &eacute;t&eacute; dit pr&eacute;c&eacute;demment, deux
mesures cons&eacute;cutives du niveau d'un pixel soumis &agrave; un
&eacute;clairement&nbsp;identique ne fournissent pas les m&ecirc;mes
valeurs &agrave; cause du bruit. Le bruit des composantes thermiques et
photoniques suivent une loi pr&eacute;cise bas&eacute;e sur les
th&eacute;ories de la physique. En revanche, le bruit de lecture est
une caract&eacute;ritique de la qualit&eacute; du capteur CCD et de
l'&eacute;lectronique. La d&eacute;temrination du bruit de lecture est
un param&egrave;tre important pour qualifier une cam&eacute;ra CCD. On
exprime habituellement le bruit en &eacute;lectrons (not&eacute; b(el)
par la suite).<br />
<br />
Attention, les capteurs CCD &agrave; multiplication d'&eacute;lectrons
(EMCCD) sont
des capteurs CCD qui on un &eacute;tage de pixels
suppl&eacute;mentaires permettant
de multiplier le nombre d'&eacute;lectrons avant la sortie du capteur.
L'utilisateur peut r&eacute;gler le coefficient multiplicateur Em par
logiciel (Em peut varier g&eacute;n&eacute;ralement entre 1 et 500).
Parfois, Em est appel&eacute; abusivement gain. Il ne faut donc pas
confondre le "gain EMCCD" qui est le coefficient multiplicateur Em sans
unit&eacute; avec le gain de la cam&eacute;ra qui s'exprime en
&eacute;lectrons/ADU.<br />
<br />
La composante thermique est constitu&eacute;e d'un signal dont le
niveau est proportionel au temps de pose. Le coefficient de
proportionalit&eacute; s'exprime en &eacute;lectrons/seconde/pixel.
Plus la cam&eacute;ra est refroidie, plus ce coefficient est petit. La
d&eacute;termination du coefficient thermique est tr&egrave;s
importante pour savoir si l'on refroidit assez ou non la cam&eacute;ra
CCD.<br />
<h1>2. Th&eacute;orie de d&eacute;termination des param&egrave;tres
&eacute;lectroniques</h1>
Le niveau d'un pixel est constitu&eacute; de trois composantes:<br />
<ul>
  <li>(el) : La composante &eacute;lectronique, due aux r&eacute;glages
et &agrave; la qualit&eacute; des composants &eacute;lectroniques</li>
  <li>(th) : La composante thermique, due &agrave; la
temp&eacute;rature appliqu&eacute;e au capteur CCD.</li>
  <li>(ph) : La composante photonique, due &agrave; la
g&eacute;n&eacute;ration d'&eacute;lectrons suite &agrave;
l'interaction des photons avec le silicium du pixel du CCD.</li>
</ul>
<p style="margin-bottom: 0cm;" lang="fr-FR">On note :</p>
<ul>
  <li> s : le signal (exprim&eacute; en &eacute;lectrons)</li>
  <li>S : le signal (exprim&eacute; en ADU)</li>
  <li>b : le bruit (exprim&eacute; en &eacute;lectrons)</li>
  <li>B : le bruit (exprim&eacute; en ADU)</li>
</ul>
<p style="margin-bottom: 0cm;" lang="fr-FR">Ainsi, S(th) sera le signal
thermique exprim&eacute; en ADU. Il est &agrave; pr&eacute;ciser que
l'utilisateur n'a acc&egrave;s qu'aux mesures de signal et bruit en ADU
(S et B).</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">G : le gain
(&eacute;lectrons/ADU) d&eacute;fini par </p>
<p style="margin-bottom: 0cm;" lang="fr-FR"> s = G*S [1]<br />
b = G*B [2]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Le signal total S(tot)
d'un pixel est &eacute;gal &agrave; : S(tot) = S(el) + S(th) + S(ph) [3]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Avec,&nbsp;</p>
<ul>
  <li>S(el) : le signal
&eacute;lectronique (=bias)</li>
  <li>S(th) : le signal
thermique (attention ce n'est pas directement ce que l'on appelle
commun&eacute;ment de dark)</li>
  <li>S(ph) : le signal
photonique</li>
</ul>
<p style="margin-bottom: 0cm;" lang="fr-FR">Les bruits thermique b(th)
et photonique b(ph) suivent une loi de Poisson. Donc</p>
<p style="margin-bottom: 0cm;" lang="fr-FR"> b(th)^2=s(th) [4]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR"> b(ph)^2=s(ph) [5]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Le bruit
&eacute;lectronique
b(el) a une dispersion constante. Il est appel&eacute; aussi "bruit de
lecture".</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Les sources de bruit sont
ind&eacute;pendantes, donc :</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">b(tot)^2 = b(el)^2 +
b(th)^2 + b(ph)^2 [6]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">La combinaison des formules
[1] &agrave; [6] d&eacute;crites ci-dessus m&egrave;ne aux formules [7]
et [8] qui nous int&eacute;ressent:<br />
</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[2] =&gt; b(tot)^2 = G^2 *
B(tot)^2</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[2] =&gt; b(el)^2 = G^2 *
B(el)^2</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[4] &amp; [1] =&gt;
b(th)^2 = s(th) = G * S(th)</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[5] &amp; [1] =&gt;
b(ph)^2 = s(ph) = G * S(ph)</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[6] =&gt; G^2 * B(tot)^2 =
G^2 * B(el)^2 + G * S(th) + G * S(ph)</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">On simplifie par G cette
derni&egrave;re &eacute;quation et l'on obtient :</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">G * ( B(tot)^2 - B(el)^2
) = S(th) + S(ph)</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">G * ( B(tot)^2 - B(el)^2
) = S(tot) - S(el)</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">G = ( S(tot) - S(el) ) /
( B(tot)^2 - B(el)^2 ) [7]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">S(tot) correspond a une
image brute de flat field.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">S(el) correspond a une
image brute de bias.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">B(tot) correspond &agrave;
l'&eacute;cart type de la valeur d'un pixel sur l'image brute de flat
field.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">B(el) correspond &agrave;
l'&eacute;cart type de la valeur d'un pixel sur l'image brute de bias.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Le bruit de lecture est
simplement d&eacute;termin&eacute; par : </p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[2] =&gt; b(el) = G *
B(el) [8]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Le coefficient thermique
est d&eacute;termin&eacute; en mesurant S(th) pour diff&eacute;rents
temps de pose. Ainsi on peut distinguer S(th,t) pour chaque temps de
pose t. On effectue une r&eacute;gression lin&eacute;aire entre t et
S(th,t) et l'on obtient le coefficient thermique exprim&eacute; en
ADU/seconde/pixel. Il suffit de la multiplier par le gian G pour
l'exprimer en &eacute;lectrons/seconde/pixel.</p>
<h1>3. M&eacute;thodes de d&eacute;termination des param&egrave;tres
&eacute;lectroniques</h1>
Pour d&eacute;terminer b(el) et G en appliquant les formules [7] et
[8], il faut simplement mesurer S(tot), S(el), B(tot) et B(el). S(tot)
correspond au niveau ADU du pixel d'une
image brute de flat field. S(el) correspond au niveau ADU d'un pixel
d'une
image brute de bias.
<br />
<br />
Il y a deux m&eacute;thodes pour
d&eacute;terminer B(tot) et B(el).
<p style="margin-bottom: 0cm;" lang="fr-FR">La premi&egrave;re est une
m&eacute;thode rigoureuse qui consiste &agrave; enregistrer N images de
flat et
de bias (N&gt;20 typiquement). Sur le lot des images de flat, on
choisit un pixel et on mesure S(tot) et B(tot) comme la moyenne et
l'&eacute;cart type de la valeur ADU du pixel sur les N images. On peut
ainsi d&eacute;terminer G et b(el) pour chaque pixel. On peut ainsi
mettre
en &eacute;vidence des d&eacute;fauts d'uniformit&eacute; de b(el)
(assez fr&eacute;quent) ou
de G.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Le seconde m&eacute;thode
est
exp&eacute;ditive et repose sur le fait de ne prendre que deux images
de
bias S1(el) et S2(el) et deux images de flat S1(tot) et S2(tot). Dans
cette m&eacute;thode on consid&egrave;re que tous les pixels ont les
m&ecirc;mes G et
b(el). Dans ce contexte, la moyenne de la diff&eacute;rence S1-S2 doit
valoir z&eacute;ro et la dispersion des valeurs de S1-S2 autour de
z&eacute;ro
met en &eacute;vidence le bruit. Lorsque les deux signaux S1 et S2 sont
soustraits la variance du signal r&eacute;sultat est donn&eacute; par
la
relation:</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">[9] : variance( S1 - S2 )
= B1^2 + B2^2</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">Comme on consid&egrave;re
B1=B2,
alors, B = 1/sqrt(2) * ecart_type( S1 - S2 ) [10]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">On applique [10] aux deux
images de bias, B(el) = 1/sqrt(2) * ecart_type( S1(el) - S2(el) ) [11]</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">On applique [10] aux deux
images de flat, B(tot) = 1/sqrt(2) * ecart_type( S1(tot) - S2(tot) )
[12]</p>
<h1>4. Pratique de la d&eacute;termination des param&egrave;tres
&eacute;lectroniques avec AudeLA</h1>
Il est &agrave; noter que la d&eacute;termination des param&egrave;tres
&eacute;lectronique est valable pour un binning donn&eacute; (et pour
une valeur Em donn&eacute;e dans le cas d'un EMCCD).<br />
<h2>4.1. D&eacute;termination du gain et du bruit de lecture</h2>
<p style="margin-bottom: 0cm;" lang="fr-FR">On effectue deux images de
bias S1(el) et S2(el). Il s'agit de deux images effectu&eacute;es dans
l'obscurit&eacute; totale (bouchon bien viss&eacute; sur l'objectif),
de temps de
pose le plus court possible pour rendre n&eacute;gligeable le signal
thermique. Soient Sel1.fit et Sel2.fit les deux fichiers FITS
correspondants.</p>
<p style="margin-bottom: 0cm;" lang="fr-FR">On effectue deux images de
flat S1(tot) et S2(tot). Il s'agit de deux images effectu&eacute;es sur
un
&eacute;cran blanc, d&eacute;focalis&eacute; si possible et
&eacute;clair&eacute; rigoureusement de
la m&ecirc;me fa&ccedil;on (peut importe la couleur de la
lumi&egrave;re &agrave; priori). Les temps de poses doivent aussi
&ecirc;tre
rigoureusement les m&ecirc;mes (pas d'obturation manuelle). On
v&eacute;rifiera
que l'image S1(tot) - S2(tot) soit &eacute;gale &agrave; z&eacute;ro.
Le niveau moyen
des flats doit remplir une partie importante de la dynamique (70% est
un bon choix). Soient Stot1.fit et Stot2.fit les deux fichiers FITS
correspondants.</p>
<br />
La commande en ligne dans la console AudeLA est:<br />
<br />
electronic_chip gainnoise Sel1 Sel2 Stot1 Stot2<br />
<br />
La fonction affiche les valeurs calcul&eacute;es de gain et de bruit de
lecture.<br />
<h2>4.2. D&eacute;termination du coefficient thermique</h2>
<p style="margin-bottom: 0cm;" lang="fr-FR">On effectue une
s&eacute;rie typiquement de 10 images de dark. Il s'agit d'images
effectu&eacute;es dans
l'obscurit&eacute; totale (bouchon bien viss&eacute; sur l'objectif),
de temps de
pose commen&ccedil;ant &agrave; 10s jusqu'&agrave; 100s par exemple.
Soient dark1.fit, dark2.fit ... dark10.fit les noms des fichiers FITS
correspondants.</p>
<br />
La commande en ligne dans la console AudeLA est:<br />
<br />
electronic_chip lintherm dark 10<br />
<br />
La fonction affiche les valeurs calcul&eacute;es du coefficient
thermique en ADU/seconde/pixel et du bias en ADU.<br />
<br />
Si l'on a d&eacute;j&agrave; d&eacute;termin&eacute; le gain G et le
bruit de lecture b(el), on peut les utiliser dans cette fonction. Par
exemple, avec G=2.78 &eacute;lectrons/ADU et b(el)=8.2
&eacute;lectrons, on &eacute;crira:<br />
<br />
electronic_chip lintherm dark 10 2.78 8.2<br />
<br />
La fonction affichera les valeurs calcul&eacute;es du coefficient
thermique en &eacute;lectron/seconde/pixel et du bias en ADU (&ccedil;a
n'est&nbsp;pas pertinent d'exprimer le bias en &eacute;lectrons).<br />
<br />
Enfin, si l'on conna&icirc;t aussi le niveau ADU de saturation de la
cam&eacute;ra, on peut l'introduire pour d&eacute;terminer le temps de
pose maximal pour saturation thermique. Par exemple, pour une
saturation &agrave; 65535 ADU:<br />
<br />
electronic_chip lintherm dark 10 2.78 8.2 65535<br />
<br />
Dans tous les cas, la fonction affiche aussi le temps pose critique. Si
l'on souhaite effectuer des temps de poses sup&eacute;rieurs &agrave;
ce temps de pose critique, le bruit thermique sera pr&eacute;dominant
sur le bruit de lecture. Cela signifie qu'il est alors
pr&eacute;f&eacute;rable de refroidir davantage la cam&eacute;ra. Cette
analyse est importante car elle permet de savoir si la
temp&eacute;rature de refroisissement de la cam&eacute;ra test&eacute;e
est suffisante ou non par rapport aux temps de poses que l'on souhaite
utiliser dans la nuit.<span style="font-weight: bold;"><br />
</span>
<h2>4.3. D&eacute;termination du retard d'ouverture de l'obturateur</h2>
Lorsque l'on utilise une cam&eacute;ra &eacute;quip&eacute;e d'un
obturateur &agrave; iris, il peut &ecirc;tre important de
conna&icirc;tre la fa&ccedil;on dont s'ouvre et se ferme l'obturateur
de fa&ccedil;on &agrave; corriger les pixels notamment pour atteindre
la millimagnitude en photom&eacute;trie (transits d'expolan&egrave;tes
par exemple). AudeLA permet de snyth&eacute;tiser une image dont
l'intensit&eacute; des pixels donne le retard (en seconde) par rapport
au centre du champ.<br />
<br />
On effectue une s&eacute;rie typiquement de 20 images de flat. Il
s'agit d'images effectu&eacute;es dans une ambiance lumineuse de niveau
constant
de temps de
pose commen&ccedil;ant &agrave; 0,1s jusqu'&agrave; 2,0s par exemple.
Soient flat1.fit, flat2.fit ... flat20.fit les noms des fichiers FITS
correspondants.
<br />
<br />
La commande en ligne dans la console AudeLA est:<br />
<br />
electronic_chip shutter flat 20<br />
<br />
La fonction affiche l'image de synth&egrave;se. Il suffit de passer le
curseur sur les pixels pour conna&icirc;tre le retard.<br />
</body>
</html>
