<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration de l'&eacute;quipement</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 26 juin 2006</p>
<h1>Configuration de l'&eacute;quipement </h1>
<p> Pour r&eacute;gler les param&egrave;tres de connexion d'un &eacute;quipement, il faut ouvrir la fen&ecirc;tre de configuration des &eacute;quipements. Pour cela, vous devez aller dans le menu d&eacute;roulant Configuration, puis cliquer sur Equipement... : </p>
<img src="../../images/image74.gif" alt="" width="639" height="507" />
<p> La fen&ecirc;tre de configuration des &eacute;quipements se pr&eacute;sente sous la forme suivante : </p>
<img src="../../images/image75.gif" alt="" width="468" height="439" />
<p> Vous pouvez constater que le logiciel supporte un certain nombre d'&eacute;quipements. Il vous suffit de cliquer sur les diff&eacute;rents onglets disponibles (Roue &agrave; filtres) pour explorer les possibilit&eacute;s de pilotage. </p>
<p> Dans la partie inf&eacute;rieure de la fen&ecirc;tre ci-dessus, vous constatez la pr&eacute;sence, derri&egrave;re une case &agrave; cocher, du message suivant : Connexion automatique de cet &eacute;quipement au prochain d&eacute;marrage </p>
<img src="../../images/image76.gif" alt="" width="345" height="24" />
<p> Si apr&egrave;s avoir coch&eacute; cette case, vous appuyez sur le bouton OK ou Appliquer, &agrave; la fermeture du logiciel, celui-ci vous demandera d'enregistrer la nouvelle configuration. </p>
<img src="../../images/image77.gif" alt="" width="353" height="22" />
<p> Au prochain d&eacute;marrage du logiciel, vous n'aurez pas &agrave; reconfigurer votre &eacute;quipement. Avec cette option, l'&eacute;quipement Roue &agrave; filtres (dans notre exemple) se connecte automatiquement en utilisant le param&eacute;trage pr&eacute;c&eacute;demment choisi. </p>
<p> Cette option est int&eacute;ressante pour la plupart des utilisateurs car ils utilisent souvent le m&ecirc;me &eacute;quipement. Elle leur &eacute;conomise quelques manipulations dans les menus. </p>
<img src="../../images/image78.gif" alt="" width="468" height="49" />
<p> Enfin cette fen&ecirc;tre comporte 4 boutons dans sa partie inf&eacute;rieure dont les fonctions sont les suivantes : </p>
<ul>
  <li> OK : Applique le param&eacute;trage choisi pour l'&eacute;quipement d&eacute;fini par l'onglet s&eacute;lectionn&eacute; et ferme la fen&ecirc;tre de configuration des &eacute;quipements.</li>
  <li> Appliquer : Applique le param&eacute;trage choisi pour l'&eacute;quipement d&eacute;fini par l'onglet s&eacute;lectionn&eacute; et laisse la fen&ecirc;tre de configuration des &eacute;quipements ouverte.</li>
  <li> Aide : Permet d'acc&eacute;der directement à l'aide pour la configuration de l'&eacute;quipement choisi par l'onglet s&eacute;lectionn&eacute;.</li>
  <li> Fermer : Ferme la fen&ecirc;tre de configuration des &eacute;quipements sans prendre en compte les param&egrave;tres modifi&eacute;s.</li>
</ul>
<p> Vous pouvez acc&eacute;der au param&eacute;trage de chaque &eacute;quipement en cliquant <a href="../../../../doc_html/french/09configuration/05equipement/1020equipements.htm">ici</a>. </p>
</body>

</html>
