<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration de la raquette</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 09 mars 2005</p>
<h1>Configuration de la raquette </h1>
<p> Pour r&eacute;gler les param&egrave;tres de connexion d'une raquette, il faut ouvrir la fen&ecirc;tre de configuration des raquettes. Pour cela, vous devez aller dans le menu d&eacute;roulant Configuration, puis cliquer sur Raquette... : </p>
<img src="../../images/image80.gif" alt="" width="639" height="507" />
<p> La fen&ecirc;tre de configuration des raquettes se pr&eacute;sente sous la forme suivante : </p>
<img src="../../images/image81.gif" alt="" width="446" height="232" />
<p> Vous pouvez constater que le logiciel supporte un certain nombre de raquettes. Il vous suffit de cliquer sur les diff&eacute;rents onglets disponibles (Raquette LX200, SuperPad, TelPad) pour explorer les possibilit&eacute;s de pilotage. </p>
<img src="../../images/image82.gif" alt="" width="446" height="46" />
<p> Cette fen&ecirc;tre comporte 4 boutons dans sa partie inf&eacute;rieure dont les fonctions sont les suivantes : </p>
<ul>
  <li> OK : Applique le param&eacute;trage choisi pour la raquette d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et ferme la fen&ecirc;tre de configuration des raquettes.</li>
  <li> Appliquer : Applique le param&eacute;trage choisi pour la raquette d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et laisse la fen&ecirc;tre de configuration des raquettes ouverte.</li>
  <li> Aide : Permet d'acc&eacute;der directement à l'aide pour la configuration de la raquette choisie par l'onglet s&eacute;lectionn&eacute;.</li>
  <li> Fermer : Ferme la fen&ecirc;tre de configuration des raquettes sans prendre en compte les param&egrave;tres modifi&eacute;s.</li>
</ul>
<p> Vous pouvez acc&eacute;der au param&eacute;trage de chaque raquette en cliquant <a href="../../../../doc_html/french/09configuration/06raquette/1020raquettes.htm">ici</a>. </p>
</body>

</html>
