<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration de l'outil drift scan</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 10 avril 2007</p>
<h1>Configuration de l'outil drift scan </h1>
<p>En cliquant sur le bouton Configuration de l'outil Drift scan vous obtenez la bo&icirc;te de dialogue suivante &agrave; votre &eacute;cran : </p>
<img src="images/imageScan.gif" alt="" width="348" height="175" />
<p>Tout d'abord, il faut avoir quelques notions de la prise de vue en mode drift scan. Lorsque vous faites une acquisition CCD en g&eacute;n&eacute;ral le moteur qui actionne l'axe horaire (ascension droite) de votre monture &eacute;quatoriale est en fonctionnement pour compenser la rotation de la Terre. Quand vous faites une acquisition en mode drift scan, le moteur d'ascension droite est g&eacute;n&eacute;ralement arr&ecirc;t&eacute;. Dans ce cas le ciel 'd&eacute;file' devant votre instrumentation, si nous synchronisons exactement la vitesse de lecture de la cam&eacute;ra avec le d&eacute;filement de la vo&ucirc;te c&eacute;leste, alors nous acqu&eacute;rons une image au 'kilom&egrave;tre'. Ce n'est pas tr&egrave;s compliqu&eacute;, nous &eacute;tudierons cela le moment venu. </p>
<p>Cette bo&icirc;te de dialogue nous permet de g&eacute;rer une &eacute;ventuelle temporisation entre l'arr&ecirc;t du moteur d'ascension droite et le d&eacute;but de la pose. Cela d&eacute;pend principalement de votre instrumentation et de sa capabilit&eacute; &agrave; absorber les &eacute;ventuelles vibrations dues &agrave; l'arr&ecirc;t du moteur. </p>
<p>Si votre monture &eacute;quatoriale est suffisamment stable, vous pouvez cocher Aucune temporisation. Dans ce cas, en mode drift scan la pose d&eacute;butera juste apr&egrave;s l'arr&ecirc;t du moteur. </p>
<p>Par contre, si vous souhaitez &eacute;liminer les &eacute;ventuelles vibrations dues &agrave; l'arr&ecirc;t du moteur ou simplement si vous &ecirc;tes prudent, nous vous recommandons de cocher Active la temporisation et de choisir le temps d'attente entre l'arr&ecirc;t du moteur et le d&eacute;but de la pose CCD. Pour cela, il vous suffit de renseigner le champ D&eacute;lai de temporisation, dans notre exemple nous avons choisi un d&eacute;lai de 3 secondes. </p>
<p>Comme &agrave; chaque fois, il vous appartient de valider votre choix par l'interm&eacute;diaire du bouton OK ou Appliquer. </p>
<p>Nota : Actuellement, cette option est seulement accessible aux t&eacute;lescopes du type LX200 ou AudeCom (en mode LX200 et en mode natif). </p>
</body>

</html>
