<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>S&eacute;lection des outils</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 09 mars 2005</p>
<h1>S&eacute;lection des outils </h1>
<p> Ce param&eacute;trage permet de s&eacute;lectionner les outils que l'on souhaite accessibles &agrave; partir du menu d&eacute;roulant Outils et d'y associer &eacute;ventuellement un raccourci par l'interm&eacute;diaire de touches du clavier. En cliquant avec le bouton gauche de la souris sur S&eacute;lection des outils... vous avez par exemple la bo&icirc;te de dialogue suivante qui s'affiche &agrave; l'&eacute;cran : </p>
<img src="../images/image23.gif" alt="" width="425" height="364" />
<p>Par d&eacute;faut au premier d&eacute;marrage du logiciel tous les outils disponibles dans le r&eacute;pertoire "\audace\plugin\tool\" sont s&eacute;lectionn&eacute;s et donc accessibles &agrave; partir du menu d&eacute;roulant Outils. On a donc par exemple le r&eacute;sultat suivant : </p>
<img src="../images/image24.gif" alt="" width="639" height="507" />
<p>Il est tout &agrave; fait possible de limiter les outils disponibles avec le menu d&eacute;roulant &agrave; ceux que l'on utilise couramment. Pour cela, il suffit de faire le choix en d&eacute;cochant (l'outil n'appara&icirc;tra plus dans le menu) ou en cochant (l'outil appara&icirc;tra &agrave; nouveau dans le menu) des cases et en associant &eacute;ventuellement un raccourci &agrave; certains outils. Par exemple, on peut avoir r&eacute;alis&eacute; les choix suivants : </p>
<img src="../images/image25.gif" alt="" width="425" height="364" />
<p>L'association d'un raccourci &agrave; un outil se fait par l'interm&eacute;diaire du <img src="../images/image15.gif" alt="" width="18"
 height="18" /> qui suit le nom de l'outil. Il ouvre le choix aux raccourcis suivants : F2 &agrave; F11, Ctrl+A &agrave; Ctrl+Z (sauf &agrave; Ctrl+O, Ctrl+Q et Ctrl+S qui sont d&eacute;j&agrave; utilis&eacute;s dans le menu d&eacute;roulant Fichier) et bien s&ucirc;r &agrave; 'pas de raccourci' (choix 'vide').</p>
<p>Par simple validation, en cliquant tout simplement sur le bouton OK ou Appliquer, le nouveau param&eacute;trage des outils est instantan&eacute;ment pris en compte. Il en r&eacute;sulte le nouveau menu d&eacute;roulant Outils ci-dessous conforme &agrave; ce choix : </p>
<img src="../images/image26.gif" alt="" width="639" height="507" />
<p>La sauvegarde de cette nouvelle configuration vous sera demand&eacute;e &agrave; la fermeture du logiciel comme pour toute autre modification du param&eacute;trage.</p>
<p>Nota important : Pour que l'ouverture d'un outil par l'interm&eacute;diaire des raccourcis soit active, il faut que la fen&ecirc;tre principale d'Aud'ACE soit active, c'est &agrave; dire avec la barre des titres en bleue. Si c'est la Console qui est active, l'appui sur les raccourcis est inactif.</p>
<p>Remarque : L'outil qui est associ&eacute; au raccourci clavier F2 s'affichera automatiquement au prochain d&eacute;marrage du logiciel. C'est l'outil par d&eacute;faut. </p>
</body>

</html>
