<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Fichiers image</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 19 mars 2005</p>
<h1>Fichiers image </h1>
<p> Ici, il s'agit de param&eacute;trer les fichiers des images que nous allons acqu&eacute;rir, ouvrir ou enregistrer. Voici la bo&icirc;te de dialogue que vous obtenez par un clic gauche de la souris sur Fichiers image... : </p>
<img src="../../images/image20.gif" alt="" width="336" height="285" />
<p>Cette bo&icirc;te de dialogue permet d'acc&eacute;der &agrave; 2 cat&eacute;gories de param&eacute;trage. </p>
<p>D'une part, il est possible de modifier l'extension des fichiers image que vous allez acqu&eacute;rir. Pour cela il suffit de d&eacute;finir le nouveau nom de votre extension (3 caract&egrave;res maximum) en modifiant le champ qui suit le libell&eacute; Vous pouvez choisir votre extension. Par d&eacute;faut cette extension est .fit. </p>
<p>Si vous ne disposez pas de beaucoup d'espace sur votre disque dur, vous pouvez opter pour les fichiers image au format compress&eacute; en cochant la case pr&eacute;c&eacute;dent Fichiers image compress&eacute;s (.gz). </p>
<p>Si vous avez gard&eacute; l'extension par d&eacute;faut .fit et que vous avez coch&eacute; l'option Fichiers image compress&eacute;s (.gz), alors vos images seront sauvegard&eacute;es avec l'extension .fit.gz. </p>
<p>D'autre part, il est possible de d&eacute;finir par l'interm&eacute;diaire d'une glissi&egrave;re la qualit&eacute; du format Jpeg, c'est un nombre variant de 5 &agrave; 100, par d&eacute;faut il est initialis&eacute; &agrave; 80. En effet Aud'ACE poss&egrave;de une fonctionnalit&eacute; int&eacute;ressante qui vous permet de sauvegarder, par exemple une image apr&egrave;s traitement, sous le format Jpeg afin d'illustrer une page web, inutile dans ce cas de passer par de multiples transformations pour arriver au but, Aud'ACE le fait en un simple clic de la souris : Vous ouvrez le menu d&eacute;roulant Fichier et vous choisissez l'option Enregistrer en Jpeg... </p>
<p>Une fois vos choix faits, vous devez les valider en appuyant sur le bouton OK ou Appliquer de la fen&ecirc;tre Fichiers image. Comme d'habitude, &agrave; la fermeture du logiciel, la sauvegarde de la nouvelle configuration vous sera demand&eacute;e. </p>
</body>

</html>
