<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head>




<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Focalisation</title></head><body>
<p class="date">Date de mise à jour : 20 juillet 2013</p>
<h1>Focalisation</h1>
<p>La focalisation consiste &#224; r&#233;gler la position de la
cam&#233;ra sur l'axe optique du t&#233;lescope de fa&#231;on
&#224; avoir les images les plus nettes possibles. Dans le menu
d&#233;roulant <b>Cam&#233;ra</b>, s&#233;lectionner
<b>Focalisation</b>.</p>
<p>Le processus est simple :<br />
- Faire varier la mise au point (en agissant manuellement ou par
des moteurs).<br />
- Mesurer le r&#233;sultat (intensit&#233;, FWHM, contraste, HFD)
dans une petite fen&#234;tre autour de l'&#233;toile cible.<br />
- Choisir la position optimale (manuellement ou avec un compteur
de pas). C'est certainement cette &#233;tape qui est la plus
difficile car, &#224; d&#233;faut de pouvoir reproduire la
position, il faut se contenter d'observer la succession des
r&#233;sultats (cf. les illustrations ci-dessous
r&#233;alis&#233;es sur la m&#234;me s&#233;rie d'images).<br />
Note : HFD (Half Flux Diameter) donne le diam&#232;tre contenant
50% du flux sans faire l'hypoth&#232;se d'une r&#233;partition
gaussienne (cas de FWHM). Elles peuvent &#234;tre tr&#232;s
proches ou tr&#232;s diff&#233;rentes notamment en cas de forte
d&#233;focalisation.</p>
<h2>Configurations du panneau</h2>
<p>Le panneau comporte a minima ce qui est n&#233;cessaire &#224;
l'acquisition (centrage, fen&#234;trage, temps de pose). Sa
configuration s'adapte au focuser (ou &#224; son absence) et
permet de suivre la variation de la qualit&#233; de la mise au
point &#224; l'aide d'une fen&#234;tre d'informations et d'un
graphique gradu&#233; en num&#233;ro d'image ou en pas
compteur.</p>
<table>
<tbody>
<tr>
<th align="center" width="15">Configuration</th>
<th align="center">Panneau</th>
<th align="center">Suivi de la qualit&#233; d'une image</th>
<th align="center">Suivi des r&#233;glages successifs de la mise
au point</th>
</tr>
<tr>
<td align="center" width="15">Pas de focuser</td>
<td align="center"><img style="width: 134px; height: 340px;" src=
"images/pas_focuser.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" src=
"images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 325px; height: 396px;" src="images/graf_4.gif" /></td>
</tr>
<tr>
<td align="center" width="15">Focuser manuel (focuserlx200,
focuserjmi, focusert193)</td>
<td align="center"><img style="width: 133px; height: 450px;" src=
"images/focus_manuel.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" src=
"images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 325px; height: 396px;" src="images/graf_4.gif" /></td>
</tr>
<tr>
<td align="center" width="15">Focusers automatiques
(focuseraudecom, usb_focus)</td>
<td align="center"><img style="width: 133px; height: 516px;" src=
"images/focus_auto.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" src=
"images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 216px; height: 420px;" src=
"images/graph_HFD.gif" /><br />
Cette fen&#234;tre comporte, outre le graphique HFD en fonction
du nombre de pas, une coupe horizontale du flux mesur&#233; (en
haut &#224; gauche) et la repr&#233;sentation de l'int&#233;grale
du flux en fonction de la distance au centre (en haut &#224;
droite) ; la focalisation est d'autant meilleure que la pente est
raide.</td>
</tr>
</tbody>
</table>
<h2>Les acquisitions</h2>
<p>Pour commencer cette phase de recherche de la meilleure
focalisation, il faut d&#233;buter par une acquisition en mode
<b>Centrage</b>. Un appui sur le bouton <b>GO CCD</b> permet de
faire une premi&#232;re image avec le mode <b>Centrage</b>. Elle
se fait automatiquement en binning 2x2 (donc en d&#233;finition
moyenne). Elle a pour but de choisir une &#233;toile dans le
champ pour r&#233;gler la focalisation.</p>
<p>Pendant l'acquisition de cette image, le bouton <b>R.A.Z.</b>
(remise &#224; z&#233;ro) se transforme en <b>Stop</b>, il est
donc possible d'arr&#234;ter l'acquisition en cours si un
probl&#232;me est d&#233;tect&#233; (mauvais temps de pose par
exemple). Ensuite, apr&#232;s l'affichage de l'image nouvellement
acquise ce bouton r&#233;cup&#232;re la fonction
<b>R.A.Z.</b>.</p>
<p>Si l'option <b>Avancement de l'acquisition</b> est
coch&#233;e, une barre de progression du temps s'ouvre :</p>
<p><img style="width: 220px; height: 108px;" src=
"images/suivi_pose.gif" /></p>
<p>Sur l'image acquise, choisir une &#233;toile suffisamment
brillante (si possible de magnitude entre 2 et 7) mais qui ne
sature pas le capteur CCD. Cette s&#233;lection s'effectue avec
la souris en encadrant l'&#233;toile choisie d'un rectangle
(rectangle bleu sur l'&#233;toile la plus &#224; droite) avec le
bouton gauche appuy&#233;.</p>
<p><img style="width: 266px; height: 146px;" src=
"images/centrage.gif" /></p>
Ensuite passer en mode <b>Fen&#234;tre</b> en appuyant avec le
bouton gauche de la souris sur le bouton d&#233;di&#233;.
D&#232;s lors les acquisitions se font en mode rafale avec le
temps de pose s&#233;lectionn&#233;. Le graphique sp&#233;cifuqe
s'ouvre.<br />
Il est toujours possible de faire un <b>Stop</b> entre deux
acquisitions, par exemple pour modifier la mise au point en mode
manuel.
<p>Les images affich&#233;es correspondent au contenu de la
bo&#238;te de s&#233;lection :</p>
<p><img style="width: 228px; height: 114px;" src=
"images/imagette.gif" /></p>
<p>Dans tous les cas les statistiques (intensit&#233;, FWHM_X,
FWHM_Y, contraste, HFD) sont r&#233;alis&#233;es sur l'image dont
le fond du ciel a &#233;t&#233; normalis&#233; &#224; 0.</p>
<p>Tois cas se pr&#233;sentent :</p>
<ul>
<li>en absence de focuser, il faut affiner la mise au point de
fa&#231;on &#224; minimiser les valeurs des fwhm (en x et en y)
et &#224; maximiser celles de l'intensit&#233; et du contraste.
Examiner les valeurs affich&#233;es dans les graphiques (CF
illustrations du paragraphe Configuration du panneau). Pour
modifier la mise au point interrompre le mode rafale en appuyant
sur le bouton <b>Stop</b> avant de faire une nouvelle acquisition
avec le bouton <b>GOTO CCD</b>. Attention le bouton <b>R.A.Z.</b>
a pour effet d'effacer le contenu des graphiques.</li>
<li>avec un focuser ne disposant pas d'un compteur de position,
le processus est identique au pr&#233;c&#233;dent mise &#224;
part que la modfication de la mise au point s'effectue en
agissant sur le moteur du focuser (bouton + ou -) :<br />
<p><img style="width: 129px; height: 126px;" src=
"images/focuser_motorise.gif" /></p>
</li>
<li>avec un focuser disposant d'un compteur de position, il faut
affiner la mise au point de fa&#231;on &#224; minimiser le HFD
(demi-diam&#232;tre) (CF illustrations du paragraphe
Configuration du panneau). Le panneau comporte donc les commandes
n&#233;cessaires pour initialiser le focuser, demander une
position pr&#233;cise et lire sa positiona actuelle.<br />
<p><img style="width: 128px; height: 276px;" src=
"images/robofocus.gif" /></p>
</li>
</ul>
<h2>Fichier de log</h2>
<p>Un fichier foc.log est cr&#233;&#233; &#224; chaque session.
Un <b>Copier/Coller</b> permet de le r&#233;cup&#233;rer dans un
tableur.</p>
</body>
</html>
