<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head>



<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" /><title>Focalisation</title></head><body>
<p class="date">Date de mise à jour : 19 juillet 2013</p>
<h1>Focalisation</h1>
<p>Cet outil permet d'am&#233;liorer la focalisation. Le
processus est simple :<br />
-faire varier la focalisation (en agissant manuellement ou par
des moteurs),<br />
-mesurer le r&#233;sultat (intensit&#233;, FWHM, contraste, HFD)
dans une petite fen&#234;tre autour de l'&#233;toile cible,<br />
-choisir la position optimale (manuellement ou avec un compteur
de pas). C'est certainement cette &#233;tape qui est la plus
difficile car, &#224; d&#233;faut de pouvoir reproduire la
position, il faut se contenter d'observer la succession des
r&#233;sultats.<br />
Note : HFD (Half Flux Diameter) donne le diam&#232;tre contenant
50% du flux sans faire l'hypoth&#232;se d'une r&#233;partition
gaussienne (cas de FWHM). Elles peuvent &#234;tre tr&#232;s
proches ou tr&#232;s diff&#233;rentes notamment en cas de forte
d&#233;focalisation.</p>
<h2>Configurations du panneau</h2>
<p>Le panneau comporte a minima ce qui est n&#233;cessaire &#224;
l'acquisition (centrage, fen&#234;trage, temps depose). Sa
configuration s'adapte au focuser (ou &#224; son absence) et
permet de suivre la variation de la qualit&#233; de la mise au
point &#224; l'aide d'une fen&#234;tre d'informations et d'un
graphique gradu&#233; en num&#233;ro d'image ou en pas
compteur.</p>
<table>
<tbody>
<tr>
<th align="center" width="15">Configuration</th>
<th align="center">Panneau</th>
<th align="center">Suivi de la qualit&#233; d'une image</th>
<th align="center">Suivi des r&#233;glages successifs de la mise
au point</th>
</tr>
<tr>
<td align="center" width="15">Pas de focuser</td>
<td align="center"><img style="width: 134px; height: 340px;" alt=
"" src="images/pas_focuser.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" alt=
"" src="images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 326px; height: 398px;" src="images/graf_4.gif" /></td>
</tr>
<tr>
<td align="center" width="15">Focuser manuel (focuserlx200,
focuserjmi, focusert193)</td>
<td align="center"><img style="width: 133px; height: 450px;" alt=
"" src="images/focus_manuel.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" alt=
"" src="images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 326px; height: 398px;" alt="" src=
"images/graf_4.gif" /></td>
</tr>
<tr>
<td align="center" width="15">Focusers automatiques
(focuseraudecom, usb_focus)</td>
<td align="center"><img style="width: 133px; height: 516px;" alt=
"" src="images/focus_auto.gif" /></td>
<td align="center"><img style="width: 115px; height: 147px;" alt=
"" src="images/qualite_foc.gif" /></td>
<td align="center" width="330"><img style=
"width: 216px; height: 420px;" alt="" src=
"images/graph_HFD.gif" /><br />
Cette fen&#234;tre comporte, outre le graphique HFD en fonction
du nombre de pas, une coupe verticale du flux mesur&#233; (en
haut &#224; gauche) et la repr&#233;sentation de l'int&#233;grale
du flux en fonction de la distance au centre (en haut &#224;
droite) ; la focalisation est d'autant meilleure que la pente est
raide.</td>
</tr>
</tbody>
</table>
<h2>Les acquisitions</h2>
<p>Appuyer sur <b>GO CCD</b> : si la cam&#233;ra n'est pas encore
connect&#233;e, le panneau de s&#233;lection d'une cam&#233;ra
s'ouvre, sinon une acquisition est lanc&#233;e :<br />
-le bouton <b>R.A.Z.</b> devient <b>Stop</b>,<br />
-si l'option <b>Avancement de l'acquisition</b> est coch&#233;e,
une barre de progression du temps s'ouvre :<br />
<img style="width: 220px; height: 108px;" src=
"images/suivi_pose.gif" /></p>
<p>Les premi&#232;res images permettent de r&#233;gler le temps
d'exposition, de pr&#233;-s&#233;lectionner une &#233;toile de
r&#233;f&#233;rence et de la centrer.</p>
<p>L'&#233;tape suivante consiste &#224; passer en mode
fen&#234;trage et &#224; dessiner une bo&#238;te de
s&#233;lection autour de l'&#233;toile avant de relancer les
acquisitions. D&#232;s lors les acquisitions se font en continu
avec le temps de pose s&#233;lectionn&#233;. Les graphiques
s'ouvrent et sont actualis&#233;s.<br />
Il est toujours possible de faire un <b>Stop</b> entre deux
acquisitions, par exemple pour modifier la mise au point en mode
manuel.</p>
</body>
</html>
