<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=ISO-8859-1" />
  <title>Tutorial photom&eacute;trie</title>
</head>
<body style="color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee"
 vlink="#551a8b">
<p class="date">Date de mise &agrave; jour : 9 novembre 2011</p>
<h1>Tutoriel photom&eacute;trie</h1>
<h1>1. Qu'est-ce que la photom&eacute;trie ?</h1>
La photom&eacute;trie consiste &agrave; d&eacute;terminer
l'&eacute;clat d'un astre dont on a enregistr&eacute; une image
num&eacute;rique. L'&eacute;clat est bas&eacute; sur le syst&egrave;me
des magnitudes et des bandes photom&eacute;triques. Une bande
photom&eacute;trique est la d&eacute;signation d'un domaine de couleur
dans lequel on a observ&eacute;. Habituellement les bandes
photom&eacute;triques optiques sont B, V, R, I. La magnitude est un
nombre sans dimension qui est reli&eacute;e &agrave;
l'&eacute;clairement d'une &eacute;toile (W/m<sup>2</sup>).
L'&eacute;toile V&eacute;ga a servi de point de r&eacute;f&eacute;rence
de l'&eacute;chelle des magnitudes. Cette &eacute;toile a la magnitude
z&eacute;ro dans les diff&eacute;rentes bandes photom&eacute;triques.<br />
<br />
Sur une image num&eacute;rique, on peut facilement mesurer
l'intensit&eacute; (I) d'un pixel. Cette intensit&eacute; est
exprim&eacute;e en unit&eacute; du convertisseur num&eacute;rique de la
cam&eacute;ra, habituellement not&eacute; ADU. Il s'agit de la valeur
affich&eacute;e dans le cartouche du bas de AudeLA apr&egrave;s le
symbole I.<br />
<br />
L'op&eacute;ration de calibration astrom&eacute;trique consiste
&agrave; calculer les &eacute;quations de passage entre les mesures (I)
et les magnitudes (mag). La formule de Pogson est &agrave; la base de
la photom&eacute;trie. Pour deux &eacute;toiles 1 et 2 de magnitude
mag1 et mag2 et de flux int&eacute;gr&eacute; I1 et I2, on aura la
relation :<br />
<br />
<div style="text-align: center;">mag2 - mag1 = -2.5 * log10 ( I2/I1 )<br />
</div>
<br />
D'un point de vue technique, la calibration photom&eacute;trique
consiste &agrave; calculer les valeurs des coefficients &agrave;
introduire dans les &eacute;quations math&eacute;matiques pour passer
de (I) &agrave; (mag). Contrairement &agrave; la calibration
astrom&eacute;trique il n'existe pas de mots cl&eacute;
&eacute;quivalents aux WCS pour par photom&eacute;trie.<br />
<br />
On distingue deux types de photom&eacute;trie :<br />
<ul>
  <li>La photom&eacute;trie relative : On calcule seulement la
diff&eacute;rence de magnitude d'une &eacute;toile par rapport &agrave;
une autre. C'est une op&eacute;ration assez simple qui n'exige pas
l'usage de catalogues photom&eacute;triques. Par cette m&eacute;thode
on peut d&eacute;j&agrave; mettre en &eacute;vidence les changements
d'&eacute;clat d'une &eacute;toile variable en la comparant &agrave;
une autre &eacute;toile r&eacute;put&eacute;e stable. Les fonctions du
type photrel_* sont adapt&eacute;es &agrave; la photom&eacute;trie
relative. Le script Calaphot permet aussi de pratiquer la
photom&eacute;trie relative sur une grande s&eacute;rie d'images.</li>
</ul>
<ul>
  <li>La photom&eacute;trie absolue : On calcule la magnitude dans un
syst&egrave;me photom&eacute;trique. Pour r&eacute;ussir une
calibration photom&eacute;trique en absolu, il faut au moins deux
images obtenues avec des filtres diff&eacute;rents. Dans ce cas, il
faut utiliser un catalogue photom&eacute;trique. Les fonctions du type
photcal_* sont adapt&eacute;es &agrave; la photom&eacute;trie absolue.</li>
</ul>
Dans AudeLA on utilise le catalogue photom&eacute;trique Loneos. Ce
catalogue est livr&eacute; avec la distribution de AudeLA. Il se trouve
&agrave;&nbsp;gui/audace/catalogues/cataphotom/loneos.phot<br />
<h1>2. Commande de console pour pratiquer la photom&eacute;trie absolue
d'une seule &eacute;toile sur&nbsp;une seule image </h1>
Il n'est pas n&eacute;cessaire d'avoir calibr&eacute; les mots
cl&eacute; WCS avant les op&eacute;rations suivantes mais, comme on le
verra plus loin, &ccedil;a peut aider. Cette m&eacute;thode est
tr&egrave;s utile pour d&eacute;terminer rapidement la magnitude d'un
astre qui vient d'&ecirc;tre d&eacute;couvert. Par exemple une
supernova.<br />
<br />
Le principe consiste &agrave; mesurer le flux int&eacute;gral d'une
&eacute;toile (en ADU) dont on conna&icirc;t la magnitude. On
conna&icirc;t alors I1 et mag1 pour cette &eacute;toile. On mesure
ensuite le flux int&eacute;grale de l'&eacute;toile &agrave; mesurer
(I2). A partir de la formule de Posgon, il est &eacute;vident que l'on
calcule m2 de la fa&ccedil;on suivante :<br />
<br />
<div style="text-align: center;">mag2 =&nbsp;mag1&nbsp;-2.5 * log10 (
I2/I1 )<br />
</div>
<br />
On a l'habitude d'&eacute;crire cette &eacute;quation en rassemblant
les termes de l'&eacute;toile 1, appel&eacute;e
aussi&nbsp;&eacute;toile de r&eacute;f&eacute;rence :<br />
<br />
<div style="text-align: center;">mag2 = [mag1 + 2.5 * log10 (&nbsp;I1
)] - 2.5 * log10 (&nbsp;I2 ) = ZMAG - 2.5 *log10 (I2)
</div>
<br />
ZMAG est appel&eacute;e constante des magnitudes. Si l'on prend une
autre &eacute;toile de r&eacute;f&eacute;rence on doit retouver la
m&ecirc;me valeur de ZMAG. Le terme -2.5*log10(I2) est appel&eacute;
habituellement "magnitude instrumentale".<br />
<br />
En pratique, on rep&egrave;re une &eacute;toile de
r&eacute;f&eacute;rence. Il faut conna&icirc;tre la magnitude de
l'&eacute;toile. Si l'image n'est pas calibr&eacute;e WCS, il faut
identifier l'&eacute;toile dans un catalogue et noter sa magnitude. Si
l'image est calibr&eacute;e WCS, il
suffit de l'entourer avec un cadre bleu (utiliser la souris) puis de
faire clic droit et demander Ajuster une gaussienne. Dans le console de
AudeLA, on pourra lire de nombreuses informations. Par exemple :<br />
<pre style="background-color: rgb(255, 255, 204);"># === Visu1 === Ajuster une gaussienne ===<br /># Coordonn&eacute;es de la fen&ecirc;tre : 835 646 857 666<br /># Centre : 845.40 / 656.79<br /># Fwhm : 2.401 / 2.588<br /># Intensit&eacute; : 15782.222164 / 16116.749379<br /># Fond : 484.364238 / 479.551073<br /># Flux int&eacute;gr&eacute; : 112476.324382 +/- 1179.548735<br /># Magnitude instrumentale -2.5*log10(flux) : -12.628 +/-&nbsp; 0.011<br /><br /># AD D&eacute;c. : 164.867805 67.509553<br /># AD D&eacute;c. : 10h59m28s27 +67d30m34s39<br /><br /># OLD Format MPC :<br />&nbsp;&nbsp;&nbsp;&nbsp; .&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148<br /><br /># Attention :<br /># Le site UAI 148 doit &ecirc;tre celui o&ugrave; l'image a &eacute;t&eacute; acquise.<br /><br /># Use http://cfa-www.harvard.edu/iau/info/Astrometry.html for informations.<br /># Use ::astrometry::mpc_provisional2packed to convert designation to MPC packed form.</pre>
Les coordonn&eacute;es
(Ra,Dec) sont affich&eacute;es sous deux formes diff&eacute;rentes
apr&egrave;s les mots AD D&eacute;c. Utiliser la commande de console
vo_neareststar pour demander les magnitudes de l'&eacute;toiles dans le
catalogue NOMAD1 (il faut &ecirc;tre reli&eacute; internet). Les
param&egrave;tres de la commande vo_neareststar sons les
coordonn&eacute;es c&eacute;lestes. Dans notre exemple, on obtient :<br />
<pre>vo_neareststar 164.867805 67.509553<br /># {NOMAD-1 1575-0155537} 164.8682919 +67.5094956 13.204 12.224 11.610 11.631 11.339 11.333</pre>
La liste du r&eacute;sultat est de la forme : Id Ra Dec B V R I J H K.
Si l'image a &eacute;t&eacute; r&eacute;alis&eacute;e avec un filtre R
alors la magnitude R=11.61.<br />
<br />
Dans la liste des r&eacute;sultats affich&eacute;s apr&egrave;s
l'ajustement de la gaussienne, on note que le flux
int&eacute;gr&eacute; vaut I=112476 ADU. Au regard des formules ci
dessus, on en d&eacute;duit que la constante des magnitudes vaut :<br />
<br />
<div style="text-align: center;">ZMAG = mag1 + 2.5 * log10 (&nbsp;I1 )
= 11.61 + 2.5 * log10(112476) = 24.24<br />
</div>
<br />
On peut calculer ZMAG avec d'autres &eacute;toiles connues du champ et
garder une valeur moyenne de ZMAG pour calculer la magnitude de
l'&eacute;toile inconnue. N&eacute;anmoins, cette m&eacute;thode ne
prend pas en compte les diff&eacute;rences de couleurs entre les
&eacute;toiles, facteur qui influe sur la valeur de ZMAG.<br />
<br />
Pour calculer la magnitude de l'&eacute;toile inconnue, on l'entoure
avec un cadre bleu (utiliser la souris) puis faire clic droit et
demander Ajuster une gaussienne. On note la valeur du flux
int&eacute;gr&eacute; (I2). Par exemple I2 = 10456 ADU. Puis utilise la
formule :<br />
<br />
<div style="text-align: center;">mag2 = ZMAG -2.5*log10(I2) = 24.24 -
2.5 * log10(10456) = 14.19<br />
</div>
<br />
On peut donc annoncer une magnitude R=14.19 pour notre &eacute;toile
inconnue. L'incertitude typique d'une telle mesure est de l'ordre de
+/- 0.5 magnitude en raison des probl&egrave;mes de la
diff&eacute;rence de couleur entre l'&eacute;toile &agrave; mesurer et
l'&eacute;toile de r&eacute;f&eacute;rence.<br />
<h1>3. Pratiquer la photom&eacute;trie relative d'une seule
&eacute;toile sur&nbsp;une s&eacute;rie images en utilisant Calaphot </h1>
Il n'est pas n&eacute;cessaire d'avoir calibr&eacute; les mots
cl&eacute; WCS avant les
op&eacute;rations suivantes. Cette m&eacute;thode est tr&egrave;s utile
pour mesurer rapidement la magnitude
d'un astre suppos&eacute; variable dans le temps. Par exemple un
ast&eacute;ro&iuml;de ou une &eacute;toile variable.<br />
<br />
Ouvrir le menu Analyse et prendre l'item Courbes de lumi&egrave;res
(Calaphot). Il faut remplir les renseignements demand&eacute;s dans la
fen&ecirc;tre de configuration de Calaphot :<br />
<br />
<div style="text-align: center;"><img
 style="width: 594px; height: 644px;" alt=""
 src="../images/calaphot1.png" /><br />
</div>
<br />
Appuyer sur le bouton Continuer en bas de la fen&ecirc;tre. Le reste de
l'op&eacute;ration est intuitf.<br />
<h1>4. Commande de console pour pratiquer la photom&eacute;trie
relative d'une seule &eacute;toile sur&nbsp;une s&eacute;rie d'images
en utilisant photrel </h1>
Dans ce cas, il est n&eacute;cessaire d'avoir calibr&eacute; les mots
cl&eacute; WCS avant les
op&eacute;rations suivantes. Cette m&eacute;thode est tr&egrave;s utile
pour mesurer rapidement la magnitude
d'un astre suppos&eacute; variable dans le temps. Par exemple un
ast&eacute;ro&iuml;de ou une &eacute;toile variable. Par rapport
&agrave; Calaphot, l'int&eacute;r&ecirc;t de cette m&eacute;thode est
qu'elle choisit elle m&ecirc;me les &eacute;toiles de
r&eacute;f&eacute;rence et &eacute;limine celles qui ont un
&eacute;clat variable. L'avantage de photrel est de pouvoir &ecirc;tre
incropor&eacute; dans un script qui effectue les op&eacute;rations de
fa&ccedil;on automatique. Utile pour un t&eacute;lescope robotique par
exemple.<br />
<h2>4.1. Description des m&eacute;thodes utilis&eacute;es dans photrel</h2>
Les fonctions photrel utilisent des fonctions de la librairie libyd
d&eacute;velopp&eacute;e par Yassine Damerdji dans le cadre d'un
travail de th&egrave;se en astrophysique. Le but &eacute;tait de
d&eacute;velopper des outils informatiques tr&egrave;s rapides pour
extraire des courbes de lumi&egrave;res et pour identifier et
caract&eacute;riser des nouvelles &eacute;toiles variables.<br />
<br />
La methode est centr&eacute;e sur la cr&eacute;ation d'un fichier
catalogue des &eacute;toiles mesur&eacute;es dans les images prises
diff&eacute;rentes dates. En pratique, un catalogue est
repr&eacute;sent&eacute; par trois fichiers afin d'optimiser la vitesse
de traitement. Les trois fichiers sont appel&eacute;s MES, REF et ZMG.<br />
<ul>
  <li>MES = fichier des mesures. Chaque entr&eacute;e correspond a une
etoile pour une date.</li>
  <li>REF = fichier des references. Chaque entree definit les
coordonn&eacute;es
et la magnitude moyenne d'une seule etoile dans divers filtres
eventuellement.</li>
  <li>ZMG = fichier des corrections de magnitudes pour chaque date.<br />
  </li>
</ul>
Ces fichiers sont &eacute;crits en binaires, donc non lisibles avec un
&eacute;diteur de texte. N&eacute;anmoins, la fonction
yd_refzmgmes2ascii permet de transformer le binaire en ASCII si l'on
int&eacute;ress&eacute; par lire le contenu. La signification des
colonnes des fichiers est d&eacute;crite dans la th&egrave;se de
Yassine Damerdji.<br />
<br />
A noter que le filtre est identifi&eacute; par le symbole du mot
cl&eacute; FILTER dans l'ent&ecirc;te FITS. Par d&eacute;faut, le
filtre sera pris &eacute;gal &agrave; C (pour clear) s'il n'est pas
pr&eacute;cis&eacute;.<br />
<h3>4.1.1. photrel_wcs2cat</h3>
La fonction photrel_wcs2cat permet de cr&eacute;er les trois fichiers
catalogue &agrave; partir d'une s&eacute;rie d'images FITS
calibr&eacute;es WCS. On peut r&eacute;sumer cela ainsi :<br />
<br />
<div style="text-align: center;">[images FITS]
--(photrel_wcs2cat)--&gt; [3 fichiers MES, REF, ZMG]<br />
</div>
<br />
<h3>4.1.2. photrel_cat2mes</h3>
A partir des fichiers catalogues, on peut demander &agrave; extraire la
courbe de lumi&egrave;re d'une seule &eacute;toile en utilisant la
fonction
photrel_cat2mes. Le r&eacute;sultat est un fichier ASCII (not&eacute;
MES.txt) par
&eacute;toile variable trouv&eacute;e.&nbsp;On peut r&eacute;sumer cela
ainsi :<br />
<br />
<div style="text-align: center;">[3 fichiers MES, REF,
ZMG]&nbsp;--(photrel_cat2mes)--&gt; [MES.txt]<br />
</div>
<br />
Voici un exemple d'un tel fichier MES.txt :<br />
<pre>&nbsp;2455175.410301&nbsp; 16.265 0.115&nbsp;&nbsp; 0<br />&nbsp;2455175.420243&nbsp; 16.894 0.208&nbsp;&nbsp; 1<br />&nbsp;2455175.425648&nbsp; 16.006 0.107&nbsp;&nbsp; 0<br />&nbsp;2455448.591299&nbsp; 16.871 0.219&nbsp;&nbsp; 1</pre>
La premi&egrave;re colonne est le jour julien de la mesure, la seonde
colonne est la magnitude, la troisieme colonne est l'erreur
estim&eacute;e sur la magnitude et la quatri&egrave;me colonne est un
flag qui provient du logiciel Sextractor utilis&eacute; pour mesurer
les magnitudes. Si le flag =0 alors la mesure est valable.
<h3>4.1.3. photrel_cat2var</h3>
A partir des fichiers catalogues, on peut demander &agrave; extraire
toutes les &eacute;toiles candidates variables en utilisant la fonction
photrel_cat2var. Le r&eacute;sultat est un fichier ASCII (not&eacute;
VAR.txt) par &eacute;toile variable trouv&eacute;e.&nbsp;On peut
r&eacute;sumer cela ainsi :<br />
<br />
<div style="text-align: center;">[3 fichiers MES, REF,
ZMG]&nbsp;--(photrel_cat2var)--&gt;
[VAR.txt]<br />
</div>
<br />
Voici un exemple d'un tel fichier VAR.txt :<br />
<pre>NAME&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = STAR-N321200310-36 <br />RA&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; =&nbsp; 22.878330 <br />DEC&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; =&nbsp;&nbsp; 1.475810 <br />EQUINOX&nbsp;&nbsp; = J2000.0 <br />FILTER&nbsp;&nbsp;&nbsp; = C <br />CAMERANO&nbsp; = 2 <br />PROC&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = photrel_cat2var<br />MEAN&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = 16.550468 <br />CRITVAR&nbsp;&nbsp; = 5.333820 <br />END<br />&nbsp;2455175.410301&nbsp; 16.265 0.115&nbsp;&nbsp; 0<br />&nbsp;2455175.420243&nbsp; 16.894 0.208&nbsp;&nbsp; 1<br />&nbsp;2455175.425648&nbsp; 16.006 0.107&nbsp;&nbsp; 0<br />&nbsp;2455448.591299&nbsp; 16.871 0.219&nbsp;&nbsp; 1</pre>
On reconnait que la partie des donn&eacute;es est format&eacute;e
exactement de la m&ecirc;me fa&ccedil;on qu'un fichier MES.txt. Une
ent&ecirc;te a simplement &eacute;t&eacute; ajout&eacute;e au
d&eacute;but de la s&eacute;rie de mesures afin de donner des
renseignements sur l'&eacute;toile, notamment ses coordonn&eacute;es
c&eacute;lestes (ra,dec).<br />
<h3>4.1.4. photrel_wcs2var</h3>
Cette fonction effectue l'enchainement de photrel_wcs2cat et
photrel_cat2var. On peut r&eacute;sumer cela ainsi :<br />
<br />
<div style="text-align: center;">[images
FITS]&nbsp;--(photrel_wcs2var)--&gt;
[VAR.txt]<br />
</div>
<h3>4.1.5. photrel_cat2per</h3>
Cette fonction extrait la courbe de lumi&egrave;re d'une seule
&eacute;toile comme photrel_cat2mes) mais cette courbe est
analys&eacute;e par diff&eacute;rents algorithmes pour
d&eacute;terminer la meilleure p&eacute;riode dans le cas d'un
ph&eacute;nom&egrave;ne p&eacute;riodique stable. On peut
r&eacute;sumer cela ainsi :<br />
<br />
<div style="text-align: center;">[3 fichiers MES, REF,
ZMG]&nbsp;--(photrel_cat2per)--&gt;
P&eacute;riode<br />
</div>
<h2>4.2. Extraction de la courbe de lumi&egrave;re d'une seule
&eacute;toile</h2>
On part d'une s&eacute;rie de fichiers. Par exemple, ic1.fit
jusqu'&agrave; ic50.fit. On commence par utiliser photrel_wcs2cat pour
cr&eacute;er le catalogue:<br />
<br />
photrel_wcs2cat ic 10 new<br />
<br />
Il faut alors conna&icirc;tre les coorodnn&eacute;es (ra,dec) de
l'&eacute;toile &agrave; extraire (cf. paragraphge 2). On utilise alors
la fonction photrel_cat2mes :<br />
<br />
photrel_cat2mes ic mystar 164.630162 67.525332 C<br />
<br />
Le fichier MES.txt s'appelera mystar.txt. Les deux valeurs 164.630162
et 67.525332 repr&eacute;sentent (Ra,Dec) en &eacute;quinoxe J2000.0.
Enfinc le symbole C sert &agrave; sp&eacute;cifier le filtre qui a
&eacute;t&eacute; utilis&eacute; (C s'il n'a pas &eacute;t&eacute;
pr&eacute;cis&eacute; par le mot cl&eacute; FILTEr dans l'ent&ecirc;te
FITS).<br />
<br />
Si l'&eacute;toile est variable, on peut rechercher sa p&eacute;riode
en utilisant photrel_cat2per avec exactement les m&ecirc;mes arguments
que photrel_cat2mes :<br />
<br />
photrel_cat2per ic mystar 164.630162 67.525332 C<br />
<br />
Le r&eacute;sultat est donn&eacute; en jour et un graphique montre la
courbe de lumi&egrave;re phas&eacute;e.<br />
<h1>5. Commande de console pour trouver automatiquement toutes les
&eacute;toiles variables dans une s&eacute;rie d'images </h1>
Dans ce cas, il est n&eacute;cessaire d'avoir calibr&eacute; les mots
cl&eacute; WCS avant
les
op&eacute;rations suivantes et on utilise photrel (cf. paragraphe 4.1).
Cette m&eacute;thode est tr&egrave;s utile pour trouver les candidates
&eacute;toiles variables dans un champ qui contient beaucoup
d'&eacute;toiles et qui a &eacute;t&eacute; observ&eacute; plusieurs
dizaines de fois.<br />
<br />
On part d'une s&eacute;rie de fichiers. Par exemple, ic1.fit
jusqu'&agrave; ic50.fit.
On commence par utiliser photrel_wcs2cat pour cr&eacute;er le catalogue:<br />
<br />
photrel_wcs2cat ic 10 new<br />
<br />
On peut ensuite demander l'extraction des &eacute;toiles variables en
appelant photrel_cat2var :<br />
<br />
photrel_cat2var ic<br />
<br />
Une liste de fichiers de type VAR.txt est g&eacute;n&eacute;r&eacute;.
Dans l'ent&ecirc;te de ces fichiers ASCII on trouvera les
coordonn&eacute;es c&eacute;lestes (ra,dec). Il suffit d'utiliser la
fonction photrel_cat2per pour d&eacute;terminer la p&eacute;riode des
candidates variables.<br />
<br />
A la fin de l'analyse, un fichier html est g&eacute;n&eacute;r&eacute;
ainsi que des images gif des courbes de lumi&egrave;res des candidates
variables. Il est facile de visualiser l'ensemble des candidates avec
un navigateur web.<br />
<h1>6. Commande de console pour calibrer en absolu les toutes les
&eacute;toiles d'une s&eacute;rie d'images</h1>
Dans ce cas, il est n&eacute;cessaire d'avoir calibr&eacute; les mots
cl&eacute; WCS avant
les
op&eacute;rations suivantes et on utilise photcal. On recherche les
coefficients de transformation en analysant le flux des etoiles qui
sont dans le catalogue Loneos. Il est donc primordial d'avoir
r&eacute;alis&eacute; des images qui contiennent des &eacute;toiles
Loneos.<br />
<br />
L'usage du filtre est donc obligatoire. Le filtre doit &ecirc;tre
identifi&eacute;e par le mot cl&eacute; FILTER dans l'ent&ecirc;te FITS
des images.<br />
<h2>6.1. Description des m&eacute;thodes utilis&eacute;es dans photcal</h2>
Le principe de la calibration photom&eacute;trique en absolue est le
suivant. Sextractor (Bertin, E. &amp; Arnouts, S. 1996, Astronomy &amp;
Astrophysics&nbsp;Supplement 317, 393) est utilis&eacute; pour extraire
le flux des &eacute;toiles. Si l'on a utilis&eacute; un filtre R,
sextractor fourni&nbsp;flux_R (flux_V pour un filtre V, etc.). La
conversion entre les flux et les mangitudes suit les &eacute;quations
suivantes :<br />
<br />
R = ZMAGR - 2.5 log(flux_R) + COEFR*(V-R) - KR*Airmass_R<br />
V = ZMAGV - 2.5 log(flux_V) + COEFV*(V-R) - KV*Airmass_V<br />
<br />
ZMAGR, ZMAGV, COEFR, COEFV, KR et KV sont calcul&eacute;s avec des
&eacute;toiles de magnitude V et R connues. Pour choisir ces
&eacute;toiles, on utilise le catalogue Loneos ("UBVRI photometry of
faint field stars"&nbsp;Skiff, B.A, 2007 yCat.2277....0S, VizieR
On-line Data Catalog: II/277). Loneos est based sur le syst&egrave;me
Johnson-Cousins UBVRI. En cons&eacute;quence,les couleurs R et I sont
calcul&eacute;s dans le syst&egrave;me de&nbsp;Cousins.<br />
<h2>6.2. Pratique de la photom&eacute;trie absolue automatique</h2>
Placer toutes les images de la nuit dans le r&eacute;pertoire des
images de la configuration de AudeLA (peut importe les noms et les
filtres). La fonction photcal_selectfiles va selectionner les fichiers
compatibles avec l'analyse photometrique (rejette les images
r&eacute;alis&eacute;es sans filtre et ne garde que les couples
d'images qui ont &eacute;t&eacute; r&eacute;alis&eacute;e avec deux
filtres diff&eacute;rents).<br />
<br />
On va cr&eacute;er le fichier commun des etoiles pr&eacute;sentes dans
le catalogue Loneos avec la fonction photcal_matchfiles.<br />
<br />
On utilise photcal_plotfit pour effectuer le calcul d'ajustement des
parametres photometriques.<br />
<br />
On utilise photcal_calibrate pour extraire les magnitudes
calibr&eacute;es de toutes les &eacute;toiles.<br />
</body>
</html>
