<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=ISO-8859-1" />
  <title>Tutorial astrom&eacute;trie</title>
</head>
<body style="color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee"
 vlink="#551a8b">
<p class="date">Date de mise &agrave; jour : 9 novembre 2011</p>
<h1>Tutoriel astrom&eacute;trie</h1>
<h1>1. Qu'est-ce que l'astrom&eacute;trie ?</h1>
L'astrom&eacute;trie consiste &agrave; d&eacute;terminer les
coordonn&eacute;es c&eacute;lestes d'un astre dont on a
enregistr&eacute; une image num&eacute;rique. Les coordonn&eacute;es
c&eacute;lestes habituellement employ&eacute;es dans les catalogues
d'objets c&eacute;lestes sont les coordonn&eacute;es
&eacute;quatoriales. Les coordonn&eacute;es &eacute;quatoriales sont
bas&eacute;es sur deux angles, l'ascension droite (not&eacute;e ra) et
la d&eacute;clinaison (not&eacute;e dec). Le couple (ra,dec) est
l'&eacute;quivalent c&eacute;leste des coordonn&eacute;es (longitudes,
latitude) sur la surface de la Terre.<br />
<br />
Sur une image num&eacute;rique, on peut facilement mesurer les
coordonn&eacute;es (x,y) d'un astre exprim&eacute;es en pixels.
L'op&eacute;ration de calibration astrom&eacute;trique consiste
&agrave; calculer les &eacute;quations de passage entre les couples
(x,y) et les couples (ra,dec).<br />
<br />
D'un point de vue tehchnique, la calibration astrom&eacute;trique
consiste &agrave; ajouter des mots cl&eacute; dans l'ent&ecirc;te FITS
de l'image. Ces mots cl&eacute; contiennent les valeurs des
coefficients &agrave; introduire dans les &eacute;quations
math&eacute;matiques pour passer de (x,y) &agrave; (ra,dec). La liste
de ces mots cl&eacute; s'apelle commun&eacute;ment WCS pour World
Coordinate System.<br />
<br />
Le calcul des mots cl&eacute; WCS est effectu&eacute; en appariant les
&eacute;toiles mesur&eacute;es sur l'image (coordonn&eacute;es x,y)
avec les coordonn&eacute;es (ra,dec) d'&eacute;toiles trouv&eacute;es
dans un catalogue astrom&eacute;trique. Dans AudeLA on utilise deux
types de catalogues (au choix) : USNO ou MICROCAT.<br />
<br />
Le catalogue USNO est disponible sous la forme de 2 DVD (11
GB). La magnitude limite de l'USNO est de l'ordre de 20. Si on se
limite aux &eacute;toiles jusqu'&agrave; magnitude 16 on pourra
utiliser le MICROCAT.
T&eacute;l&eacute;chargeable &agrave; l'adresse suivante :
<a href="http://www.cesr.fr/%7Eklotz/microcat.zip">http://www.cesr.fr/~klotz/microcat.zip</a>.
Ce catalogue n'occupe qu'un seul
CDRom de 700 MB.<br />
<h1>2. Commande de console pour calibrer l'astrom&eacute;trie d'une
seule image </h1>
A partir d'une image obtenue il faut conna&icirc;tre les
param&egrave;tres suivants avant de lancer la commande de calibration:<br />
<ul>
  <li>Longueur focale du t&eacute;lescope (en m&egrave;tres) : foclen_m</li>
  <li>Les dimensions (en microm&egrave;tres) des cot&eacute;s des
pixels de la cam&eacute;ra&nbsp;apr&egrave;s binning : pixsize1_mu et
pixsize2_mu</li>
  <li>Les coordonn&eacute;es c&eacute;lestes approximatives du centre
du champ : Angle_ra et Angle_dec</li>
  <li>Le choix d'un type de catalogue de calibration : USNO ou MICROCAT</li>
  <li>Le chemin du dossier dans lequel se trouve le catalogue de
calibration : cat_folder<br />
  </li>
</ul>
Pour effectuer la calibration astrom&eacute;trique, on utilise la
commande calibwcs qui a pour syntaxe :<br />
<br />
calibwcs Angle_ra Angle_dec pixsize1_mu pixsize2_mu foclen_m
USNO|MICROCAT cat_folder<br />
<br />
D'un point de vue technique, calibwcs &eacute;tablit un catalogue des
&eacute;toiles en coordonn&eacute;es (x,y) en utilisant le logiciel
Sextractor (fourni avec AudeLA). Ensuite, une image th&eacute;orique du
champ est fabriqu&eacute;e en m&eacute;moire &agrave; partir du
catalogue de calibration et des param&egrave;tres instrumentaux. Enfin,
un algorithme de reconnaissance, bas&eacute; sur Focas, &eacute;tablit
l'appariment entre les &eacute;toiles de l'image et celles du
catalogue. Il faut au moins 6 &eacute;toiles appari&eacute;es pour
calculer finalement les mots cl&eacute; WCS.<br />
<br />
A la fin de l'op&eacute;ration de calbration, la fonction calibwcs
retourne le nombre d'&eacute;toiles appari&eacute;es.<br />
<h1>3. Commande de console pour calibrer l'astrom&eacute;trie d'une
s&eacute;rie d'images </h1>
La calibration d'un lot d'images enregistr&eacute;es sur une m&ecirc;me
r&eacute;gion du ciel est une op&eacute;ration courante qui sert de
point de d&eacute;part &agrave; de nombreuses analyses temporelles
(variations d'&eacute;clats, orbites, etc.). Le principe de la
calibration astrom&eacute;trique &agrave; la commande de la console est
le m&ecirc;me que pour une seule image. La syntaxe de la commande
calibwcs2 est la suivante :<br />
<br />
calibwcs2 in out number Angle_ra Angle_dec pixsize1_mu pixsize2_mu
foclen_m USNO|MICROCAT cat_folder ?first_index?<br />
<br />
On retrouve les param&egrave;tres Angle_ra Angle_dec pixsize1_mu
pixsize2_mu foclen_m USNO|MICROCAT cat_folder, d&eacute;j&agrave;
d&eacute;crits dans la fonction calibwcs. On trouve aussi les
param&egrave;tres suivants:<br />
<ul>
  <li>in : est le nom g&eacute;n&eacute;rique des images &agrave;
calibrer</li>
  <li>out : est le nom g&eacute;n&eacute;rique des images apr&egrave;s
calibration astrom&eacute;trique</li>
  <li>number est le nombre d'images dans la s&eacute;rie<br />
  </li>
</ul>
Au cours des&nbsp;op&eacute;rations de calbration, la fonction calibwcs
affiche le nombre d'&eacute;toiles appari&eacute;es pour chaque image.<br />
<h1>4. Commande de fen&ecirc;tre pour calibrer l'astrom&eacute;trie
d'une seule image</h1>
Pour utiliser la commande graphique de calibration
astrom&eacute;trique, on d&eacute;roule le menu Analyse et on choisit
l'item Calibration Astrom&eacute;trique.<br />
<br />
<img style="width: 516px; height: 470px;" alt=""
 src="../images/calib_astrom1.png" /><br />
<br />
Il convient de remplir les champs suivants :<br />
<ul>
  <li>RA : La coordonn&eacute;e c&eacute;leste approximative de
l'ascension droite du centre du champ (degr&eacute;s)</li>
  <li>DEC : La coordonn&eacute;e c&eacute;leste approximative de
d&eacute;clinaison du centre du champ (degr&eacute;s)</li>
  <li>FOCLEN : Longueur focale du t&eacute;lescope (en m&egrave;tres)</li>
  <li>PIXSIZE1 : La dimension (en microm&egrave;tres) du cot&eacute; X
d'un pixel de la cam&eacute;ra&nbsp;apr&egrave;s binning</li>
  <li>PIXSIZE2 : La dimension (en microm&egrave;tres) du cot&eacute; Y
d'un pixel de la cam&eacute;ra&nbsp;apr&egrave;s binning</li>
  <li>CROTA2 : L'angle de position du nord par rapport au haut de
l'image. Mettre z&eacute;ro si on ne le conna&icirc;t pas.</li>
  <li>CRPIX1 : Pixel de r&eacute;f&eacute;rence sur l'axe X. en
g&eacute;n&eacute;ral on prend le centre du champ (valeurs
propos&eacute;es par d&eacute;faut)</li>
  <li>CRPIX2 : Pixel de r&eacute;f&eacute;rence sur l'axe Y. en
g&eacute;n&eacute;ral on prend le centre du champ (valeurs
propos&eacute;es par d&eacute;faut)</li>
  <li>Nom du catalogue : Prendre USNO ou MICROCAT</li>
  <li>Chemin d'acc&egrave;s au catalogue : &nbsp;Indiquer dans quel
dossier se trouve le catalogue de calibration</li>
</ul>
On appuit sur le bouton D&eacute;marrer le calcul de la calibration.
Une fen&ecirc;tre appara&icirc;t &agrave; la fin de l'op&eacute;ration
pour indiquer la qualit&eacute; de la calibration.<br />
<h1>5. Comment mesurer les coordonn&eacute;es d'une &eacute;toile ?</h1>
Apr&egrave;s avoir effectu&eacute; une calibration astrom&eacute;trique
par l'une des m&eacute;thodes pr&eacute;c&eacute;dentes, les
coordonn&eacute;es (X,Y) du curseur&nbsp;de l'image affich&eacute;e
apparaissent en bleu. Cela signifie que l'on peut basculer sur
l'affichage en coordonn&eacute;es (Ra,Dec) lorsqu'on clique sur la zone
de coordonn&eacute;es en bleu. <br />
<br />
Pour calculer les coordonn&eacute;es (ra,dec) d'une &eacute;toile, il
suffit de l'entourer avec un cadre bleu (utiliser la souris) puis de
faire clic droit et demander Ajuster une gaussienne. Dans le console de
AudeLA, on pourra lire de nombreuses informations. Par exemple :<br />
<pre style="background-color: rgb(255, 255, 204);"># === Visu1 === Ajuster une gaussienne ===<br /># Coordonn&eacute;es de la fen&ecirc;tre : 835 646 857 666<br /># Centre : 845.40 / 656.79<br /># Fwhm : 2.401 / 2.588<br /># Intensit&eacute; : 15782.222164 / 16116.749379<br /># Fond : 484.364238 / 479.551073<br /># Flux int&eacute;gr&eacute; : 112476.324382 +/- 1179.548735<br /># Magnitude instrumentale -2.5*log10(flux) : -12.628 +/-&nbsp; 0.011<br /><br /># AD D&eacute;c. : 164.867805 67.509553<br /># AD D&eacute;c. : 10h59m28s27 +67d30m34s39<br /><br /># OLD Format MPC :<br />&nbsp;&nbsp;&nbsp;&nbsp; .&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148<br /><br /># Attention :<br /># Le site UAI 148 doit &ecirc;tre celui o&ugrave; l'image a &eacute;t&eacute; acquise.<br /><br /># Use http://cfa-www.harvard.edu/iau/info/Astrometry.html for informations.<br /># Use ::astrometry::mpc_provisional2packed to convert designation to MPC packed form.</pre>
Les coordonn&eacute;es (x,y) pr&eacute;cises sont calcul&eacute;es
&agrave; partir d'un ajustement par une forme gaussienne. Elles sont
affich&eacute;es apr&egrave;s le mot Centre. Les coordonn&eacute;es
(Ra,Dec) sont affich&eacute;es sous deux formes diff&eacute;rentes
apr&egrave;s les mots AD D&eacute;c.<br />
<br />
Les derni&egrave;res lignes de l'affichage des r&eacute;sultats dans la
console concernent le fomat d'envoi des mesures astrom&eacute;triques
des ast&eacute;ro&iuml;des et des com&egrave;tes pour le Minor Planet
Center (MPC). Dans l'exemple cit&eacute; ici il s'agit de la ligne
suivante :<br />
<pre>123456789 123456789 123456789 123456789 123456789 123456789 123456789 123456789<br />&nbsp;&nbsp;&nbsp;&nbsp; .&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148</pre>
Il faut remplacer les premiers caract&egrave;res de la ligne par la
d&eacute;nomination de l'objet mesur&eacute;.<br />
<br />
Si l'astre est inconnu, on lui donne une designation personnelle. Par
exemple OBJ1. On &eacute;crira OBJ1 &agrave; partir de la position du
point . situ&eacute; dans la colonne 6 :<br />
<pre>&nbsp;&nbsp;&nbsp;&nbsp; OBJ1&nbsp;&nbsp;&nbsp;&nbsp; C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148</pre>
Si l'astre est identifi&eacute; sous la forme de son num&eacute;ro
d&eacute;finitif, on &eacute;crit ce num&eacute;ro &agrave; partir de
la colonne 1 et on enl&egrave;ve le point de la colonne 6. Par exemple,
pour l'ast&eacute;ro&iuml;de num&eacute;ro (10222) :<br />
<pre>10222 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148</pre>
Si l'astre est identifi&eacute; sous la forme de son num&eacute;ro
provisoire, on
&eacute;crit ce num&eacute;ro &agrave; partir de la colonne 6 et on
utilise la fonction de console ::astrometry::mpc_provisional2packed
pour convertir la d&eacute;signation provisoire au format
empaquet&eacute;. Par exemple, pour l'ast&eacute;ro&iuml;de 2010 PF
145, on &eacute;crit :<br />
<pre>::astrometry::mpc_provisional2packed 2010PF145<br /># K10PE5F</pre>
Ainsi, la ligne au format MPC devient :<br />
<pre>&nbsp;&nbsp;&nbsp;&nbsp; K10PE5F  C2011 02 05.20321 10 59 28.27 +67 30 34.3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -8.7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 148<br /></pre>
Enfin, il convient de remplacer la magnitude (ici -8.7 dans l'exemple)
par sa valeur mesur&eacute;e par une calibration photom&eacute;trique
(cf. le tutorial d&eacute;di&eacute;).<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
</body>
</html>
