<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Editeurs</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 10 mars 2005</p>
<h1>Editeurs </h1>
<p> En cliquant avec le bouton gauche de la souris sur Editeurs..., voici la bo&icirc;te de dialogue qui appara&icirc;t sur votre &eacute;cran : </p>
<img src="../../images/image08.gif" alt="" width="512" height="243" />
<p>C'est ici que vous devez d&eacute;finir vos logiciels pr&eacute;f&eacute;r&eacute;s pour : </p>
<ul>
  <li>Editer les scripts au format tcl (nous avons choisi par d&eacute;faut write, c'est &agrave; dire WordPad sous Windows).</li>
  <li>Visualiser les notices disponibles au format pdf (elles seront ainsi directement accessibles &agrave; partir du menu d&eacute;roulant Aide --&gt; Notices (.pdf)...). </li>
  <li>Naviguer sur votre disque dur ou sur le web pour : </li>
</ul>
<ul><ul>
  <li>Visualiser les fonctions disponibles dans le logiciel (menu d&eacute;roulant Aide --&gt; Index des fonctions). </li>
  <li>Visualiser la page de configuration du logiciel (menu d&eacute;roulant Aide --&gt; Aide &agrave; la configuration d'Aud'ACE).</li>
  <li>Acc&eacute;der &agrave; une copie du site web de r&eacute;f&eacute;rence pr&eacute;sente sur votre disque dur (menu d&eacute;roulant Aide --&gt; Site Web --&gt; Utiliser la copie du disque dur...). </li>
  <li>Se connecter directement par Internet au site web de r&eacute;f&eacute;rence du logiciel (menu d&eacute;roulant Aide --&gt; Site Web --&gt; Connexion &agrave; Internet). </li>
  <li>Demander une mise &agrave; jour du fichier des observatoires ayant un num&eacute;ro UAI (Configuration --&gt; Position de l'observateur... --&gt; Mise &agrave; jour). </li>
</ul></ul>
<ul>
  <li>Retoucher des images issues d'un APN (Appareil Photo Num&eacute;rique).</li>
</ul>
<p> Le principe de navigation vers les applications est simple.</p>
<p>Si vous souhaitez renseigner le chemin d'acc&egrave;s &agrave; votre application pr&eacute;f&eacute;r&eacute;e pour la lecture des notices disponibles au format pdf par exemple, rien de plus simple, il vous suffit de cliquer avec le bouton gauche de la souris sur le <img src="../../images/image09.gif" alt="" width="19" height="33" /> qui se trouve juste avant Voir les notices (.pdf). </p>
<p>Une nouvelle bo&icirc;te de dialogue appara&icirc;t &agrave; l'&eacute;cran, il s'agit d'un explorateur similaire &agrave; celui de Windows que vous connaissez tous. Vous devez maintenant naviguer &agrave; l'int&eacute;rieur des diff&eacute;rents dossiers et sous dossiers en double cliquant avec le bouton gauche de la souris jusqu'&agrave; l'application d&eacute;sir&eacute;e. Comme c'est la m&ecirc;me bo&icirc;te de dialogue qui s'ouvre pour les autres rubriques (Editeur de scripts, Navigateur Web et Visualiseur d'images) et qu'elle se positionne al&eacute;atoirement &agrave; l'&eacute;cran, nous avons choisi d'afficher le libell&eacute; de la rubrique concern&eacute;e en italique et encadr&eacute;. </p>
<img src="../../images/image10.gif" alt="" width="628" height="536" />
<p>Lorsque vous &ecirc;tes arriv&eacute;s &agrave; l'application (AcroRd32.exe par exemple), vous pouvez : </p>
<ul>
  <li>Soit double cliquer sur son ic&ocirc;ne, dans ce cas la bo&icirc;te de dialogue Voir les notices (.pdf) se ferme et le chemin complet de l'application se reporte dans le champ concern&eacute; (Voir les notices (.pdf) dans le cas pr&eacute;sent).</li>
  <li>Soit la s&eacute;lectionner par un simple clic, et ensuite appuyer sur le bouton Ouvrir de la bo&icirc;te de dialogue "Voir les notices (.pdf)", ici aussi le chemin complet de l'application se reporte automatiquement dans le champ concern&eacute;.</li>
</ul>
<p>Faites la m&ecirc;me chose pour les rubriques Navigateur Web, Editeur de scripts (pour ce dernier cas vous pouvez laisser la configuration par d&eacute;faut qui est write) et Visualiseur d'images. </p>
<p>Maintenant que vous avez choisi vos quatre applications pr&eacute;f&eacute;r&eacute;es, vous devez valider ce choix en cliquant sur le bouton OK ou Appliquer de la fen&ecirc;tre Editeurs. Si ce choix ne vous convient pas, vous pouvez soit naviguer &agrave; nouveau dans les dossiers pour s&eacute;lectionner les bonnes applications, soit appuyer sur le bouton Fermer pour annuler votre s&eacute;lection. </p>
</body>

</html>
