<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>R&eacute;pertoires</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 10 mars 2005</p>
<h1>R&eacute;pertoires </h1>
<p> En cliquant avec le bouton gauche de la souris sur R&eacute;pertoires..., voici la bo&icirc;te de dialogue qui appara&icirc;t sur votre &eacute;cran. Par d&eacute;faut au premier d&eacute;marrage du logiciel Aud'ACE, les champs d&eacute;finissant les diff&eacute;rents r&eacute;pertoires sont initialis&eacute;s avec les chemins ci-dessous, si bien s&ucirc;r le logiciel est install&eacute; dans le r&eacute;pertoire C:/Astronomie/AudeLA-1.2.3 : </p>
<img src="../../images/image11.gif" alt="" width="478" height="241" />
<p>C'est ici que vous devez d&eacute;finir les chemins des r&eacute;pertoires dans lesquels vous positionnerez : </p>
<ul>
  <li>Les images que vous allez acqu&eacute;rir lors de votre nuit d'observation, celles que vous pr&eacute;traiterez et traiterez, etc.</li>
  <li>Les scripts que vous avez &eacute;crit pour vos besoins sp&eacute;cifiques, ceux que vous avez t&eacute;l&eacute;charg&eacute;s du site de r&eacute;f&eacute;rence, etc. </li>
  <li>Les catalogues que vous souhaitez utiliser.</li>
</ul>
<p>Dans l'exemple suivant, vous avez choisi de sauvegarder les images dans le r&eacute;pertoire C:/Astronomie/AudeLA-1.2.3/images/041023, les scripts seront ex&eacute;cut&eacute;s &agrave; partir du r&eacute;pertoire C:/Astronomie/AudeLA-1.2.3/scripts, et enfin le chemin pour les catalogues sera C:/Astronomie/AudeLA-1.2.3/catalogues. La bo&icirc;te de dialogue est la suivante : </p>
<img src="../../images/image12.gif" alt="" width="478" height="241" />
<p>Mais pour en arriver l&agrave;, comment faut-il proc&eacute;der ? </p>
<p>Le principe de navigation vers les r&eacute;pertoires cibles est simple. </p>
<p>Toujours pour vous faciliter la t&acirc;che, le libell&eacute; du champ s&eacute;lectionn&eacute; appara&icirc;t en italique et encadr&eacute; apr&egrave;s appui sur le bouton <img src="../../images/image09.gif" alt=""
 width="19" height="33" />. A ce stade une bo&icirc;te de dialogue nomm&eacute;e Rechercher un dossier s'ouvre, il s'agit d'un explorateur. Vous obtenez &agrave; l'&eacute;cran ce qui suit :</p>
<img src="../../images/image13.gif" alt="" width="530" height="411" />
<p>La s&eacute;lection du r&eacute;pertoire se fait en navigant dans l'arborescence de votre disque dur, par un simple clic du bouton gauche de votre souris sur le r&eacute;pertoire voulu. S'il y a des sous r&eacute;pertoires, l'arborescence s'ouvre automatiquement, de proche en proche vous parvenez jusqu'au r&eacute;pertoire d&eacute;sir&eacute;. La seule contrainte est que ce r&eacute;pertoire cible doit d&eacute;j&agrave; exister dans votre arborescence. Une fois la s&eacute;lection faite, il vous reste &agrave; valider ce choix en appuyant sur le bouton OK de la bo&icirc;te de dialogue Rechercher un dossier. Le nouveau chemin est automatiquement recopi&eacute; dans le champ correspondant qui passe d'italique &agrave; normal toujours de couleur noire. Il ne vous reste plus &eacute;ventuellement qu'&agrave; faire la m&ecirc;me chose pour les 2 autres champs (R&eacute;pertoire des scripts et R&eacute;pertoire des catalogues). Cette fois, vos 3 r&eacute;pertoires sont configur&eacute;s, il vous suffit d'appuyer sur le bouton OK ou Appliquer de la bo&icirc;te de dialogue R&eacute;pertoires et le tour est jou&eacute;. Comme nous l'avons d&eacute;j&agrave; vu, &agrave; sa fermeture le logiciel vous proposera de sauvegarder cette nouvelle configuration. </p>
<p>Si vous &ecirc;tes un fanatique des commandes en ligne, vous pouvez &eacute;diter directement le chemin des r&eacute;pertoires au clavier dans les champs, mais faites tr&egrave;s attention les \ habituels de Windows doivent imp&eacute;rativement &ecirc;tre remplac&eacute;s par des / dans la bo&icirc;te de dialogue R&eacute;pertoires.</p>
</body>

</html>
