<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Temps</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 09 mars 2005</p>
<h1>Temps </h1>
<p> L'objet du pr&eacute;sent paragraphe est le param&eacute;trage du temps. En cliquant avec le bouton gauche de la souris sur Temps..., voici la bo&icirc;te de dialogue qui appara&icirc;t sur votre &eacute;cran : </p>
<img src="../../images/image18.gif" alt="" width="333" height="247" />
<p>La configuration ci-dessus correspond &agrave; un micro ordinateur dont l'heure syst&egrave;me est cal&eacute;e sur l'heure locale (HL), c'est &agrave; dire celle qu'indique votre montre. On remarque que pour cette configuration il faut indiquer le fuseau horaire dans lequel on se situe par l'interm&eacute;diaire du <img src="../../images/image15.gif" alt="" width="18"
 height="18" /> sur la m&ecirc;me ligne que Choisissez votre fuseau horaire et pr&eacute;ciser si votre pays est assujetti &agrave; l'heure d'&eacute;t&eacute; / l'heure d'hiver (Et&eacute; ou Hiver) ou non (Aucun) &agrave; l'aide du <img
 src="../../images/image15.gif" alt="" width="18" height="18" /> qui se trouve sur la ligne Heure d'hiver / Heure d'&eacute;t&eacute;. </p>
<p>Si votre micro ordinateur est cal&eacute; sur le Temps Universel (TU), il est parfaitement possible de configurer l'interface Aud'ACE pour ce cas. A l'aide du <img src="../../images/image15.gif"
 alt="" width="18" height="18" /> situ&eacute; sur la m&ecirc;me ligne que Heure de l'ordinateur (HL ou TU), choisissez TU. Dans ce cas la bo&icirc;te de dialogue qui appara&icirc;t &agrave; l'&eacute;cran est celle-ci : </p>
<img src="../../images/image19.gif" alt="" width="333" height="189" />
<p>Ici on remarque qu'il n'y a plus les notions de fuseau horaire, ainsi que d'heure d'&eacute;t&eacute; ou d'hiver. </p>
<p>Comme cette bo&icirc;te affiche &eacute;galement le Temps Sid&eacute;ral Local (TSL), il est imp&eacute;ratif d'avoir correctement param&eacute;trer la bo&icirc;te de dialogue Position de l'observateur pour disposer d'un TSL coh&eacute;rent. </p>
<p>Ce choix entre un micro ordinateur dont l'heure syst&egrave;me est cal&eacute;e sur l'Heure L&eacute;gale ou le Temps Universel a une influence directe sur la date et l'heure affich&eacute;es en bas de la fen&ecirc;tre principale, &agrave; droite des curseurs de r&eacute;glage des seuils de visualisation des images. C'est la date et l'heure TU du moment.</p>
<p>Nota important : Lors d'une acquisition d'image CCD, c'est la date et l'heure TU qui sont enregistr&eacute;es dans l'en-t&ecirc;te FITS de l'image.</p>
<p>Comme d'habitude, il ne vous reste plus qu'&agrave; valider votre choix en appuyant sur le bouton OK ou Appliquer et &agrave; enregistrer votre nouvelle configuration &agrave; la fermeture du logiciel.</p>
</body>

</html>
