<!DOCTYPE doctype PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
            
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
            
  <meta name="Author" content="Alain Klotz">
            
  <meta name="GENERATOR"
 content="Mozilla/4.5 [fr] (Win98; I) [Netscape]">
            
  <meta name="ProgId" content="FrontPage.Editor.Document">
  <title>Librairie TT : Manuel de l'utilisateur</title>
                   
  <script language="javascript" src="style.js">


  </script>
</head>
  <body bgcolor="#ffffff">
      
<center>   
<h1> <b><font size="+3">LIB TT</font></b>&nbsp;<br>
   <b><font size="-1">une librairie de pr&eacute;traitement d'images astronomiques&nbsp;<br>
   version 20031117</font></b></h1>
  </center>
      
<center><b><font size="+3">Manuel de l'utilisateur</font></b></center>
      
<p>Ce guide de l'utilisateur s'adresse aux astronomes qui veulent &eacute;crire 
 des scripts de traitement d'image utilisant la librairie TT. Rappelons que
 seul le format d'images FITS est reconnu. </p>
   
<h1> <a name="mode script"></a>1. Guide de r&eacute;f&eacute;rence du mode
 script de TT</h1>
   L'int&eacute;r&ecirc;t principal de la librairie TT est de pouvoir ex&eacute;cuter 
 des commandes entr&eacute;es sous la forme de scripts.Un script TT est compos&eacute;
 d'une seule cha&icirc;ne de caract&egrave;res contenant des lignes (s&eacute;parateurs
 \n du langage C). Chaque ligne est analys&eacute;e s&eacute;quentiellement.
 Au sein d'une ligne, la premi&egrave;re cha&icirc;ne de caract&egrave;res
 rencontr&eacute;e doit contenir le mot cl&eacute; de d&eacute;finition.
Si  le mot cl&eacute; n'est pas reconnu, le restant de la ligne est interpr&eacute;t&eacute;
 comme une simple remarque. Le s&eacute;parateur blanc est utilis&eacute;
pour les param&egrave;tres suivants de la ligne.   
<p>Il existe actuellement quatre mots-cl&eacute;s de d&eacute;finition : </p>
   
<ul>
  SET/VAR : initialise la valeur d'une variable de substitution. Cette d&eacute;finition
 comporte deux arguments : le mot &agrave; substituer et le mot substitu&eacute;.
 Les lignes suivantes se verront ainsi remplacer les mots &agrave; substituer
 par le mot substitu&eacute;.       
  <p>IMA/SERIES : traitement d'une s&eacute;rie d'images et cr&eacute;ation 
 d'autant d'images en sortie qu'en entr&eacute;e. </p>
       
  <p>IMA/STACK : traitement d'une pile d'images et cr&eacute;ation d'une seule
image en sortie. </p>
       
  <p>TMPFILE/EXT : assignation d'un mot qui sera ajout&eacute; au nom des 
 fichiers temporaires (extensions .lst).</p>
   
</ul>
      
<h2> 1.1. Param&eacute;trages des d&eacute;finitions IMA/</h2>
   La forme g&eacute;n&eacute;rale d'une ligne d&eacute;finie par un mot
cl&eacute;  de type IMA/ est la suivante :d&eacute;finition rep_in nom_in
ext_in indice_deb  indice_fin rep_out nom_out ext_out indice_out fonction
param&egrave;tres ...   
<ul>
  d&eacute;finition : IMA/SERIES ou IMA/STACK       
  <p>rep_in : chemin d'acc&egrave;s aux fichiers d'image d'entr&eacute;e (mettre
un point si c'est le r&eacute;pertoire courant de libtt). </p>
       
  <p>nom_in : nom g&eacute;n&eacute;rique des images d'entr&eacute;e </p>
       
  <p>indice_deb : nombre correspondant &agrave; l'indice de la premi&egrave;re 
 image (mettre un point s'il n'y a pas d'indice) </p>
       
  <p>indice_fin : nombre correspondant &agrave; l'indice de la derni&egrave;re 
 image (mettre un point s'il n'y a pas d'indice) </p>
       
  <p>ext_in : nom de l'extension (suffixe) des fichiers images d'entr&eacute;e 
   </p>
       
  <p>rep_out : chemin d'acc&egrave;s aux fichiers d'images de sortie (mettre 
 un point si c'est le r&eacute;pertoire courant de libtt). </p>
       
  <p>nom_out : nom g&eacute;n&eacute;rique des images de sortie. </p>
       
  <p>indice_out : nombre correspondant &agrave; l'indice de la premi&egrave;re 
 image de sortie (mettre un point s'il n'y a pas d'indice) </p>
       
  <p>ext_out : nom de l'extension (suffixe) des fichiers images de sortie. 
   </p>
       
  <p>fonction : nom de la fonction (voir ci-apr&egrave;s). </p>
       
  <p>param&egrave;tres ... : liste de param&egrave;tres propres &agrave; chaque
fonction</p>
   
</ul>
   Exemple d'une ligne de script :IMA/STACK . i 1 5 .fit c:\toto j . .fit 
SK bitpix=32 kappa=1.5 nullpixel=-1000 jpegfile   
<p>Ce script demande d'effectuer un pile kappa-sigma (fonction SK) des images
 i1.fit &agrave; i5.fit du r&eacute;pertoire courant en une image j.fit dans
 le r&eacute;pertoire c:\toto. L'image j.fit sera enregistr&eacute;e en entiers
 de 4 octets (bitpix=32), le coefficient kappa vaut 1.5 et les pixels de
valeur  inf&eacute;rieure ou &eacute;gale &agrave; -1000 ADU ne seront pas
pris en  compte dans calcul des kappa-sigma. </p>
   
<p>A noter : dans ce propos, le terme de nom complet signifie le nom du fichier
 incluant le r&eacute;pertoire et le suffixe. Ainsi : c:\toto\j.fit est un
 nom complet alors que le nom de l'image est j. </p>
   
<p>Si un param&egrave;tre doit contenir des caract&egrave;res blancs, encadrer 
 le param&egrave;tre par des doubles quotes. Par exemple : </p>
   
<p>IMA/SERIES . i 1 5 .fit c:\toto j 1 .fit RESAMPLE "paramresample=1.5 0
 0 0 1.5 0 0" </p>
   
<p>les double quotes doivent encadrer aussi le mot d&eacute;signant le param&egrave;tre. 
 </p>
   
<p>Noter que l'extension .mt pour le format FITS g&egrave;re le syst&egrave;me 
 d'indexation des images diff&eacute;remment des autres extensions. Des z&eacute;ros
 sont ajout&eacute;s automatiquement devant les indices pour que l'indice
contienne 4 chiffres. Par exemple IMA/SERIES . i 1 5 .mt c:\toto j 1 .fit
COPY, va chercher les fichiers i0001.mt &agrave; i0005.mt en lecture. </p>
   
<h3> <a name="functions"></a>1.1.1. Liste g&eacute;n&eacute;rale des fonctions 
 disponibles pour IMA/</h3>
   &nbsp;   
<table border="1" width="100%">
   <tbody>
      <tr>
   <td>mot cl&eacute; de d&eacute;finition [et param&egrave;tres disponibles]</td>
    <td>mot cl&eacute; de la fonction [et param&egrave;tres disponibles]</td>
   </tr>
    <tr>
   <td>IMA/STACK [bitpix jpegfile skylevel nullpixel&nbsp; <br>
  jpeg_quality]</td>
    <td>ADD&nbsp; <br>
  SK [kappa]&nbsp; <br>
  SORT [percent]&nbsp; <br>
  MED&nbsp; <br>
  MEAN<br>
SIG<br>
      </td>
   </tr>
    <tr>
   <td>IMA/SERIES [bitpix jpegfile skylevel nullpixel&nbsp; <br>
  jpeg_quality]</td>
    <td>SUB [file offset]&nbsp; <br>
  ADD [file offset]&nbsp; <br>
  OFFSET [offset]&nbsp; <br>
  COPY [nbsubseries]&nbsp; <br>
  DIV [file] [constant]&nbsp; <br>
  FILTER [threshold] [type_threshold] [kernel_width] [kernel_type] [kernel_coef]&nbsp; 
       <br>
  OPT [dark] [bias] [therm_kappa] [unsmearing]&nbsp; <br>
  TRANS [trans_x] [trans_y]&nbsp; <br>
  STAT [pixelsat_value] [fwhm] [objefile] [pixefile] [border] [detect_kappa] 
 [pixint]&nbsp; <br>
  DELETE&nbsp; <br>
  NORMGAIN [normgain_value]&nbsp; <br>
  NORMOFFSET [normoffset_value]&nbsp; <br>
  CATCHART [path_astromcatalog] [astromcatalog] [catafile] [jpegfile_chart]&nbsp; 
 [jpegfile_chart2] [magrlim] [magblim]&nbsp; <br>
  HEADERFITS [file]&nbsp; <br>
  REGISTER [translate] [normaflux] [matchwcs]&nbsp; <br>
  ASTROMETRY [file_ascii]&nbsp; <br>
  UNSMEARING [unsmearing]&nbsp; <br>
  INVERT [mirror] [flip] [xy] [normaflux]&nbsp; <br>
  CONV [kernel_type] [sigma]&nbsp; <br>
  SUBDARK [dark] [bias] [exptime] [dexptime] [unsmearing]&nbsp; <br>
  RGRADIENT [xcenter] [ycenter] [radius] [angle]&nbsp; <br>
  HOUGH [threshold] [binary]&nbsp; <br>
  BACK [back_kernel] [back_threshold] [sub] [div]&nbsp; <br>
  RESAMPLE [paramresample] [normaflux]&nbsp; <br>
  CUTS [hicut] [locut] [keytype] [cutscontrast]&nbsp; <br>
  MULT [constant]&nbsp; <br>
  SORTX [x1] [x2] [width]&nbsp; <br>
  SORTY [y1] [y2] [height]&nbsp; <br>
                 
      <hr width="100%">               
      <center>Fonctions &eacute;crites par tt_user3&nbsp;</center>
   ROT [y0] [x0] [angle]&nbsp; <br>
  BINX [x1] [x2] [width]&nbsp; <br>
  BINY [y1] [y2] [height]&nbsp; <br>
  PROFILE [offset] [direction] [filename]&nbsp; <br>
  MATRIX [x1] [x2] [y1] [y2] [filematrix]&nbsp; <br>
  WINDOW [x1] [x2] [y1] [y2]&nbsp; <br>
  LOG [offsetlog] [coeff]&nbsp; <br>
  MEDIANX [x1] [x2] [width]&nbsp; <br>
  MEDIANY [y1] [y2] [height]&nbsp; <br>
  REC2POL [y0] [x0] [scale_theta] [scale_rho]&nbsp; <br>
  POL2REC [y0] [x0] [scale_theta] [scale_rho] [width] [height]&nbsp; <br>
                 
      <hr width="100%">               
      <center>Fonctions &eacute;crites par tt_user4&nbsp;</center>
   ASTROMETRY2</td>
   </tr>
         
  </tbody>  
</table>
      
<h4> &nbsp;1.1.1.2. Param&egrave;tres optionnels de la d&eacute;finition
IMA/SERIES</h4>
      
<ul>
  [bitpix] permet de choisir le format de donn&eacute;es enregistr&eacute;es 
 dans le fichier FITS. On distingue les cas suivants :       
  <ul>
  bitpix=8 : octets non sign&eacute;s.           
    <p>bitpix=16 : entiers &agrave; 2 octets sign&eacute;s. </p>
           
    <p>bitpix=+16 : entiers &agrave; 2 octets non sign&eacute;s. </p>
           
    <p>bitpix=32 : entiers &agrave; 4 octets sign&eacute;s. </p>
           
    <p>bitpix=+32 : entiers &agrave; 4 octets non sign&eacute;s. </p>
           
    <p>bitpix=-32 : flottants &agrave; 4 octets (float). </p>
           
    <p>bitpix=-64 : entiers &agrave; 8 octets (double).</p>
       
  </ul>
   Par d&eacute;faut, les images de sortie prennent le m&ecirc;me type de 
donn&eacute;es que les images d'entr&eacute;e. <br>
  &nbsp;       
  <p>[jpegfile] (pas d'arguments) permet de sauver une ou plusieurs images 
 au format JPEG apr&egrave;s traitement. Les seuils sont pris &eacute;gaux 
 &agrave; ceux trouv&eacute;s dans l'en-t&ecirc;te de l'image (cf. fonction 
 IMA/SERIES STAT pour les calculer). Il y aura autant d'images JPEG g&eacute;n&eacute;r&eacute;es 
 que d'images finales FITS g&eacute;n&eacute;r&eacute;es. Chaque fichier JPEG
porte le m&ecirc;me nom que le fichier FITS correspondant dont le suffixe
 est remplac&eacute; par .jpg. Les fichiers JPEG sont enregistr&eacute;s
dans  le m&ecirc;me r&eacute;pertoire que les images FITS de sortie.</p>
   
</ul>
      
<ul>
  [jpeg_quality] (= valeur enti&egrave;re entre 5 et 100) permet de fixer 
la valeur du crit&egrave;re de qualit&eacute; de l'image JPEG (cf. utilisation 
 de [jpegfile]). Ce crit&egrave;re peut varier entre 5 (image tr&egrave;s 
d&eacute;grad&eacute;e) &agrave; 100 (image compress&eacute;e sans perte). 
Par d&eacute;faut, cette valeur est fix&eacute;e &agrave; 75.  
</ul>
      
<ul>
  [skylevel] (pas d'argument) permet de sauver la valeur du fond de ciel, 
avant traitement, dans l'en-t&ecirc;te de l'image trait&eacute;e (mot cl&eacute; 
 SKYLEVEL dans l'en-t&ecirc;te FITS).  
</ul>
      
<ul>
  [nullpixel] (= valeur en ADU). Permet d'indiquer &agrave; la fonction de
 ne pas prendre en compte les pixels dont les valeurs sont inf&eacute;rieures 
 ou &eacute;gales &agrave; la valeur seuil de nullpixel. Nullpixel employ&eacute; 
 sans argument signifie que la valeur seuil vaut z&eacute;ro.  
</ul>
      
<h4> 1.1.1.3. Param&egrave;tres optionnels de la d&eacute;finition IMA/STACK</h4>
      
<ul>
  A ce jour, les param&egrave;tres optionnels sont les m&ecirc;mes que pour
 IMA/SERIES  
</ul>
      
<h2> 1.2. Fonctions de la d&eacute;finition IMA/STACK</h2>
   Chacune des fonctions de IMA/STACK peut &ecirc;tre associ&eacute;e aux 
param&egrave;tres optionnels g&eacute;n&eacute;raux de IMA/STACK. Les param&egrave;tres 
optionnels (et leur argument) sp&eacute;cifiques &agrave; chaque fonction 
sont d&eacute;crits maintenant :   
<h4> <a name="stackADD"></a>1.2.1. Fonction ADD</h4>
      
<ul>
  Addition pixel &agrave; pixel des images de la pile. La date (DATE-OBS) 
et le temps de pose (EXPOSURE) sont chang&eacute;s en fonction des poids de
chacune des images entrant dans la pile.  
</ul>
      
<h4> <a name="stackMEAN"></a>1.2.2. Fonction MEAN</h4>
      
<ul>
  Moyenne pixel &agrave; pixel des images de la pile. La date (DATE-OBS)
et  le temps de pose (EXPOSURE) sont chang&eacute;s en fonction des poids
de chacune des images entrant dans la pile.  
</ul>
      
<h4> <a name="stackMED"></a>1.2.3. Fonction MED</h4>
      
<ul>
  M&eacute;diane pixel &agrave; pixel des images de la pile. La date (DATE-OBS)
 et le temps de pose (EXPOSURE) sont chang&eacute;s en fonction des poids
de chacune des images entrant dans la pile.  
</ul>
      
<h4> <a name="stackSORT"></a>1.2.4. Fonction SORT</h4>
      
<ul>
  Valeur tri&eacute;e, pixel &agrave; pixel, des images de la pile. Le calcul
 de la valeur tri&eacute;e est le suivant. La valeur de chaque pixel (x,y)
 de toutes les images de la pile sont tri&eacute;es dans l'ordre croissant. 
 Le param&egrave;tre optionnel [percent] permet de choisir la valeur tri&eacute;e. 
 La valeur tri&eacute;e est prise &eacute;gale au minimum si [percent=0], 
&agrave; la valeur m&eacute;diane si [percent=50] et au maximum si [percent=100]. 
percent peut prendre n'importe quelle valeur entre 0 et 100. Par d&eacute;faut 
[percent=50].  
</ul>
      
<ul>
  La date (DATE-OBS) et le temps de pose (EXPOSURE) sont chang&eacute;s en
 fonction des poids de chacune des images entrant dans la pile.  
</ul>
      
<h4> <a name="stack SK"></a>1.2.5. Fonction SK</h4>
      
<ul>
  moyenne kappa-sigma, pixel &agrave; pixel, des images de la pile. Le param&egrave;tre
 optionnel [kappa] permet de choisir le seuil de r&eacute;jection pour calculer
 la moyenne. Par d&eacute;faut [kappa=3]. La date (DATE-OBS) et le temps
de  pose (EXPOSURE) sont chang&eacute;s en fonction des poids de chacune
des images entrant dans la pile.<br>
</ul>
<h4> <a name="stack_SIG"></a>1.2.6. Fonction SIG</h4>
      
<ul>
  Ecart type, pixel &agrave; pixel, des images de la pile. La date (DATE-OBS)
et le temps de  pose (EXPOSURE) sont chang&eacute;s en fonction des poids
de chacune des images entrant dans la pile.  
</ul>
            
<h2> 1.3. Fonctions de la d&eacute;finition IMA/SERIES</h2>
   Chacune des fonctions de IMA/SERIES peut &ecirc;tre associ&eacute;e aux 
param&egrave;tres optionnels g&eacute;n&eacute;raux de IMA/SERIES. Les param&egrave;tres 
optionnels (et leur argument) sp&eacute;cifiques &agrave; chaque fonction 
sont d&eacute;crits maintenant :   
<h4> <a name="ADD"></a>1.3.1. Fonction ADD</h4>
      
<ul>
  Addition pixel &agrave; pixel avec une image dont le nom complet est d&eacute;fini
 par l'argument de [file]. Une valeur d'offset peut &ecirc;tre ajout&eacute;e
 et vaut l'argument de [offset].  
</ul>
      
<h4> <a name="SUB"></a>1.3.2. Fonction SUB</h4>
      
<ul>
  Soustraction pixel &agrave; pixel avec une image dont le nom complet est
 d&eacute;fini par l'argument de [file]. Une valeur d'offset peut &ecirc;tre 
 ajout&eacute;e et vaut l'argument de [offset].  
</ul>
      
<h4> <a name="OFFSET"></a>1.3.3. Fonction OFFSET</h4>
      
<ul>
  Ajoute, &agrave; tous les pixels, une valeur constante qui vaut l'argument 
 de [offset].  
</ul>
      
<h4> <a name="COPY"></a>1.3.4. Fonction COPY</h4>
      
<ul>
  Recopie sans rien changer, les images vers un autre nom, r&eacute;pertoire, 
 suffixe.  
</ul>
      
<ul>
  Il est possible de changer le num&eacute;ro d'ordre des indices des fichiers
 de sortie en sp&eacute;cifiant le nombre de sous s&eacute;ries (param&egrave;tre
 [nbsubseries]=1 par d&eacute;faut). Par exemple, si l'on a r&eacute;alis&eacute;
 douze images i1 &agrave; i12 en quatre sous s&eacute;ries de trois images
 ([nbsubseries]=4) l'indexation des images de sortie (j1 &agrave; j12) sera
 faite ainsi :       
  <p>entr&eacute;e (1 2 3) (4 5 6) (7 8 9) (10 11 12) <br>
  sortie (1 4 7 10) (2 5 8 11) (3 6 9 12) </p>
       
  <p>De cette fa&ccedil;on, la premi&egrave;re s&eacute;rie en sortie contient 
 les premi&egrave;res images de chaque s&eacute;rie d'entr&eacute;e, le deuxi&egrave;me
 s&eacute;rie en sortie contient les deuxi&egrave;mes images de chaque s&eacute;rie
 d'entr&eacute;e et ainsi de suite. En pratique, cela permet de trier les
images en vue de la r&eacute;alisation d'un superflat &agrave; partir de
s&eacute;ries d'images. Dans notre exemple, (1 2 3) sont trois images du
m&ecirc;me champ, (4 5 6) trois images d'un autre champ, etc. La s&eacute;rie
de sortie (1 4 7 10) c'est &agrave; dire j1 &agrave; j4 contient les images
de champs diff&eacute;rents et peuvent synth&eacute;tiser un superflat. La
deuxi&egrave;me s&eacute;rie de sortie (2 5 8 11) permet de r&eacute;aliser
un deuxi&egrave;me superflat et ainsi de suite. Il suffit ensuite de combiner
les superflats pour r&eacute;aliser un superflat total.</p>
   
</ul>
      
<h4> <a name="DIV"></a>1.3.5. Fonction DIV</h4>
      
<ul>
  Division pixel &agrave; pixel avec une image dont le nom complet est d&eacute;fini
 par l'argument de [file]. Une valeur constante peut &ecirc;tre multipli&eacute;e
 et vaut l'argument de [constant].  
</ul>
      
<h4> <a name="FILTER"></a>1.3.6. Fonction FILTER</h4>
      
<ul>
  Filtrage spatial d'image avec un filtre kernel. Le masque de kernel est 
carr&eacute; est comporte [kernel_width] pixels. Les valeurs du kernel sont 
pr&eacute;d&eacute;finies en fonction du [kernel_type]<br>
   <br>
        
  <ul>
  kernel_type=fh : filtre passe haut           
    <p>kernel_type=fb : filtre passe bas </p>
           
    <p>kernel_type=med : filtre m&eacute;dian </p>
           
    <p>kernel_type=min : filtre minimum </p>
           
    <p>kernel_type=max : filtre maximum </p>
           
    <p>kernel_type=mean : filtre moyen<br>
     </p>
     
    <p>kernel_type=gradleft : filtre gradient &eacute;clair&eacute; par la 
gauche<br>
 kernel_type=gradright : filtre gradient &eacute;clair&eacute; par la droite<br>
 kernel_type=gradup : filtre gradient &eacute;clair&eacute; par le haut<br>
 kernel_type=graddown : filtre gradient &eacute;clair&eacute; par le bas<br>
     </p>
       
  </ul>
   L'argument de [kernel_coef] permet de r&eacute;gler l'efficacit&eacute; 
d'action du filtre. Cette efficacit&eacute; est nulle (le filtre n'a aucun 
effet) si la valeur vaut 1. L'efficacit&eacute; est maximale si la valeur 
vaut 0. En pratique l'efficacit&eacute; est calcul&eacute;e de la fa&ccedil;on 
suivante : value est la valeur initiale du pixel central du kernel, val0 est
la valeur filtr&eacute;e par le kernel, valmax est l'avant derni&egrave;re 
valeur maximale des pixels sous le kernel et valmin est la deuxi&egrave;me 
valeur minimale des pixels sous le kernel. On calcule val1 et val2 de la fa&ccedil;on
suivante :  
</ul>
      
<ul>
  &nbsp;&nbsp;&nbsp;&nbsp; val1=fabs((double)(val0-value)); <br>
  &nbsp;&nbsp;&nbsp;&nbsp; val2=kernel_coef*(valmax-valmin);       
  <p>La valeur initiale est remplac&eacute;e par la valeur filtr&eacute;e 
 si val1&lt;val2. </p>
       
  <p>Le param&egrave;tre [threshold] permet d'assigner un seuil de limite 
 du calcul du filtre et [type_threshold] permet de distinguer la condition 
 du calcul par rapport &agrave; ce seuil. </p>
       
  <ul>
  type_threshold=-1 : le filtre est appliqu&eacute; si le pixel central initial
 a une valeur inf&eacute;rieure ou &eacute;gale au seuil [threshold]    
 
  </ul>
          
  <ul>
  type_threshold=0 : le filtre est appliqu&eacute; &agrave; tous les pixels
 de l'image (valeur par d&eacute;faut).      
  </ul>
          
  <ul>
  type_threshold=+1 : le filtre est appliqu&eacute; si le pixel central initial
 a une valeur sup&eacute;rieure ou &eacute;gale au seuil [threshold]    
 
  </ul>
     
</ul>
      
<h4> <a name="OPT"></a>1.3.7. Fonction OPT</h4>
      
<ul>
  Correction du dark avec optimisation. Les images sont corrig&eacute;es
des  images [bias] et [dark] (noms complets). L'image [dark] est optimis&eacute;e 
 avant d'&ecirc;tre soustraite. L'optimisation se fait sur les pixels dont 
 la valeur est sup&eacute;rieure &agrave; un certain seuil dans l'image dark.
 Ce seuil est calcul&eacute; comme la moyenne + [therm_kappa] sigma. Par
d&eacute;faut,&nbsp;  [therm_kappa]=0.25.  
</ul>
      
<ul>
  A la suite des corrections pr&eacute;c&eacute;dentes, il est possible d'effectuer
 une correction de tra&icirc;n&eacute;e (deconvflat) dans le cas d'une image
 effectu&eacute;e avec une cam&eacute;ra sans obturateur. Pour ce faire,
indiquer  la valeur du rapport de lecture (en g&eacute;n&eacute;ral proche
de 0.0005)  dans le param&egrave;tre [unsmearing].  
</ul>
      
<h4> <a name="TRANS"></a>1.3.8. Fonction TRANS</h4>
      
<ul>
  Effectue une translation constante de [trans_x] [trans_y] pixels de toutes
 les images. Les mots cl&eacute; d'astrom&eacute;trie (WCS), &eacute;ventuellement 
 pr&eacute;sents dans l'en-t&ecirc;te Fits, sont modifi&eacute;s en cons&eacute;quence.
 
</ul>
      
<h4> <a name="STAT"></a>1.3.9. Fonction STAT</h4>
      
<ul>
  Effectue le calcul des param&egrave;tres statistiques de l'image (moyenne, 
 &eacute;cart type, minimum, maximum, moyenne du fond, &eacute;cart type du
fond, seuil haut, seuil bas, contraste). Calcule le nombre de pixels satur&eacute;s
 si on d&eacute;finit la valeur de [pixelsat_value]. Calcule la largeur &agrave;
 mi-hauteur moyenne des &eacute;toiles du champ si le param&egrave;tre optionnel
 [fwhm] est pr&eacute;sent.  
</ul>
      
<ul>
  Si l'option [objefile] est pr&eacute;sente, g&eacute;n&egrave;re une liste
 d'objets dont le nom complet du fichier FITS est l'argument de [objefile]. 
 De m&ecirc;me, on peut g&eacute;n&eacute;rer une liste de pixels dont le 
nom complet du fichier FITS est l'argument de [pixefile]. [pixefile] et [objefile]
 peuvent avoir le m&ecirc;me nom. Il est possible de r&eacute;duire la fen&ecirc;tre
 de recherche pour [objefile] et [pixefile]. Pour cela, on utilise le mot
[border] suivit d'un pourcentage. Ce pourcentage vaut 0 pour calculer sur
toute l'image (valeur par d&eacute;faut), et vaut au maximum 90 pour effectuer
le calcul sur une petite zone au centre de l'image. [border] n'affecte pas
le <br>
  calcul des param&egrave;tres statistiques moyenne, etc. Enfin, il est possible
 de r&eacute;gler le seuil de d&eacute;tection en agissant sur la valeur
de  [detect_kappa]. Par d&eacute;faut, [detect_kappa] vaut 3 (en unit&eacute;s
 d'&eacute;cart type du fond).       
  <p>Si le mot cl&eacute; [pixint] est pr&eacute;sent alors le calcul de la
liste d'objet est effectu&eacute; avec des coordonn&eacute;es (x,y) en pixels
entier et non pas fractionnaires (option par d&eacute;faut).</p>
   
</ul>
      
<h4> <a name="DELETE"></a>1.3.10. Fonction DELETE</h4>
      
<ul>
  Efface les fichiers.  
</ul>
      
<h4> <a name="NORMGAIN"></a>1.3.11. Fonction NORMGAIN</h4>
      
<ul>
  Normalise, par une multiplication, la valeur du fond de ciel &agrave; la
 valeur sp&eacute;cifi&eacute;e par [normgain_value]. Par d&eacute;faut,
la  valeur de [normgain_value] vaut la valeur de fond de ciel de la premi&egrave;re 
 image.  
</ul>
      
<h4> <a name="NORMOFFSET"></a>1.3.12. Fonction NORMOFFSET</h4>
      
<ul>
  Normalise, par un offset, la valeur du fond de ciel &agrave; la valeur
sp&eacute;cifi&eacute;e  par [normoffset_value]. Par d&eacute;faut, la valeur
de [normoffset_value]  vaut z&eacute;ro.  
</ul>
      
<h4> <a name="CATCHART"></a>1.3.13. Fonction CATCHART</h4>
      
<ul>
  Dresse un liste d'objets d'un catalogue correspondant au champ &agrave; 
l'image d'entr&eacute;. La liste est enregistr&eacute;e dans le fichier FITS 
de nom complet l'argument de [catafile]. Par d&eacute;faut (catafile employ&eacute;
 sans argument) le fichier FITS est celui de l'image de sortie. Ainsi, la
liste du catalogue est ajout&eacute;e derri&egrave;re l'image. Si l'on souhaite
 g&eacute;n&eacute;rer une liste catalogue &agrave; part de l'image, il suffit
 de sp&eacute;cifier son nom comme argument de [catafile]. Dans ce cas, ce
 fichier FITS contiendra toutes les listes catalogues de la s&eacute;rie
d'image.  
</ul>
      
<ul>
  [path_astromcatalog] est le chemin d'acc&egrave;s au catalogue. [astromcatalog] 
 est le nom du catalogue choisit :       
  <ul>
  astromcatalog=USNO : pour utiliser l'USNO A ou SA<br>
  astromcatalog=MICROCAT : pour utiliser le catalogue astrom&eacute;trique 
compact&eacute; Microcat.<br>
  Sinon, il s'agit d'un nom de fichier ASCII d'un catalogue personnel contenant
 des lignes de type "ra dec mag" o&ugrave; ra et dec sont exprim&eacute;s
en degr&eacute;s d&eacute;cimaux et mag est la magnitude.      
  </ul>
          
  <p>[jpegfile_chart] est le nom du fichier jpeg qui simule l'image du champ
 des &eacute;toiles du catalogue. <br>
  [jpegfile_chart2] est le nom du fichier jpeg qui simule l'image du champ
 des &eacute;toiles du catalogue qui se superposent en rouge sur le champ
observ&eacute;.   </p>
       
  <p>Il est possible de r&eacute;duire la fen&ecirc;tre de la carte des &eacute;toiles 
 du catalogue. Pour cela, on utilise le mot [border] suivit d'un pourcentage. 
 Ce pourcentage vaut 0 pour calculer sur toute l'image (valeur par d&eacute;faut), 
 et vaut au maximum 90 pour effectuer le calcul sur une petite zone au centre 
 de l'image (cf. fonction STAT de IMA/SERIES).<br>
    </p>
       
  <p>On peut fixer une limite de magnitude audela de laquelle on ne lit pas
 les donn&eacute;es dans le catalogue. Les arguments de [magrlim] [magblim]
 fixent ces limites (99 par d&eacute;faut). Dans le cas d'un catalogue personnel,
 seul [magrlim] est actif.<br>
    </p>
   
</ul>
      
<h4> <a name="HEADERFITS"></a>1.3.14. Fonction HEADERFITS</h4>
      
<ul>
  Ajoute des mots cl&eacute; &agrave; l'en-t&ecirc;te FITS. Les mots cl&eacute;s
 sont d&eacute;finis dans un fichier texte ASCII dont le nom complet est
l'argument  de [file]. Chaque mot cl&eacute; est d&eacute;fini par 5 lignes
dans le fichier  texte :       
  <ul>
  ligne 1 : nom du mot cl&eacute; (en majuscules &lt;= 8 lettres)       
   
    <p>ligne 2 : valeur associ&eacute;e au mot cl&eacute;. </p>
           
    <p>ligne 3 : type de la valeur (short, int, float, double, string) </p>
           
    <p>ligne 4 : commentaire </p>
           
    <p>ligne 5 : unit&eacute;s</p>
       
  </ul>
   S'il n'y a pas de commentaire, laisser la ligne blanche. De m&ecirc;me 
pour l'unit&eacute;. On peut ajouter autant de mots-cl&eacute;s que l'on veut.
 
</ul>
      
<h4> <a name="REGISTER"></a>1.3.15. Fonction REGISTER</h4>
      
<ul>
  Effectue la r&eacute;gistration des images par rapport &agrave; la premi&egrave;re.
 Il faut pr&eacute;alablement que toutes les images aient un liste d'objets
 associ&eacute;e (cf. fonction STAT). [translate] permet de contraindre le
 mode de calcul de la r&eacute;gistration :<br>
  <br>
       
  <ul>
  translate=only : on contraint le passage d'une image &agrave; l'autre par
 une translation.           
    <p>translate=before : on effectue d'abord le calcul de registration par 
 une translation, puis si aucun accord n'est trouv&eacute;, on effectue une
 transformation lin&eacute;aire quelconque. </p>
           
    <p>translate=after : on effectue d'abord le calcul de registration par 
 une transformation lin&eacute;aire quelconque. puis si aucun accord n'est 
 trouv&eacute;, on effectue une translation. </p>
           
    <p>translate=never : on effectue le calcul de registration uniquement
 par une transformation lin&eacute;aire quelconque.<br>
    </p>
       
  </ul>
     
</ul>
      
<ul>
Le mot d'option [matchwcs] indique que le recentrage ne sera fait qu'aves
les mots cl&eacute; WCS de l'image.<br>
&nbsp;<br>
  Par d&eacute;faut, l'int&eacute;grale du flux est conserv&eacute;e (par 
exemple, si l'image est dilat&eacute;e d'un facteur deux, sa dynamique sera 
r&eacute;duite d'un facteur 2). Pour imposer une normalisation autre du flux, 
utiliser le param&egrave;tre [normaflux]. Par exemple, pour garder la dynamique 
originelle, utiliser normaflux=1.       
  <p>Les mots cl&eacute; d'astrom&eacute;trie (WCS), &eacute;ventuellement 
 pr&eacute;sents dans l'en-t&ecirc;te Fits, sont modifi&eacute;s en cons&eacute;quence.</p>
   
</ul>
      
<h4> <a name="ASTROMETRY"></a>1.3.16. Fonction ASTROMETRY</h4>
      
<ul>
  Calcule les param&egrave;tres astrom&eacute;triques de l'image (mots cl&eacute;
 CRVAL1, CRVAL2, CD1_1, CD1_2, CD2_1, CD2_2 de l'en-t&ecirc;te FITS dans
le  cas d'une transformation lin&eacute;aire). Il faut pr&eacute;alablement
que  les images soient associ&eacute;es &agrave; des listes d'objets (voir
fonction  STAT) et des listes de catalogue (voir fonction CATCHART). De plus,
pour initialiser le calcul des coefficients astrom&eacute;triques, il faut
pr&eacute;d&eacute;finir  la valeur de RA, DEC, PIXSIZE1, PIXSIZE2 et FOCLEN
dans l'en-t&ecirc;te FITS  (cf. fonction HEADERFITS) :       
  <ul>
  RA : coordonn&eacute;e approximative d'ascension droite du centre de l'image
 (en degr&eacute;s)           
    <p>DEC : coordonn&eacute;e approximative de d&eacute;clinaison du centre 
 de l'image (en degr&eacute;s) </p>
           
    <p>PIXSIZE1 : taille du pixel sur l'axe x (en microns) </p>
           
    <p>PIXSIZE2 : taille du pixel sur l'axe y (en microns) </p>
           
    <p>FOCLEN : longueur focale approximative (en m&egrave;tres).&nbsp;</p>
       
  </ul>
     
</ul>
          
<blockquote>       
  <div style="line-height: 100%;">Le param&egrave;tre [epsilon] permet de 
 r&eacute;gler le rayon d'appariement de la m&eacute;thode des triangles (=0.002
par d&eacute;faut). [delta] permet de r&eacute;gler le nombre de pixels d'appariement
final (=1 par d&eacute;faut).<br>
   <br>
   </div>
          
  <div style="line-height: 100%;">Si le param&egrave;tre [objefile] est pr&eacute;sent, 
 il indique le nom du catalogue g&eacute;n&eacute;r&eacute; par Sextractor 
 &agrave; utiliser comme liste d'objets. Le catalogue est de la forme suivante 
 :<br>
   <br>
   </div>
          
  <div style="line-height: 100%;">&nbsp;&nbsp;&nbsp; <b><i>Indice&nbsp;&nbsp;&nbsp; 
 Flux&nbsp;&nbsp;&nbsp; ErrFlux&nbsp;&nbsp;&nbsp; Mag&nbsp;&nbsp;&nbsp; ErrMag&nbsp;&nbsp;&nbsp;
 Backgnd&nbsp;&nbsp;&nbsp; X&nbsp;&nbsp;&nbsp; Y&nbsp;&nbsp;&nbsp; X2&nbsp;&nbsp;&nbsp;
 Y2&nbsp;&nbsp;&nbsp; XY&nbsp;&nbsp;&nbsp; a&nbsp;&nbsp;&nbsp; b&nbsp;&nbsp;&nbsp;
 theta&nbsp;&nbsp;&nbsp; fwhm&nbsp;&nbsp;&nbsp; flag</i></b></div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp; avec&nbsp;&nbsp;&nbsp;&nbsp; 
 X2 : moment d'ordre 2 selon X</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 Y2 : moment d'ordre 2 selon Y</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 XY : moment d'ordre 2 selon X-Y</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 a : grand axe de l'ellipse repr&eacute;sentant au mieux l'objet</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 b : petit axe de l'ellipse repr&eacute;sentant au mieux l'objet</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 theta : angle de l'ellipse repr&eacute;sentant au mieux l'objet</div>
          
  <div style="line-height: 100%; margin-top: 0pt;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 flag : flag sextractor</div>
   </blockquote>
      
<h4> <a name="UNSMEARING"></a>1.3.17. Fonction UNSMEARING</h4>
      
<ul>
  Effectue une correction de tra&icirc;n&eacute;e (deconvflat) dans le cas
 d'une image effectu&eacute;e avec une cam&eacute;ra sans obturateur. Pour
 ce faire, indiquer la valeur du rapport de lecture (en g&eacute;n&eacute;ral 
 proche de 0.0005) dans le param&egrave;tre [unsmearing]. Cette correction 
 doit &ecirc;tre effectu&eacute;e apr&egrave;s correction du bias et du dark.
 
</ul>
      
<h4> <a name="INVERT"></a>1.3.18. Fonction INVERT</h4>
      
<ul>
  Echange les pixels de l'image en fonction de l'option pr&eacute;cis&eacute;e 
 :       
  <ul>
  MIRROR : l'image est invers&eacute;e gauche droite.           
    <p>FLIP : l'image est invers&eacute;e haut bas. </p>
           
    <p>XY : l'image est transpos&eacute;e (&eacute;change des lignes et des 
 colonnes).</p>
       
  </ul>
   Les mots cl&eacute; d'astrom&eacute;trie (WCS), &eacute;ventuellement
pr&eacute;sents  dans l'en-t&ecirc;te Fits, sont modifi&eacute;s en cons&eacute;quence.
 
</ul>
      
<h4> <a name="CONV"></a>1.3.19. Fonction CONV</h4>
      
<ul>
  Convolution d'image par un filtre de type d&eacute;termin&eacute; par [kernel_type]
 :       
  <ul>
  GAUSSIAN : pour un filtre gaussien.           
    <p>MEXICAN : pour une ondelette de type chapeau mexicain. </p>
           
    <p>MORLET : pour une ondelette de type Morlet.  <br>
     </p>
       
  </ul>
     
</ul>
      
<ul>
  La largeur des filtres est d&eacute;termin&eacute;e par la valeur de l'option
 [sigma]. Si ce param&egrave;tre n'est pas pr&eacute;cis&eacute;, sigma sera
 d&eacute;termin&eacute;e &agrave; partir de la valeur associ&eacute;e au
mot cl&eacute; FWHM de l'en-t&ecirc;te de l'image (sigma = fwhm * 0.601).
 Si le mot cl&eacute; FWHM n'est pas trouv&eacute; dans l'en-t&ecirc;te,
la valeur de sigma, par d&eacute;faut, vaut 2 pixels.  
</ul>
      
<h4> <a name="SUBDARK"></a>1.3.20. Fonction SUBDARK</h4>
      
<blockquote>Soustraction d'un dark de temps de pose diff&eacute;rent des images
brutes. Le nom du dark est [dark] et celui du bias est [bias]. Si [exptime]
est le temps d'int&eacute;gration des images et [dexptime] le temps d'exposition
du dark, le dark est corrig&eacute; du rapport de ces valeurs. Si [exptime]
et [dexptime] sont des cha&icirc;nes de caract&egrave;res, alors la valeur
des temps d'int&eacute;gration sera recherch&eacute;e comme la valeur de
ces mots cl&eacute;.</blockquote>
      
<blockquote>Par d&eacute;faut, [exptime]="EXPTIME" et [dexptime]="EXPTIME". 
      
  <p>A la suite des corrections pr&eacute;c&eacute;dentes, il est possible 
 d'effectuer une correction de tra&icirc;n&eacute;e (deconvflat) dans le cas
d'une image effectu&eacute;e avec une cam&eacute;ra sans obturateur. Pour
ce faire, indiquer la valeur du rapport de lecture (en g&eacute;n&eacute;ral 
 proche de 0.0005) dans le param&egrave;tre [unsmearing].</p>
  </blockquote>
      
<h4> <a name="RGRADIENT"></a>1.3.21. Fonction RGRADIENT</h4>
      
<blockquote>Effectue un gradient rotationnel, centr&eacute; sur la position 
 pixel d&eacute;finie par [xcenter] [ycenter]. Le gradient a pour param&egrave;tre 
 radial [radius] (en pixel) et pour param&egrave;tre angulaire [angle] (en 
 degr&eacute;s).</blockquote>
      
<h4> <a name="ROT"></a>1.3.22. Fonction ROT</h4>
      
<blockquote>Effectue une rotation d'un [angle] (en degr&eacute;s) autour du
point d&eacute;fini par les coordonn&eacute;es [x0] [y0]. Les mots cl&eacute; 
 d'astrom&eacute;trie (WCS), &eacute;ventuellement pr&eacute;sents dans l'en-t&ecirc;te
 Fits, sont modifi&eacute;s en cons&eacute;quence.</blockquote>
      
<h4> <a name="BINX"></a>1.2.23. Fonction BINX</h4>
      
<blockquote>Attribue, &agrave; chaque ligne, une valeur constante &eacute;gale 
 &agrave; la somme de tous les pixels de cette ligne entre les pixels [x1] 
 et [x2]. L'image finale comporte [width] colonnes (20 par d&eacute;faut).</blockquote>
      
<h4> <a name="BINY"></a>1.2.24. Fonction BINY</h4>
      
<blockquote>Attribue, &agrave; chaque colonne, une valeur constante &eacute;gale 
 &agrave; la somme de tous les pixels de cette colonne entre les pixels [y1]
 et [y2]. L'image finale comporte [height] colonnes (20 par d&eacute;faut).</blockquote>
      
<h4> <a name="PROFILE"></a>1.2.25. Fonction PROFILE</h4>
      
<blockquote>Extrait la valeur num&eacute;rique des pixels d'une ligne ou d'une
colonne dans un fichier texte [filename]. [direction]=x ou y respectivement 
 pour effectuer le profil selon les lignes ou les colonnes. [offset] repr&eacute;sente 
 le num&eacute;ro de ligne ou de colonne sur lequel sera effectu&eacute; le
profil. Si [direction]=x, alors [offset] peut &ecirc;tre compris entre 1
et le nombre de colonnes. Si [direction]=y, alors [offset] peut &ecirc;tre 
 compris entre 1 et le nombre de lignes.</blockquote>
      
<h4> <a name="MATRIX"></a>1.2.26. Fonction MATRIX</h4>
      
<blockquote>Extrait une fen&ecirc;tre [x1] [x2] [y1] [y2] de l'image et &eacute;crit
 les valeurs de ces pixels dans un fichier texte [filematrix]. L'image de
sortie est la m&ecirc;me que celle d'entr&eacute;e.</blockquote>
      
<h4> <a name="WINDOW"></a>1.2.27. Fonction WINDOW</h4>
      
<blockquote>Extrait une image de sortie dans la fen&ecirc;tre [x1] [x2] [y1]
 [y2] de l'image d'entr&eacute;e.</blockquote>
      
<h4> <a name="LOG"></a>1.2.28. Fonction LOG</h4>
      
<blockquote>Effectue une op&eacute;ration math&eacute;matique de logarithme 
 selon la formule :</blockquote>
      
<blockquote>[coeff] *log10(value-[offsetlog])       
  <p>La valeur [nullpixel] (z&eacute;ro par d&eacute;faut) appara&icirc;t 
 lorsque (value-[offsetlog]) est n&eacute;gatif (log non d&eacute;fini).</p>
  </blockquote>
      
<h4> <a name="MEDIANX"></a>1.2.29. Fonction MEDIANX</h4>
      
<blockquote>Attribue, &agrave; chaque ligne, une valeur constante &eacute;gale 
 &agrave; la m&eacute;diane de tous les pixels de cette ligne entre les pixels
 [x1] et [x2]. L'image finale comporte [width] colonnes (20 par d&eacute;faut).</blockquote>
      
<h4> <a name="MEDIANY"></a>1.2.30. Fonction MEDIANY</h4>
      
<blockquote>Attribue, &agrave; chaque colonne, une valeur constante &eacute;gale 
 &agrave; la m&eacute;diane de tous les pixels de cette colonne entre les 
pixels [y1] et [y2]. L'image finale comporte [height] colonnes (20 par d&eacute;faut).</blockquote>
      
<h4> <a name="REC2POL"></a>1.2.31. Fonction REC2POL</h4>
      
<blockquote>Projection polaire centr&eacute;e en [y0] [x0] de l'image d'entr&eacute;e. 
 Par d&eacute;faut, les axes polaires ont 1degr&eacute;/pix pour l'angle et
1 pix/pix pour l'&eacute;loignement. Il est possible de modifier ces valeurs
 en utilisant les facteurs d'&eacute;chelle [scale_theta] [scale_rho].</blockquote>
      
<h4> <a name="POL2REC"></a>1.2.32. Fonction POL2REC</h4>
      
<blockquote>Projection cart&eacute;sienne centr&eacute;e en [y0] [x0] &agrave; 
 partir de l'image d'une projection polaire. Il est possible de modifier les
valeurs des facteurs d'&eacute;chelle [scale_theta] [scale_rho]. Enfin, [width]
et [height] sont les largeur et hauteur de l'image finale.</blockquote>
      
<h4> <a name="HOUGH"></a>1.2.33 Fonction HOUGH</h4>
      
<blockquote>Transform&eacute;e de Hough. Chaque point de l'image, sup&eacute;rieur 
 &agrave; [threshold] (=0 par d&eacute;faut), est repr&eacute;sent&eacute;, 
 dans l'espace de Hough (T, R) par une sinuso&iuml;de d'intensit&eacute; I,
d'&eacute;quation R = y*sin(T) - x*cos(T) avec -90&lt;=T&lt;90. La valeur 
 R=0 est situ&eacute;e &agrave; la ligne telle que y=naxis2/2 et la valeur 
 T=0 est situ&eacute;e &agrave; la colonne x=naxis1/2 (T=0, R=0 est donc au
milieu de l'image). L'&eacute;chelle de T vaut 1 degr&eacute; par pixel (R
est en pixel de l'image initiale). I vaut 1 si on a pr&eacute;cis&eacute; 
 [binary] sinon il vaut la valeur d'intensit&eacute; du pixel de l'image initiale.
La transform&eacute;e de Hough permet de rep&eacute;rer la position de pixels
align&eacute;s (tra&icirc;n&eacute;e de smearing, satellite, avion, etc.).</blockquote>
      
<h4> <a name="BACK"></a>1.2.34. Fonction BACK</h4>
      
<blockquote>Synth&eacute;tise une image du fond de ciel. L'image est d'abord 
 d&eacute;coup&eacute;e en pav&eacute;s carr&eacute;s de c&ocirc;t&eacute; 
 [back_kernel] (=8 par d&eacute;faut) pixels. Dans chaque carr&eacute; est 
 calcul&eacute;e la valeur du fond de ciel en prenant la fraction [back_threshold] 
 (=0.1 par d&eacute;faut) des valeurs de pixels tri&eacute;s dans l'ordre 
d'intensit&eacute; croissante (back_threshold=0 pour ne prendre que les valeurs 
minimales et =1 pour les valeurs maximales).</blockquote>
      
<blockquote>Ajouter [sub] sans argument si l'on souhaite obtenir directement 
 le r&eacute;sultat de la soustraction du fond &agrave; l'image initiale (une
valeur constante &eacute;gale &agrave; la moyenne du fond synth&eacute;tique 
 est ajout&eacute;e au r&eacute;sultat de fa&ccedil;on &agrave; retrouver 
la dynamique initiale).       
  <p>Ajouter [div] sans argument si l'on souhaite obtenir directement le r&eacute;sultat
de la division du fond &agrave; l'image initiale (une valeur constante &eacute;gale
&agrave; la moyenne du fond synth&eacute;tique est multipli&eacute;e au r&eacute;sultat
de fa&ccedil;on &agrave; retrouver la dynamique initiale).</p>
  </blockquote>
      
<h4> <a name="ASTROMETRY2"></a>1.2.35. Fonction ASTROMETRY2</h4>
      
<blockquote>Effectue l'astrom&eacute;trie de la m&ecirc;me mani&egrave;re 
 que ASTROMETRY mais calcule les coefficients de d&eacute;formation du second 
 ordre. ces coefficients sont cod&eacute;s par les mots cl&eacute;s FITS standards
PV* dans l'en-t&ecirc;te de l'image de sortie.</blockquote>
      
<h4> <a name="RESAMPLE"></a>1.2.36 Fonction RESAMPLE</h4>
      
<blockquote>Effectue une transformation lin&eacute;aire de type :</blockquote>
      
<blockquote>x_out = a[0]*x_in + a[1]*y_in + a[2] <br>
  y_out = a[3]*x_in + a[4]*y_in + a[5]       
  <p>La valeur des coefficients a[0] &agrave; a[5] est cod&eacute;e dans le
param&egrave;tre [paramresample] sous la forme de la suite des coefficients 
 0 &agrave; 5. Par exemple, pour effectuer une r&eacute;duction homog&egrave;ne 
 de l'image d'un facteur 2, on &eacute;crira : </p>
       
  <p>IMA/SERIES ... RESAMPLE "paramresample=0.5 0 0 0 0.5 0" </p>
       
  <p>Par d&eacute;faut, l'int&eacute;grale du flux est conserv&eacute;e (par 
 exemple, si l'image est dilat&eacute;e d'un facteur deux sur les deux axes, 
 sa dynamique sera r&eacute;duite d'un facteur quatre). Pour imposer une normalisation
autre du flux, utiliser le param&egrave;tre [normaflux]. Par exemple, pour
garder la dynamique originelle, utiliser normaflux=1. </p>
       
  <p>Les mots cl&eacute; d'astrom&eacute;trie (WCS), &eacute;ventuellement 
 pr&eacute;sents dans l'en-t&ecirc;te Fits, sont modifi&eacute;s en cons&eacute;quence 
 de la transformation g&eacute;om&eacute;trique.</p>
  </blockquote>
      
<h4> <a name="CUTS"></a>1.2.37 Fonction CUTS</h4>
      
<blockquote>Calcule les seuils de visualisation de l'image par analyse de
 l'histogramme. La valeur des seuils est compl&eacute;t&eacute;e dans l'en-t&ecirc;te
 FITS. Le mot cl&eacute; correspondant au seuil haut est d&eacute;finit par
 [hicut] (MIPS-HI par d&eacute;faut) et celui du seuil bas est d&eacute;finit
 par [locut] (MIPS-LO par d&eacute;faut). Le type de valeur pour l'en-t&ecirc;te
 FITS est donn&eacute;e par [keytype] et peut valoir INT, FLOAT ou STRING
(INT par d&eacute;faut). Par exemple :</blockquote>
      
<blockquote>IMA/SERIES ... CUTS hicut=SH locut=SB keytype=FLOAT       
  <p>Les param&egrave;tres [lofrac] et [hifrac] servent &agrave; fixer la 
 fraction de l'histogramme o&ugrave; seront calcul&eacute;s les seuils. [lofrac]
 (=0.05 par d&eacute;faut) est la fraction pour le seuil bas et [lofrac]
(=0.05  par d&eacute;faut) est la fraction pour le seuil haut. ces valeurs
peuvent  varier de 0 &agrave; 1. </p>
       
  <p>Le param&egrave;tre [cutscontrast] (=1 par d&eacute;faut) sert &agrave; 
 adoucir le contraste. Plus sa valeur est grande, plus doux sera le contraste. 
 La valeur doit &ecirc;tre une quantit&eacute; r&eacute;elle positive ou nulle.
   </p>
       
  <p>La m&eacute;thode de calcul de la fonction CUTS fourni un r&eacute;sultat 
 bien plus rapide que le calcul des seuils par la fonction STAT. Cependant, 
 la qualit&eacute; du calcul est un peu meilleure pour la fonction STAT que
 l'on pr&eacute;f&eacute;rera pour des petites images (inf&eacute;rieures 
&agrave; 500x500 typiquement). La fonction CUTS pr&eacute;sente un grand int&eacute;r&ecirc;t
sur les grandes images car seuls 100 000 points servent au calcul. Le temps
de calcul est donc le m&ecirc;me quelque soit la taille de l'image (alors
qu'il peu devenir long pour la fonction STAT).</p>
  </blockquote>
      
<h4> <a name="MULT"></a>1.3.38. Fonction MULT</h4>
      
<ul>
  Multiplication de la valeur de tous les pixels par une constante d&eacute;finie 
 par l'argument de [constant].  
</ul>
      
<h4> <a name="SORTX"></a>1.2.39. Fonction SORTX</h4>
      
<blockquote>Attribue, &agrave; chaque ligne, une valeur constante &eacute;gale 
 &agrave; la valeur tri&eacute;e &agrave; [percent] (=50 pour la m&eacute;diane, 
 =100 pour le maximum) de tous les pixels de cette ligne entre les pixels 
[x1] et [x2]. L'image finale comporte [width] colonnes (20 par d&eacute;faut).</blockquote>
      
<h4> <a name="SORTY"></a>1.2.40. Fonction SORTY</h4>
      
<blockquote>Attribue, &agrave; chaque colonne, une valeur constante &eacute;gale 
 &agrave; la valeur tri&eacute;e &agrave; [percent] (=50 pour la m&eacute;diane, 
 =100 pour le maximum)&nbsp; de tous les pixels de cette colonne entre les 
 pixels [y1] et [y2]. L'image finale comporte [height] colonnes (20 par d&eacute;faut).</blockquote>
      
<h1> 2. Exemples de scripts</h1>
   Nous allons &eacute;tudier ici quelques cas classiques de traitement d'images 
 astronomiques.   
<h2> 2.1. Pr&eacute;traitement des images CCD</h2>
   Le pr&eacute;traitement des images consiste &agrave; soustraire le dark 
aux images brutes puis de diviser par le flatfield. <br>
  Tout cet exemple traite des images acquises suivantes :   
<ul>
  images de bias : de bias-1.fit &agrave; bias-9.fit dans le chemin ./bias 
      
  <p>images de dark : de dark-1.fit &agrave; dark-9.fit dans le chemin ./dark 
   </p>
       
  <p>images de flat : de flat-1.fit &agrave; flat-9.fit dans le chemin ./flat 
   </p>
       
  <p>images &agrave; pr&eacute;traiter : de sky-1.fit &agrave; sky-9.fit dans
le chemin ./sky</p>
   
</ul>
   Nous allons d'abord pr&eacute;parer des images synth&eacute;tiques de
bias,  dark et flat, r&eacute;sultant d'empilements, afin d'att&eacute;nuer
le bruit. Enfin, nous allons pr&eacute;traiter les images en utilisant la
m&eacute;thode  de l'optimisation du thermique. Les images pr&eacute;trait&eacute;es
seront  plac&eacute;es dans le chemin ./prt   
<h3> 2.1.1. Pr&eacute;paration du bias</h3>
   Le bias est une image de tr&egrave;s court temps d'int&eacute;gration, 
obtenue dans le noir absolu. Le pr&eacute;traitement propos&eacute; consiste 
&agrave; faire une pile m&eacute;diane : IMA/STACK ./bias/ bias- 1 9 .fit 
./bias/ bias . .fit MED   
<h3> 2.1.2. Pr&eacute;paration du dark</h3>
   Le dark est une image de temps d'int&eacute;gration proche de celui des 
images sky, obtenue dans le noir absolu. Le pr&eacute;traitement propos&eacute; 
consiste &agrave; faire une pile m&eacute;diane : IMA/STACK ./dark/ dark- 
1 9 .fit ./dark/ dark . .fit MED   
<h3> 2.1.3. Pr&eacute;paration du flat</h3>
   Le bias est une image obtenue sur une surface lumineuse la plus uniforme 
 possible. Le pr&eacute;traitement propos&eacute; consiste &agrave; faire 
une correction de dark, suivie d'une normalisation en gain et d'une pile m&eacute;diane.SET/VAR
$smearing 0 <br>
  IMA/SERIES ./flat/ flat- 1 9 .fit ./flat/ f . .fit OPT bias=./bias/bias.fit 
 dark=./dark/dark.fit unsmearing=$smearing <br>
  IMA/SERIES ./flat/ f- 1 9 .fit ./flat/ f . .fit NORMGAIN normgain_value=10000 
 <br>
  IMA/STACK ./flat/ f- 1 9 .fit ./flat/ flat . .fit MED <br>
  IMA/SERIES ./flat/ f- 1 9 .fit . . . .fit DELETE   
<p>Si les images ont &eacute;t&eacute; obtenues avec un obturateur, la valeur
 de $smearing doit &ecirc;tre &eacute;gale &agrave; z&eacute;ro. Avec des
images obtenues sans obturateur, il est n&eacute;cessaire de placer une valeur
non nulle &agrave; $smearing. </p>
   
<h3> 2.1.4. Pr&eacute;traitement des images brutes</h3>
   SET/VAR $sky sky <br>
  SET/VAR $smearing 0 <br>
  IMA/SERIES ./sky/ $sky- 1 9 .fit ./prt/ i . .fit OPT bias=./bias/bias.fit 
 dark=./dark/dark.fit unsmearing=$smearing <br>
  IMA/SERIES ./prt/ i- 1 9 .fit ./prt/ i . .fit DIV file=./flat/flat.fit
constant=10000  <br>
  IMA/SERIES ./prt/ i- 1 9 .fit ./prt/ i . .fit NORMOFFSET normoffset_value=200 
 skylevelSi les images ont &eacute;t&eacute; obtenues avec un obturateur, 
la valeur de $smearing doit &ecirc;tre &eacute;gale &agrave; z&eacute;ro. 
Avec des images obtenues sans obturateur, il est n&eacute;cessaire de placer 
une valeur non nulle &agrave; $smearing.   
<h3> 2.1.5. Registration et empilement des images pr&eacute;trait&eacute;es</h3>
   SET/VAR $sky sky <br>
  IMA/SERIES ./prt/ i- 1 9 .fit ./prt/ i . .fit STAT objefile=./prt/x$sky.fit 
 <br>
  IMA/SERIES ./prt/ i- 1 9 .fit ./prt/ i . .fit REGISTER translate=before 
nullpixel=-1000  <br>
  IMA/STACK ./prt/ i- 1 9 .fit ./prt/ $sky . .fit MED nullpixel=-1000 <br>
  IMA/SERIES ./prt/ i- 1 9 .fit . . . .fit DELETE <br>
  IMA/SERIES ./prt/ x$sky . . .fit . . . .fit DELETE   
<h3> 2.1.6. Mise en forme de l'image pr&eacute;trait&eacute;e</h3>
   SET/VAR $sky sky <br>
  IMA/SERIES ./prt/ $sky . . .fit ./prt/ $sky . .fit STAT fwhm jpegfile=./prt/$sky.jpg 
  
<h2> 2.2. Calibration astrom&eacute;trique d'une image pr&eacute;trait&eacute;e</h2>
   IMA/SERIES ./prt/ $sky . . .fit ./prt/ $sky . .fit STAT objefile=./prt/x$sky.fit 
 <br>
  IMA/SERIES ./prt/ $sky . . .fit ./prt/ $sky . .fit CATCHART path_astromcatalog=/cdrom/&nbsp; 
 astromcatalog=Microcat catafile=./prt/c$sky.fit <br>
  IMA/SERIES ./prt/ $sky . . .fit ./prt/ $sky . .fit ASTROMETRY <br>
  IMA/SERIES ./prt/ $sky . . .fit ./prt/ $sky . .fit CATCHART path_astromcatalog=/cdrom/&nbsp; 
 astromcatalog=Microcat catafile=./prt/c$sky.fit jpegfile_chart2=./prt/$skyb.jpg 
 <br>
  IMA/SERIES ./prt/ x$sky . . .fit . . . .fit DELETE <br>
  IMA/SERIES ./prt/ c$sky . . .fit . . . .fit DELETE <br>
  &nbsp; <br>
  &nbsp;   
<p><!-- #BeginLibraryItem "/11/Library/MAJ%20AK.lbi" --><i><font
 size="-1">Cette page est tenue &agrave; jour par Alain Klotz.</font></i><!-- #EndLibraryItem --> 
 <br>
     <!-- #BeginLibraryItem "/11/Library/Date%20MAJ.lbi" --><i><font
 size="-1">Derni&egrave;re mise &agrave; jour le :&nbsp;<!-- #EndLibraryItem -->15/11/2002
  <!-- #BeginLibraryItem "/12/Library/barre de nav du bas.lbi" --> </font></i></p>
   
<div align="center"> <i><font size="-1">    
<table width="60%" border="0" cellspacing="0" cellpadding="0">
       <tbody>
      <tr>
          <td>               
      <p align="center"><font
 face="Verdana, Arial, Helvetica, sans-serif" size="2"><a
 href="index.htm">Accueil</a>            | <a href="copi.htm">Copies d'&eacute;crans</a>
 | <a href="telecha.htm">T&eacute;l&eacute;charger</a>            | <a
 href="plan.php">Plan du site</a> | <a href="interfa.htm">Interface     
      standard</a> | <a href="theme.htm">Observations &agrave; th&egrave;mes</a>
            | <a href="script.htm">Scripts</a> | <a href="extensio.htm">Extensions</a>
            | <a href="faq.htm">FAQ</a> | <a href="quiveu.htm">Qui veut aider
            ?</a> | <a href="liens.htm">Liens</a> | <a href="bug.php">Suivi
            des bugs</a> | <a href="followup.php">Suivi des scripts</a></font></p>
               
      <p align="center">&nbsp;</p>
        </td>
      </tr>
           
  </tbody>  
</table>
  </font></i></div>
  <!-- #EndLibraryItem --><i><font size="-1"><br>
   <!-- #BeginLibraryItem "/12/Library/Copyright.lbi" --> </font></i>  
<div align="center"><i><font size="-1"><b><font size="1">Copyright &copy;
 AUDELA</font></b></font></i></div>
  <!-- #EndLibraryItem --><i><font size="-1">  </font></i>  
<p><i><font size="-1">  </font></i></p>
  <br>
  <br>
 <br>
</body>
</html>
