<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>BifsConv: Le convertisseur d'images vers FITS / The to-FITS image converter</title>
</head>
<body>
<p class="date">Date de mise &agrave; jour : 08 novembre 2008</p>
<center>
  <h1>BifsConv <br />
    Le convertisseur d'images vers FITS <br />
    The to-FITS image converter</h1>
  Raoul Behrend <br />
  Observatoire de Gen&egrave;ve <br />
  CH-1290 Sauverny - Suisse <br />
  <a href="mailto:Raoul.Behrend@unige.ch">Raoul.Behrend@unige.ch</a>
</center>
<table>
  <tr>
    <td><b>BifsConv, qu'est-ce&nbsp;?</b>
      <p>Un logiciel permettant de convertir vers le format FITS (fit)
         divers formats d'image, tels que:</p></td>
    <td><b>BifsConv, what is it&nbsp;?</b>
      <p>This software is a to-FITS (fit) image converter;
         it accepts images in various formats like:</p>
    </td>
  </tr>
  <tr>
    <td> bmp, imq, st4, stx,
      ima, cpa, pic,
      tif, tiff, nef,
      mmf, mrw, dng,
      gif, mx5,
      hx5 (660x500), xl8 (510x500), sxl (510x512),
      dat, pcx, per,
      dib, arn, blu,
      bb1, bb2,
      bb3, bb4, grn,
      irq, ibg, img,
      ir1, ir2,
      ir3, n07, n15,
      pds, red, ihw, sgr,
      sur, sun,
      vio, cpt, gls,
      fts, fits, ftz, at1,
      t1m,
      08b,
      raw, sbi, st5,
      st6, st7, st8,
      st9, 237,
      imi, ccd, tga,
      pnm, ppm, pbm,
      pgm, ras, cn1..cn9.
      Test: spe, cr2.</td>
    <td> bmp, imq, st4, stx,
      ima, cpa, pic,
      tif, tiff, nef,
      mmf, mrw, dng,
      gif, mx5,
      hx5 (660x500), xl8 (510x500), sxl (510x512),
      dat, pcx, per,
      dib, arn, blu,
      bb1, bb2,
      bb3, bb4, grn,
      irq, ibg, img,
      ir1, ir2,
      ir3, n07, n15,
      pds, red, ihw, sgr,
      sur, sun,
      vio, cpt, gls,
      fts, fits, ftz, at1,
      t1m,
      08b,
      raw, sbi, st5,
      st6, st7, st8,
      st9, 237,
      imi, ccd, tga,
      pnm, ppm, pbm,
      pgm, ras, cn1..cn9.
      Test: spe, cr2.</td>
  </td>
  <tr>
    <td> Quelques variantes et parfums ne sont toutefois pas traduits, par manque de documentation.
      Plus de probl&egrave;mes pour voir/travailler, avec son imageur astronomique favori, des images satellitales au format Titus,
      PDS (sauf les images Cl&eacute;mentine et quelques images de Mars Global Surveyor),
      VICAR, TIFF, celles de SBIG et Lumi&egrave;reStellaire, etc. Les fichiers FITS peuvent &ecirc;tre
      compress&eacute;s par les algorithmes Rice ou IHW.</td>
    <td> Some variants and flavours aren't translated, due to some undocumented things.
      No more problems viewing/working, with its favourite astronomical image processor, satellite images in Titus format,
      PDS (except the images by Clementine and a few by Mars Global Surveyor),
      VICAR, TIFF, SBIG's and StarLight's ones, etc. FITS files can be Rice or IHW compressed.</td>
  </tr>
  <tr>
    <td> Le logiciel ins&egrave;re automatiquement les dates d'observation et les caract&eacute;ristiques instrumentales
      disponibles dans certains formats; pour les autres, me contacter.
      <p>Au passage, BifsConv corrige certaines fautes
    dans le format FITS de certains logiciels (comme Meade, AstroArt, Pisco, Avi2Bmp).</p></td>
    <td> The software automatically inserts the observation date and the instrumental characteristics present in some format;
      for the other ones, feel free to contact me.
      <p> On the fly, BifsConv corrects some errors made by some FITS generating software
        (like Meade, AstroArt, Pisco, Avi2Bmp).</p>
  </td>
  </tr>
  <tr>
    <td><b>Utilisation</b></td>
    <td><b>Usage</b></td>
  </tr>
  <tr>
    <td> BIFSCONV &quot;image&quot; [=] [+] [Cr,v,b,a|R|V|B|A]
      [Zh,v] [Fz,s] [Ll] [M[H][MV]] [Ih,v,o [B|W|Q|S]] [HD|HM|HF|HO|HP|HQ|HR|Hs]
      [Xobs,con] [K[asc],[dec],[foc],[ph],[pv],[e/adu]] [Nn] [TW] [Y(:|+|=|-)c=v]
      [Mcccc[=]]</td>
    <td> BIFSCONV &quot;image&quot; [=] [+] [Cr,v,b,a|R|V|B|A]
      [Zh,v] [Fz,s] [Ll] [M[H][MV]] [Ih,v,o [B|W|Q|S]] [HD|HM|HF|HO|HP|HQ|HR|Hs]
      [Xobs,con] [K[asc],[dec],[foc],[ph],[pv],[e/adu]] [Nn] [TW] [Y(:|+|=|-)c=v]
      [Mcccc[=]]</td>
  </tr>
  <tr>
    <td> La premi&egrave;re option de lancement est toujours le nom du fichier &agrave; convertir.
      Les guillemets permettent d'utiliser des fichiers dont les noms comportent un ou plusieurs espaces (au plus un &agrave; la fois) - facultatifs pour les autres fichiers.
      Le fichier de sortie porte le m&ecirc;me nom et l'extension fit ou,
      si d&eacute;j&agrave; pr&eacute;sent et l'option = absente, est num&eacute;rot&eacute; <tt>bifs####.fit</tt>. <br />
      D'autres options (analys&eacute;es de gauche &agrave; droite) sont possibles/n&eacute;cessaires/sans utilit&eacute; selon le type de fichier d'images &agrave; convertir:
      <ul>
        <li>Pour les images en couleur, Cr,v,b,a donnent la pond&eacute;ration du rouge, du vert, du bleu et du canal de transparence.

          R|V|B|A s&eacute;lectionne rapidement une composante.</li>
        <li>Zh,v donne les facteurs de compactage des pixels horizontalement et verticalement.</li>
        <li>M[H][V]retournent horizontalement et verticalement l'image.</li>
        <li>Fz,s impose l'&eacute;quivalent de bzero et bscale des images fit, pour certains formats.</li>
        <li>Ih,v,o donne les dimensions horizontale et verticale des images,
          ainsi que la taille en octets de l'ent&ecirc;te &agrave; sauter; pour certains formats, on peut mettre une des dimensions &agrave; z&eacute;ro
          et laisser le logiciel la recalculer &agrave; partir de la taille du fichier.

          B|W|Q signifie que les donn&eacute;es sont
          cod&eacute;es sur 1, 2 ou 4 octets; S demande l'&eacute;change de l'ordre des octets.</li>
        <li>HD|HM|HF demande d'interpr&eacute;ter les &eacute;ventuels instants marqu&eacute;s
          dans l'image originale comme &eacute;tant le d&eacute;but, le milieu ou la fin de l'exposition.

          Hs donne une correction en secondes &agrave; appliquer au temps ci-dessus.</li>
        <li>Xobs,con charge les caract&eacute;ristiques d'une configuration instrumentale d'un observatoire particulier; me contacter pour cela.
          Actuellement définis: 143, 174, 175,1, 175,2, 178, 178,1, 178,2, 178,3, 178,4, 188, 517, 586, 596, 620,1, 620,2, 644,
          743, 809,1, 809,2, 950, 999, A12,1, A12,2, A55, H63,1, H63,2.
          Les valeurs de cette option priment sur celles de l'ent&ecirc;te originale et celles du logiciel.</li>
        <li>K[asc],[dec],[foc],[ph],[pv],[e/adu]
          permet de marquer et de corriger la positition vis&eacute;e par le t&eacute;lescope (hh.mmsss et &plusmn;&deg;&deg;.''&quot;&quot;), sa focale &eacute;quivalente (en mm),
          ainsi que les dimensions logiques (&eacute;galement en mm) des pixels de la cam&eacute;ra (tenir compte du compactage) et du gain
          de la cam&eacute;ra. Si sp&eacute;cifi&eacute;es, ces valeurs priment sur celles de l'ent&ecirc;te originale et celles en mémoire.

          Nn o&ugrave; n=1..2 permet d'&eacute;crire les coordonn&eacute;es du centre du champ dans
          le dialecte <i>non-standard</i> de Astrometrica et PinPoint.</li>
        <li>+ permet d'acc&eacute;der aux enregistrements d'ing&eacute;ni&eacute;rie des images des sondes spaciales.</li>
        <li>TW impose une sortie sur 16 binons, m&ecirc;me si c'est possible en 8 binons.</li>
        <li>Y(:|+|=|-)c=v permet de remplacer ou ajouter, ajouter, remplacer ou supprimer une cl&eacute; c et sa valeur
          v de l'ent&ecirc;te du fichier de sortie - maximum 16 cl&eacute;s.</li>
      </ul></td>
    <td> The first parameter is always the name of the file to be converted.
      The quotations marks permit to use files with names containing one or more spaces (but one at a time) - facultative for other files.
      The ouput file has the same name and fit as the extension or, if already present and that the

      = option is absent, is numbered <tt>bifs####.fit</tt>. <br />
      Other options (processed from left to right) are possible/needed/useless depending on the type of the image file to be converted:
      <ul>
        <li>For colour pictures, Cr,v,b,a gives the weigthening of red, green, blue and transparency channels.
          R|V|B|A select more easily a specific channel.</li>
        <li>Zh,v represents the horizontal and vertical binning factors.</li>
        <li>M[H][V]mirror horizontaly and verticaly the image.</li>
        <li>Fz,s fixes bzero and bscale in the same manner as for fit images, for some formats.</li>
        <li>Ih,v,o imposes horizontal and vertical dimensions of the image to be converted, as well as the
          size in bytes of the skipped header; for some formats, one can give 0 for one of the sizes and the software will compute the real
          value from the filesize. B|W|Q specify that the data are coded on 1, 2 or 4 bytes;
          S swaps low and high bytes.</li>
        <li>HD|HM|HF says that the time, if present in the original file, is for the beggining, middle or end of exposure.
          Hs specify a correction in seconds to the previous time.</li>
        <li>Xobs,con specify the default instrumental parameters for the configurattion of a particular observatory; contact me for details.
          Actually defined: 143, 174, 175,1, 175,2, 178,1, 178,2, 188, 517, 586, 596, 620,1, 620,2, 644,
          743, 809,1, 809,2, 950, 999, A12,1, A12,2, A55, H63,1, H63,2.
          The values from the option overread the ones in the original header or in memory.</li>
        <li>K[asc],[dec],[foc],[ph],[pv],[e/adu]
          is an easy way to specify and correct the pointing direction of the telescope (as hh.mmsss and &plusmn;&deg;&deg;.''&quot;&quot;), its equivalent focal length (in mm),
          and the sizes (also in mm) of the logical pixels of the CCD camera (keep in mind the binning factors), and the gain of the camera.
          These values, if specified, overread the ones in the original header or in the software.
          Nn with n=1..2 permits to write the coordinates of the center of the field
          in the <i>non-standard</i> dialect of Astrometrica and PinPoint.</li>
        <li>+ gives access to the engineering records of spacecraft images.</li>
        <li>TW specify to output file to be on 16 bits, even if it is possible with 8 bits.</li>
        <li>Y(:|+|=|-)c=v allows the software to change or add, add, change, erase
          a key c and its value v in the output file - at most 16 keys.</li>
      </ul>
  </td>
  </tr>
  <tr>
    <td><i>Attention</i>: l'option = autorise le logiciel &agrave; &eacute;craser un fichier avec l'extension fit.
      A n'utiliser que si vous avez sauvegard&eacute; vos images originales dans un autre r&eacute;pertoire/disque&nbsp;! Je d&eacute;cline toutes responsabilit&eacute;s.</td>
    <td><i>Caution</i>: the = option authorize the software to overwrite a file with a fit extension.
      Use it only if you have copied your original images in a different directory/disc&nbsp;! I decline all responsibilities.</td>
  </tr>
  <tr>
    <td><b>Exemple</b></td>
    <td><b>Example</b></td>
  </tr>
  <tr>
    <td><tt>bifsconv 12222001.fts = k12.42201,-4.3327,666.7,0.0148,0.0148 &quot;y:object='2003 EM1'&quot;</tt></td>
    <td><tt>bifsconv 12222001.fts = k12.42201,-4.3327,666.7,0.0148,0.0148 &quot;y:object='2003 EM1'&quot;</tt></td>
  </tr>
  <tr>
    <td> charge l'image <tt>12222001.fts</tt> puis cr&eacute;e <tt>12222001.fit</tt> ;
      si cette derni&egrave;re existe d&eacute;j&agrave;, elle est &eacute;cras&eacute;e (option =).
      La position asc=12<sup>h</sup>42<sup>m</sup>20,1<sup>s</sup> dec=-4&deg;33'27&quot; est ins&eacute;r&eacute;e
      dans l'ent&ecirc;te. La longueur focale &eacute;quivalente de l'instrument est de 666,7mm; les pixels font
      0,0148x0,0148mm. Si une cl&eacute; OBJECT existe, sa valeur est chang&eacute;e &agrave; '2003 EM1'; sinon, elle est cr&eacute;&eacute;e.</td>
    <td> reads the image <tt>12222001.fts</tt> and create a file named <tt>12222001.fit</tt> ;
      if this file already exists, it is overwritten (= option).
      The coordinates RA=12<sup>h</sup>42<sup>m</sup>20.1<sup>s</sup> and DEC=-4&deg;33'27&quot; are added
      in the header. The equivalent focal length is 666.7mm; the pixels are sized 0.0148x0.0148mm.
      If there exists an OBJECT key, its value is changed to '2003 EM1', else it's created.</td>
  </tr>
  <tr>
    <td><b>Astuces</b>
      <ul>
        <li>Pour convertir du FITS en FITS, commencer par renommer les images avec une extension fts.</li>
        <li>Les images Mariner 10 doivent &ecirc;tre renom&eacute;es avec l'extension vic - ou une autre de la s&eacute;rie PDS.</li>
        <li>Pour convertir les images du programme International Halley Watch au PDS, il faut mettre bout &agrave; bout
          l'ent&ecirc;te hdr (respectivement lbl) au corps imq et placer le tout
          dans un fichier fts (respectivement ihw); effacer ensuite le fichier imq.
          Parfois, les ent&ecirc;tes hdr et lbl n'ont pas le m&ecirc;me contenu informatif - il faut
          essayer les deux mani&egrave;res pour savoir quelle est la meilleure. <br />
          Exemple dans lequel &quot;a&quot; est le nome de l'image (sans extension):</li>
      </ul></td>
    <td><b>Tricks</b>
      <ul>
        <li>To convert from FITS to FITS, rename your images with a fts extension.</li>
        <li>Mariner 10's images must be renamed with a vic extension - or an other PDS-like extension.</li>
        <li>To convert images from the International Halley Watch program at PDS, first append the hdr (respectively lbl) header and the
          imq content in a fts (respectively ihw) file; then erase the imq file.
          Sometimes, the hdr and lbl headres don't have the same information contents - do a try of both manners to select the best one. <br />
          Example where &quot;a&quot; is the name of the image (without extension):</li>
      </ul>
  </td>
  </tr>
  <tr>
    <td> ms-dos: <tt>copy /b a.hdr+a.imq a.fts</tt> <br />
      ou: <tt>copy /b a.lbl+a.imq a.ihw</tt> <br />
      linux: <tt>cat a.hdr a.imq &gt; a.fts</tt> <br />
      ou: <tt>cat a.lbl a.imq &gt; a.ihw</tt></td>
    <td> ms-dos: <tt>copy /b a.hdr+a.imq a.fts</tt> <br />
      or: <tt>copy /b a.lbl+a.imq a.ihw</tt> <br />
      linux: <tt>cat a.hdr a.imq &gt; a.fts</tt> <br />
      or: <tt>cat a.lbl a.imq &gt; a.ihw</tt></td>
  </tr>
  <tr>
    <td> Sous DOS/Windows, il faut commencer par ouvrir une fen&ecirc;tre ms-dos. Apr&egrave;s quoi, la commande</td>
    <td> In DOS/Windows, first open a ms-dos box. Then, the command</td>
  </tr>
  <tr>
    <td><tt>for %f in (*.*) do bifsconv &quot;%f&quot; =</tt></td>
    <td><tt>for %f in (*.*) do bifsconv &quot;%f&quot; =</tt></td>
  </tr>
  <tr>
    <td> convertit toutes les images reconnues d'un r&eacute;pertoire. Cette commande
      marche en ligne de commande; en fichier de commande, il faut remplacer % par %%. On peut aussi assigner un bouton de la souris pour convertir
      une image depuis l'explorateur, avec l'action suivante:</td>
    <td> converts all recognised images from a directory. This command works as a command line;
      in a batch file, replace % by %%. To convert a file using the explorer, one can also assign a mouse-button to the following action:</td>
  </tr>
  <tr>
    <td><tt>bifsconv &quot;%1&quot; =</tt></td>
    <td><tt>bifsconv &quot;%1&quot; =</tt></td>
  </tr>
  <tr>
    <td> Sous Linux, la conversion en bloc s'obtient avec</td>
    <td> With Linux, the in-mass conversion is obtained by</td>
  </tr>
  <tr>
    <td><tt>find . -name '*.*' -exec bifsconv &quot;{}&quot; = \;</tt> <br />
      ou<br />
      <tt>for i in *.* ; do bifsconv &quot;$i&quot; = ; done</tt></td>
    <td><tt>find . -name '*.*' -exec bifsconv &quot;{}&quot; = \;</tt> <br />
      or<br />
      <tt>for i in *.* ; do bifsconv &quot;$i&quot; = ; done</tt></td>
  </tr>
  <tr>
    <td><b>Images en mode brut (RAW)</b>
      <p>Bien que BifsConv sache convertir plusieurs format d'images en mode brut d'appareil de photo num&eacute;riques,
        la solution la plus universelle pour ce genre d'images est d'utiliser le fabuleux programme <a href="http://www.cybercom.net/~dcoffin/dcraw/"><i>DCRaw</i></a> de Dave Coffin pour faire
        une traduction au format tiff, et ensuite de faire la conversion finale en fit.
        Pour ce cas, un mode d'extracation des couleurs &agrave; partir de la matrice du capteur est disponible dans BifsConv:
        selon l'exemple ci-dessous, l'option mrvvb signifie que la matrice de base comporte un photosite rouge,
        deux photosites verts sur le diagonale et le dernier photosite est bleu.
        A adapter pour certains appareils par essais avec une photo de paysage. On peut rajouter un = &agrave;

        la suite de la liste des couleurs de sorte &agrave; demander de normaliser les intensit&eacute;s par le nombre de photosites de m&ecirc;me couleur.
        Dans les exemples, une mention du canal de couleur est rajout&eacute;e au nom de l'image.</p>
        <p>Exemple: conversion des images au format cr2 en tiff, puis extraction des trois composantes de couleur.</p></td>
    <td><b>&quot;RAW format&quot; images</b>
      <p>BifsConv knows how to convert images in some &quot;raw formats&quot;. Nevertheless the most universal way to do the conversion is to use
        the marvelous <a href="http://www.cybercom.net/~dcoffin/dcraw/"><i>DCRaw</i></a> converter by Dave Coffin to obtain first an image
        in tiff format, and than to do the final conversion to fit format using BifsConv.
        For this particular case, one can select a color chanel from the color filter array as in the example as below.
        The mrvvb option means that the matrix has one red-, two green- and one blue pixels. To be adapted for some cameras, using trials on a landscape image.
        With a = added, the intensities are normalized by the number of pixels of the same colour.
        In the following exemples, the name of the colour chanel is added at the end of the filename.</p>
      <p>Examples: conversion of the cr2 images to tiff, and than the extraction of the three colours.</p>
  </td>
  </tr>
  <tr>
    <td> fichier de commande sous windows<br />
      <tt>for %%f in (*.cr2) do dcraw -t 0 -j -T -4 -D -v %%f<br />
      for %%f in (*.tiff) do bifsconv %%f =+_r mrvvb= &quot;y:filter='r'&quot; r<br />
      for %%f in (*.tiff) do bifsconv %%f =+_v mrvvb= &quot;y:filter='v'&quot; v<br />
      for %%f in (*.tiff) do bifsconv %%f =+_b mrvvb= &quot;y:filter='b'&quot; b</tt></td>
    <td> windows command file<br />
      <tt>for %%f in (*.cr2) do dcraw -t 0 -j -T -4 -D -v %%f<br />
      for %%f in (*.tiff) do bifsconv %%f =+_r mrvvb= &quot;y:filter='r'&quot; r<br />
      for %%f in (*.tiff) do bifsconv %%f =+_v mrvvb= &quot;y:filter='v'&quot; v<br />
      for %%f in (*.tiff) do bifsconv %%f =+_b mrvvb= &quot;y:filter='b'&quot; b</tt></td>
  </tr>
  <tr>
    <td> linux<br />
      <tt>find . -maxdepth 1 -name \*.cr2 -exec dcraw -j -t 0 -T -4 -D -v &quot;{}&quot; \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_r mrvvb= &quot;y:filter='r'&quot; r \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_v mrvvb= &quot;y:filter='v'&quot; v \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_b mrvvb= &quot;y:filter='b'&quot; b \;</tt><br />
      ou <br />
      <tt>for i in *.cr2 ; do dcraw -j -t 0 -T -4 -D -v &quot;$i&quot; ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_r mrvvb= &quot;y:filter='r'&quot; r ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_v mrvvb= &quot;y:filter='v'&quot; v ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_b mrvvb= &quot;y:filter='b'&quot; b ; done</tt></td>
    <td> linux<br />
      <tt>find . -maxdepth 1 -name \*.cr2 -exec dcraw -j -t 0 -T -4 -D -v &quot;{}&quot; \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_r mrvvb= &quot;y:filter='r'&quot; r \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_v mrvvb= &quot;y:filter='v'&quot; v \;<br />
      find . -maxdepth 1 -name \*.tiff -exec bifsconv &quot;{}&quot; =+_b mrvvb= &quot;y:filter='b'&quot; b \;</tt><br />
      or <br />
      <tt>for i in *.cr2 ; do dcraw -j -t 0 -T -4 -D -v &quot;$i&quot; ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_r mrvvb= &quot;y:filter='r'&quot; r ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_v mrvvb= &quot;y:filter='v'&quot; v ; done<br />
      for i in *.tiff ; do bifsconv &quot;$i&quot; =+_b mrvvb= &quot;y:filter='b'&quot; b ; done</tt></td>
  </tr>
  <tr>
    <td> Remarque: pour les applications photom&eacute;triques et astrom&eacute;triques, une mani&egrave;re de faire l&eacute;g&egrave;rement meilleure
      est disponible dans le programme de pr&eacute;traitement Apla.</td>
    <td> Note: for photometric et astrometric applications, a slightly better way to extract colours exists:
      it is implemented in the Apla preprocessing software.</td>
  </tr>
  <tr>
    <td><b>Autres formats d'image</b>
      <p>Il existe des centaines de formats d'images diff&eacute;rents et de variantes... et je n'ai pas une envie folle de tous les programmer.
        Fort heureusement, plusieurs convertisseurs acceptent de nombreux formats en entr&eacute;e
        (dont le jpeg et le png) et permettent
        une sortie en tiff ou un des autres formats compris par BifsConv;
        il suffit alors de faire la conversion en deux temps,
        en utilisant par exemple le graticiel <a href="http://perso.wanadoo.fr/pierre.g/"><i>XnView</i></a> ou
    le partagiciel <a href="http://www.logipole.com/download_konv_fr.htm"><i>Konvertor</i></a> pour le premier pas.</p></td>
    <td><b>Other image formats</b>
      <p>There are hundreds of different image formats and flavour... and I don't want to code all of them.
        Some converters can input many formats (including jpeg and png) and output them in tiff or in an other format understand by
        BifsConv; the translation can thus be done in two steps, using for example the freeware <a href="http://perso.wanadoo.fr/pierre.g/"><i>XnView</i></a> or
        the shareware <a href="http://www.logipole.com/download_konv_us.htm"><i>Konvertor</i></a> for the first step.</p>
  </td>
  </tr>
  <tr>
    <td><b>Mais encore...</b>
      <p>Quatre versions de BifsConv sont disponibles et mises &agrave; jour
        fr&eacute;quement&nbsp;:</p>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconv"><i>bifsconv</i></a> (386+; linux);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconv.exe"><i>bifsconv.exe</i></a> (486+; windows);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconl.exe"><i>bifsconl.exe</i></a> (386+; dos et windows);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifscond.exe"><i>bifscond.exe</i></a> (286+; dos; noms de fichiers &agrave; la &quot;8.3&quot; - plus maintenu à 100%).</li>
      <br />
      Note: le vieux BifsConw.exe est enti&egrave;rement remplac&eacute; par l'actuel BifsConv.exe. <br />
      Ce logiciel est un &quot;timbriciel&quot;: il est gratuit, mais il faut s'enregister en envoyant
      simplement une carte postale avec un magnifique timbre&nbsp;!
      Un lien vers la pr&eacute;sente page est aussi le bienvenu...</td>
    <td><b>Some more...</b>
      <p>Four versions of BifsConv are available and frequently updated:</p>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconv"><i>bifsconv</i></a> (386+; linux);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconv.exe"><i>bifsconv.exe</i></a> (486+; windows);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifsconl.exe"><i>bifsconl.exe</i></a> (386+; dos and windows);</li>
      <li><a href="http://obswww.unige.ch/~behrend/bifscond.exe"><i>bifscond.exe</i></a> (286+; dos; filenames &agrave; la &quot;8.3&quot; - no more maintained at 100%).</li>
      <br />
      Note: The old BifsConw.exe is now supersed by the actual BifsConv.exe. <br />
      This software is a &quot;stampware&quot;: it's free, but registration
      is required by sending just a postcard with a wonderful stamp&nbsp;!
      A link to this page is also welcomed...</td>
  </tr>
  <tr>
    <td> BifsConv est d&eacute;velopp&eacute; en Pascal; les versions sont compil&eacute;es avec <a href="http://www.freepascal.org/"><i>Free Pascal</i></a>, Delphi et Borland Pascal. Commentaires bienvenus. <br />
      Tous usages militaires strictement interdits; itou pour la redistribution massive sans mon accord explicite.</td>
    <td> BifsConv is developped in Pascal; the versions are compiled using <a href="http://www.freepascal.org/"><i>Free Pascal</i></a>, Delphi and Borland Pascal. Comments are welcomed. <br />
      All military uses strictly prohibited; idem for the mass redistribution without my explicit permission.</td>
  </tr>
  <tr>
    <td>BifsConv ne marche pas/lus avec une image&nbsp;? <a href="mailto:raoul.behrend@unige.ch?subject=Image pour bifsconv">Envoyez-la moi</a>&nbsp;!</td>
    <td>BifsConv does not/no more work correctly with an image&nbsp;? <a href="mailto:raoul.behrend@unige.ch?subject=Image pour bifsconv">Send it to me</a>&nbsp;!</td>
  </tr>
</table>
<p><b>Quelques liens/some links</b>:</p>
<li><a href="plansite.html"><i>Plan du site</i></a></li>
<li><a href="welcome.html"><i>Page personnelle</i></a></li>
<li><a href="page_omg.html"><i>Traitement num&eacute;rique des images</i></a></li>
<li><a href="page_mgo.html"><i>Digital image processing</i></a></li>
<li><a href="http://www.unige.ch/sciences/astro"><i>Page d'accueil de l'Observatoire</i></a></li>
<li><a href="http://www-pdsimage.jpl.nasa.gov/PDS/public/jukebox.html"><i>PDS imaging-node - Online CD-roms</i></a>
</li>
</body>
</html>
