<!DOCTYPE HTML PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <title>Aligner une s&#233;rie d'images</title>
</head>
<body>
<p class="date">Date de mise &#224; jour : 23 janvier 2011</p>
<h1><a name="MANUEL" id="MANUEL">Aligner une s&#233;rie
d'images</a></h1>
<h2>1. Aligner manuellement</h2>
<pre></pre>
<h2><a name="AUTO" id="AUTO">2. Aligner automatiquement</a></h2>
<h3>2.1 Principe</h3>
<p>Cette fonction ex&#233;cute automatiquement les &#233;tapes
suivantes :</p>
<ul>
  <li>Calcul des translations &#224; effectuer pour que le contenu
des images se recouvrent au mieux avec une pr&#233;cision
inf&#233;rieure au pixel.</li>
  <li>Translation effective de chaque image.</li>
  <li>Recadrage des images pour &#233;liminer les zones sans
recouvrement.</li>
</ul>
<h3>2.2 Quelles images faut-il aligner ?</h3>
<p>La r&#233;ponse d&#233;pend de l'origine des images :</p>
<ul>
  <li>Les images issues de cam&#233;ras CCD peuvent &#234;tre
align&#233;es &#224; l'issue du pr&#233;traitement, apr&#232;s
correction avec les images de Pr&#233;charge, de Noir et de
P.L.U.</li>
  <li>Les images issues des APN doivent &#234;tre converties en
images couleurs RVB avant d'&#234;tre align&#233;es pour
&#233;viter les inconv&#233;nients induits par le codage sous
forme de matrice de Bayer.</li>
</ul>
<h3>2.3 Param&#233;trage</h3>
<p>Il suffit de cocher les images &#224; aligner sur l'image de
r&#233;f&#233;rence (&#224; saisir dans la ligne
<b>image_ref</b>) et d'indiquer le nom g&#233;n&#233;rique des
images de sortie.</p>
<p><img src="images/aligner_auto.png"></p>
<p>Les images recadr&#233;es portent le nom g&#233;n&#233;rique
suivi d'un index d&#233;butant &#224; 1.</p>
<p>Apr&#232;s v&#233;rification de la qualit&#233; de
l'alignement, il suffit de les additionner, de faire la moyenne,
etc. avec l'une des commandes Images/Combiner.</p>
<br>
<h3>2.4 Ex&#233;cution en ligne de commande</h3>
<p>Cette fonction est ex&#233;cutable en ligne de commande dans
la Console. Le r&#233;pertoire images doit &#234;tre celui
contenant la ou les images &#224; traiter. Le nom de la fonction
<b>::prtr::cmdAligner</b> doit &#234;tre suivi de deux listes de
param&#232;tres.</p>
<p>La premi&#232;re liste contient :</p>
<ul>
  <li>Le nom g&#233;n&#233;rique (ou la liste des noms) des images
d'entr&#233;e.</li>
  <li>Le chemin d'acc&#232;s aux fichiers des images de sortie (mettre
un point si c'est le r&#233;pertoire images).</li>
  <li>Le nom g&#233;n&#233;rique des images de sortie.</li>
  <li>L'extension du ou des fichiers.</li>
</ul>
La seconde liste contient le nom de l'image de r&#233;f&#233;rence
(chemin complet si l'image est situ&#233;e dans un autre
r&#233;pertoire que les images &#224; traiter).
<pre>::prtr::cmdAligner {"trans1 trans2 trans3 trans4" . recadre .fit} {"image_ref=C:/Documents and Settings/1/Mes documents/audela/images/m45_champ.fit"}<br></pre>
Elle renvoie 0 s'il n'y a pas d'erreur, sinon 1 en cas d'erreur.<br>
</body>
</html>
