<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Position de l'observateur</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 09 mars 2005</p>
<h1>Position de l'observateur </h1>
<p> Cette fois, il s'agit de se situer pr&eacute;cis&eacute;ment sur notre ch&egrave;re Terre. En cliquant avec le bouton gauche de la souris sur Position de l'observateur..., voici la bo&icirc;te de dialogue qui appara&icirc;t au premier d&eacute;marrage sur votre &eacute;cran : </p>
<img src="../../images/image14.gif" alt="" width="390" height="395" />
<p>Si vous &ecirc;tes l'heureux propri&eacute;taire d'un GPS vous obtiendrez directement la longitude, la latitude et l'altitude de votre lieu d'observation dans le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique WGS84. Pour les autres, pas de panique, procurez-vous une carte IGN de la s&eacute;rie bleue, les derni&egrave;res &eacute;ditions sont dites 'compatibles GPS'. Il s'agit dans ce cas de cartes r&eacute;alis&eacute;es avec le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique WGS84. Faites un relev&eacute; de votre position et reportez-le dans les diff&eacute;rents champs. Si vous n'avez pas la chance d'avoir une carte IGN 'compatible GPS' ce n'est pas grave. Les anciennes cartes de l'IGN conviennent &eacute;galement, elles ont &eacute;t&eacute; r&eacute;alis&eacute;es avec le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique ED50. Choisissez alors ED50 dans le champ R&eacute;f&eacute;rentiel g&eacute;od&eacute;sique &agrave; l'aide de <img src="../../images/image15.gif"
 alt="" width="18" height="18" /> et reportez votre position dans les champs Longitude, Latitude et Altitude. </p>
<p>En appuyant sur <img src="../../images/image15.gif"
 alt="" width="18" height="18" /> devant Longitude, vous pouvez indiquer si vous &ecirc;tes &agrave; l'est (E) ou &agrave; l'ouest (O) du m&eacute;ridien de Greenwich. De m&ecirc;me pour la Latitude, vous pouvez indiquer si vous &ecirc;tes dans l'h&eacute;misph&egrave;re nord (N) ou sud (S). Il vous reste &agrave; reporter dans les champs, la longitude et la latitude de votre lieu d'observation en degr&eacute;s (d), minutes d'angle (m), secondes et fractions de seconde d'angle (s). Faites de m&ecirc;me pour l'altitude qui elle est exprim&eacute;e en m&egrave;tres. </p>
<p>Une fois que vous avez renseign&eacute; l'ensemble de ces champs, il est recommand&eacute; d'appuyer sur le bouton Mise &agrave; jour du format GPS (WGS84). Apr&egrave;s cette action, vous constaterez que votre position vient d'&ecirc;tre actualis&eacute;e en face du libell&eacute; Format GPS (WGS84). Le logiciel utilise cette information pour certains calculs, il est donc important d'effectuer correctement ce param&eacute;trage. Si vous oubliez d'appuyer sur ce bouton, ce n'est pas tr&egrave;s grave. En effet, au moment de la validation de votre position (action sur les boutons OK ou Appliquer), ce champ se met automatiquement &agrave; jour. Il en r&eacute;sulte que c'est bien votre position GPS qui sera prise en compte dans les calculs la n&eacute;cessitant. </p>
<p>Si les coordonn&eacute;es (longitude, latitude et altitude) sont exprim&eacute;es dans le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique ED50, l'appui sur le bouton Mise &agrave; jour du format GPS (WGS84) les convertira automatiquement dans le format WGS84 avant de les afficher en face du libell&eacute; Format GPS (WGS84).</p>
<p>Si votre station d'observation poss&egrave;de un num&eacute;ro d'enregistrement &agrave; l'UAI, il vous suffit de renseigner uniquement le champ Num&eacute;ro UAI du site, dans l'exemple suivant nous avons choisi 173, c'est le num&eacute;ro d'enregistrement de la station d'observation de Robin Chassagne quand il habitait l'&icirc;le de La R&eacute;union. Un simple clic sur le bouton Mise &agrave; jour des formats MPC et l'ensemble des champs (Longitude, Latitude et Altitude) et des formats (Format GPS (WGS84), Format MPC et Format MPCSTATION) se mettent automatiquement &agrave; jour. Le R&eacute;f&eacute;rentiel g&eacute;od&eacute;sique passe automatiquement sur WGS84 &agrave; cette occasion. Pour le site de Robin on obtient par exemple : </p>
<img src="../../images/image16.gif" alt="" width="390" height="395" />
<p>Tout ceci n'est possible que gr&acirc;ce &agrave; la pr&eacute;sence du fichier obscodes.txt, &eacute;dit&eacute; par l'UAI, qui contient les &eacute;l&eacute;ments n&eacute;cessaires aux diff&eacute;rents formats. </p>
<p>Pour les curieux, le d&eacute;tail des 3 formats (Format GPS (WGS84), Format MPC et Format MPCSTATION) est d&eacute;crit dans le Manuel de l'utilisateur de la LIB MC (librairie d&eacute;di&eacute; &agrave; la M&eacute;canique C&eacute;leste). </p>
<p>Par contre si vous venez juste de faire enregistrer votre station d'observation aupr&egrave;s de l'UAI, le fichier obscodes.txt (du r&eacute;pertoire ...\audace\etc) ne sera bien s&ucirc;r pas &agrave; jour. Le num&eacute;ro de votre site &eacute;tant inconnu, il vous sera impossible de renseigner automatiquement les diff&eacute;rents champs et formats de la bo&icirc;te de dialogue. Heureusement, nous avons pens&eacute; &agrave; vous, il vous suffit d'appuyer sur le bouton Mise &agrave; jour qui se situe dans le prolongement du libell&eacute; Fichier des sites UAI, voici ce que vous obtiendrez : </p>
<img src="../../images/image17.gif" alt="" width="396" height="403" />
<p>Un simple clic de la souris sur le lien hypertexte et vous &ecirc;tes automatiquement connect&eacute;s via Internet &agrave; la derni&egrave;re version du fichier contenant tous les sites UAI, si bien s&ucirc;r vous avez correctement configur&eacute; votre navigateur web. </p>
<p>Il vous suffit &agrave; l'aide de l'option Enregistrer sous... de votre navigateur web de copier le fichier sur votre disque dur (r&eacute;pertoire ...\audace\etc) en n'oubliant pas de le renommer obscodes et en choisissant le type de fichier txt. </p>
<p>Une fois vos param&eacute;trages effectu&eacute;s, il vous faut les valider en appuyant sur le bouton OK ou Appliquer de la bo&icirc;te de dialogue Position de l'observateur. A la fermeture du logiciel, celui-ci vous demandera de sauvegarder ou non votre nouvelle configuration.</p>
<p>Important : Les cartes IGN de la s&eacute;rie bleue dites 'compatibles GPS' sont r&eacute;alis&eacute;es avec le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique WGS84. Les anciennes cartes IGN de la s&eacute;rie bleue sans l'information 'compatibles GPS' sont r&eacute;alis&eacute;es avec le r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique ED50. Les positions (longitude, latitude et altitude) que vous devez communiquer au MPC doivent &ecirc;tre issues du r&eacute;f&eacute;rentiel g&eacute;od&eacute;sique ITRF, la diff&eacute;rence avec le WGS84 &eacute;tant minime, un positionnement dans ce dernier r&eacute;f&eacute;rentiel convient. </p>
</body>

</html>
