<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Configuration de la liaison</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 26 juin 2006</p>
<h1>Configuration de la liaison </h1>
<p> Pour r&eacute;gler les param&egrave;tres de connexion d'une liaison, il faut ouvrir la fen&ecirc;tre de configuration des liaisons. Pour cela, vous devez aller dans le menu d&eacute;roulant Configuration, puis cliquer sur Liaison... : </p>
<img src="../../images/image88.gif" alt="" width="639" height="507" />
<p> La fen&ecirc;tre de configuration des liaisons se pr&eacute;sente sous la forme suivante : </p>
<img src="../../images/image89.gif" alt="" width="588" height="404" />
<p> Vous pouvez constater que le logiciel supporte un certain nombre de liaisons. Il vous suffit de cliquer sur les diff&eacute;rents onglets disponibles (AudiNet, EthernAude, GPhoto2, Port parall&egrave;le, PhotoPC, QuickAudine, QuickRemote, Port s&eacute;rie) pour explorer les possibilit&eacute;s d'interfa&ccedil;age. </p>
<p> Dans la partie inf&eacute;rieure de la fen&ecirc;tre ci-dessus, vous constatez la pr&eacute;sence, derri&egrave;re une case &agrave; cocher, du message suivant : Connexion automatique de cette liaison au prochain d&eacute;marrage </p>
<img src="../../images/image90.gif" alt="" width="340" height="24" />
<p> Si apr&egrave;s avoir coch&eacute; cette case, vous appuyez sur le bouton OK ou Appliquer, &agrave; la fermeture du logiciel, celui-ci vous demandera d'enregistrer la nouvelle configuration. </p>
<img src="../../images/image91.gif" alt="" width="348" height="22" />
<p> Au prochain d&eacute;marrage du logiciel, vous n'aurez pas &agrave; reconfigurer votre liaison. Avec cette option, la liaison EthernAude (dans notre exemple) se connecte automatiquement en utilisant le param&eacute;trage pr&eacute;c&eacute;demment choisi. </p>
<img src="../../images/image92.gif" alt="" width="586" height="47" />
<p> Enfin cette fen&ecirc;tre comporte 4 boutons dans sa partie inf&eacute;rieure dont les fonctions sont les suivantes : </p>
<ul>
  <li> OK : Applique le param&eacute;trage choisi pour la liaison d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et ferme la fen&ecirc;tre de configuration des liaisons.</li>
  <li> Appliquer : Applique le param&eacute;trage choisi pour la liaison d&eacute;finie par l'onglet s&eacute;lectionn&eacute; et laisse la fen&ecirc;tre de configuration des liaisons ouverte.</li>
  <li> Aide : Permet d'acc&eacute;der directement à l'aide pour la configuration de la liaison choisie par l'onglet s&eacute;lectionn&eacute;.</li>
  <li> Fermer : Ferme la fen&ecirc;tre de configuration des liaisons sans prendre en compte les param&egrave;tres modifi&eacute;s.</li>
</ul>
<p> Vous pouvez acc&eacute;der au param&eacute;trage de chaque liaison en cliquant <a href="../../../../doc_html/french/09configuration/04link/1020liaison.htm">ici</a>. </p>
</body>

</html>
