<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Contr&#244;le &#224; distance</title>

<style type="text/css">
/*<![CDATA[*/
 p.c1 {font-weight: bold}
 ul { line-height: 150%; }
 td { padding-bottom: 20px;padding-left: 20px;}
/*]]>*/
</style>
</head>
<body>
<p class="date">Date de mise &#224; jour : 31 ao&#251;t 2011</p>
<h1>Trigger</h1>
<p>Trigger est un timer-intervallom&#232;tre programmable,
permettant de commander notamment des APN Canon non reconnus par
libgphoto2-canon.</p>
<p>Il peut aussi commander les interfaces actionn&#233;es par un
front montant ou descendant.</p>
<h2>Pr&#233;paration de l'APN</h2>
<p>Pour tout ce qui concerne les modalit&#233;s de raccordement
de l'Appareil Photo Num&#233;rique (APN), consulter l'aide
disponible sous le menu
'Aud'ACE/Configuration/Cam&#233;ra/APN'.</p>
<p>La liaison entre le PC et l'APN se limite au c&#226;ble se
connectant &#224; la borne du r&#233;cepteur de
t&#233;l&#233;commande de l'APN.</p>
<p>L'APN peut &#234;tre positionn&#233; sur le mode automatique
ou sur le mode manuel. Cette interface est limit&#233;e au
d&#233;clenchement de l'APN, tous les param&#232;tres &#233;tant
r&#233;gl&#233;s sur l'APN.</p>
<h2>Outil d'acquisition</h2>
<table>
<tbody>
<tr>
<td><img src="trigger.gif" alt=
"description du panneau Trigger" /></td>
<td>
<p>L'outil comporte (du haut en bas) :</p>
<p>Un bouton d'aide de l'outil.</p>
<p>Une liste d&#233;roulante de s&#233;lection du <b>Port</b>.
Les options disponibles sont identiques &#224; celles
propos&#233;es dans l'onglet Configuration/Cam&#233;ra/APN.</p>
<p>Une liste d&#233;roulante de s&#233;lection du <b>Bit</b> de
commande. Les options disponibles sont modifi&#233;es par le
choix du port qu'il convient de r&#233;gler en premier. La
s&#233;lection d'un port LPT permet de choisir un bit entre 0 et
7 alors qu'un port COM permet de s&#233;lectionner une option
parmi <b>{ DTR | RTS }</b>.</p>
<p>Une liste d&#233;roulante de s&#233;lection de la commande
d'activation <b>Front</b>. Les deux options possibles sont <b>{
0</b> (front descendant) <b>| 1</b> (front montant) <b>}</b>.</p>
<p>Une liste d&#233;roulante de s&#233;lection du <b>Mode</b>
comporte deux options <b>{ Un | S&#233;rie }</b>.</p>
<ul>
<li><b>Un</b> (d&#233;clenchement) ne donne acc&#232;s qu'au
d&#233;lai (retard) avant le d&#233;clenchement.</li>
<li><b>S&#233;rie</b> autorise l'entr&#233;e d'un intervalle
entre deux d&#233;clenchements.</li>
</ul>
<p>Une fen&#234;tre d'affichage : Vide au repos, elle affiche les
principales &#233;tapes au cours d'une session <b>{ Attente |
Acquisition }</b>.</p>
<p>Une fen&#234;tre pour saisir le <b>nombre</b> de
d&#233;clenchements. Le nombre est d&#233;cr&#233;ment&#233; en
cours de session. A la fin de la session le nombre est remis
&#224; sa valeur initiale.</p>
<p>Une case &#224; cocher <b>Pose</b> : Lorsqu'elle est
activ&#233;e elle autorise la saisie d'une dur&#233;e de
d&#233;clenchement.</p>
<p>Une fen&#234;tre de saisie de la <b>Dur&#233;e</b> de
l'impulsion. Celle-ci a de de l'importance :<br />
- en mode <b>Manuel + Bulb</b>, car elle d&#233;termine la
dur&#233;e d'exposition,<br />
- en mode <b>Rafale</b>, car elle d&#233;termine la dur&#233;e de
la rafale.<br />
Dans tous les autres cas (Automatique, Manuel + Temps
d'exposition) c'est le front montant ou descendant qui
d&#233;termine le d&#233;but du d&#233;clenchement mais c'est
l'APN qui r&#232;gle la dur&#233;e. Le fait que la dur&#233;e
diff&#232;re du temps d'exposition, c'est un peu comme continuer
&#224; appuyer sur le bouton de d&#233;clenchement alors que la
photo est d&#233;j&#224; prise !</p>
<p>Une fen&#234;tre de saisie du <b>D&#233;lai</b> avant le
lancement du processus.</p>
<p>Une fen&#234;tre pour saisir la <b>P&#233;riode</b> de temps
entre deux d&#233;clenchements pour l'option
<b>S&#233;rie</b>.<br />
Cette entr&#233;e n'est active que si le nombre de poses est
sup&#233;rieur &#224; 1.<br />
Son calcul doit tenir compte de la dur&#233;e, du retard
&#233;ventuellement programm&#233; sur l'APN et du temps de
sauvegarde des images sur la carte m&#233;moire.</p>
<p>Si l'option <b>Auto</b> est coch&#233;e les op&#233;rations
d&#233;buteront &#224; l'heure et &#224; la minute
sp&#233;cifi&#233;e (heure civile).</p>
<p>Un bouton <b>Go</b> lance le processus. Toutes les commandes
sont gel&#233;es durant une session : Aucun changement n'est
possible.</p>
</td>
</tr>
</tbody>
</table>
<h2>Bon &#224; savoir</h2>
<ul>
<li>L'interface ne peut pas savoir si vous avez mis en marche
l'appareil, par exemple : allum&#233; l'APN, mis une carte
m&#233;moire, etc. !</li>
<li>Le timer n'introduit ni attente ni blocage de
l'interface.</li>
<li>Chaque entr&#233;e est accompagn&#233;e d'un bulle
d'aide.</li>
<li>Les donn&#233;es &#224; saisir sont des nombres entiers et
sont contr&#244;l&#233;es. Une fen&#234;tre rappelle les
consignes en cas d'erreur.</li>
<li>Le lien cr&#233;&#233; avec le port n'existe que durant
l'activation d'un d&#233;clenchement.</li>
<li>Chaque d&#233;clenchement est accompagn&#233; d'un message
sur la Console indiquant le temps UTC, le num&#233;ro de
s&#233;rie de la prise de vue, le num&#233;ro de l'image et
&#233;ventuellement la dur&#233;e d'exposition (Longue Pose). Ces
informations figurent &#233;galement dans le fichier
trigger.log.</li>
</ul>
</body>
</html>
