<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Messages sur la Console</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 11 avril 2007</p>
<h1>Messages sur la Console </h1>
<p> Ce param&eacute;trage permet de rendre 'muet' les outils 'bavards'. Seuls les outils Acquisition et Pr&eacute;traitement sont concern&eacute;s. Je m'explique, ces 2 outils tracent toutes les actions que vous faites en affichant sur la Console des messages clairs d&eacute;crivant le processus en cours. De plus ces m&ecirc;mes messages sont &eacute;galement enregistr&eacute;s dans un fichier avec l'extension log dans le r&eacute;pertoire d&eacute;di&eacute; aux images. En cliquant sur le bouton Configuration de l'outil Acquisition vous avez la bo&icirc;te de dialogue suivante qui s'affiche &agrave; l'&eacute;cran : </p>
<img src="images/acqfcSetup1.gif" alt="" width="359" height="126" />
<p>Dans le cas pr&eacute;sent, l'outil Acquisition affiche des messages d&eacute;crivant le processus en cours sur la Console. Le r&eacute;sultat peut &ecirc;tre le suivant dans le cas de l'acquisition d'une image : </p>
<img src="images/acqfcSetup2.gif" alt="" width="774" height="517" />
<p>Il suffit de lire le message, vous venez de r&eacute;aliser &agrave; 21h 21m 14s TU l'acquisition d'une image CCD de 60 secondes de pose en binning 2x2 en mode 'une image'. En plus d'&ecirc;tre affich&eacute; sur la Console, ce message est &eacute;galement enregistr&eacute; dans un fichier avec l'extension log dans le r&eacute;pertoire d&eacute;di&eacute; aux images. </p>
<p>Il est possible par la bo&icirc;te de dialogue Messages sur la Console de rendre l'outil Acquisition muet vis &agrave; vis de la Console. Pour cela vous devez cliquer sur Non. </p>
<img src="images/acqfcSetup3.gif" alt="" width="359" height="126" />
<p>Vous devez ensuite valider ce choix en cliquant sur le bouton OK ou Appliquer. Il n'y aura donc plus d'affichage de messages sur la Console pour tracer le processus en cours, par contre ce m&ecirc;me processus sera toujours enregistr&eacute; dans un fichier avec l'extension log que vous pourrez consulter ult&eacute;rieurement. </p>
<p>Si vous souhaitez &agrave; nouveau retrouver l'affichage du processus sur la Console, il vous suffit tout simplement de cliquer sur Oui et ensuite de valider votre choix par un appui sur OK ou sur Appliquer. </p>
</body>

</html>
