<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Visionneuse bis</title>
</head>

<body>
<p class="date">Date de mise &agrave; jour : 27 f&eacute;vrier 2006</p>
<h1>Visionneuse bis </h1>
<h2>Pr&eacute;sentation de &quot;Visionneuse bis&quot;</h2>
<p>Visionneuse bis permet de visualiser les images et les films de diff&eacute;rents types.</p>
<p>Le r&eacute;pertoire par d&eacute;faut est le r&eacute;pertoire s&eacute;lectionn&eacute; dans la configuration de Audace. Il est possible de se d&eacute;placer dans un sous-r&eacute;pertoire en double-cliquant sur le nom d'un sous-r&eacute;pertoire qui appara&icirc;t dans la liste, ou de se d&eacute;placer dans le r&eacute;pertoire parent en double-cliquant sur la premi&egrave;re ligne &quot;..&quot;</p>
<h2>Commandes sur la liste de fichiers</h2>
<h3>Commandes clavier </h3>
<ul>
  <li>Fl&egrave;che vers le bas : S&eacute;lectionne le fichier suivant et affiche l'image dans la fen&ecirc;tre principale.</li>
  <li>Fl&egrave;che vers le haut : S&eacute;lectionne le fichier pr&eacute;c&eacute;dent et affiche l'image dans la fen&ecirc;tre principale.</li>
  <li>Escape : Efface la s&eacute;lection.</li>

</ul>
<h3>Commandes avec la souris</h3>
<ul>
  <li>Molette vers l'avant : Fait d&eacute;filer la liste des fichiers vers l'avant.</li>
  <li>Molette vers l'arri&egrave;re : Fait d&eacute;filer la liste des fichiers vers l'arri&egrave;re.</li>
</ul>
<h3>Sur un nom de fichier : </h3>
<ul>
  <li>Bouton gauche : S&eacute;lectionne un fichier et affiche l'image dans la fen&ecirc;tre principale.</li>
  <li>Bouton droit : Affiche le popup-menu.</li>
  <li>CTRL+Bouton gauche : Ajoute/supprime une nouvelle image dans la s&eacute;lection.</li>
  <li>SHIFT+ Bouton gauche : Ajoute les images &agrave; la s&eacute;lection.</li>
</ul>
<h3>Sur un nom de r&eacute;pertoire : </h3>
<ul>
  <li>Doucle-clic sur le bouton gauche : Affiche le contenu du r&eacute;pertoire.</li>
</ul>
<h3>Sur un titre de colonne :</h3>
<ul>
  <li>Bouton gauche : Trie les lignes selon l'ordre alphab&eacute;tique du contenu de la colonne.</li>
  <li>Bouton gauche : Modifie la largeur des colonnes.</li>
  <li>Bouton droit : Ajuste la largeur de la colonne en fonction du contenu.</li>
</ul>
<h2>Popup menu de la liste des fichiers</h2>
<ul>
  <li>Actualiser : Rafraichit la liste des fichiers.</li>
  <li>Tout s&eacute;lectionner : S&eacute;lectionne tous les fichiers de la liste (les r&eacute;pertoires ne sont pas s&eacute;lectionn&eacute;s).</li>
  <li>Enregistrer sous : Enregistre l'image avec un format ou un nom diff&eacute;rent.</li>
  <li> Supprimer : Supprime les fichiers s&eacute;lectionn&eacute;s.</li>
  <li> Type, S&eacute;rie, Date, Taille : Cocher les noms des colonnes &agrave; afficher. Par d&eacute;faut, la colonne Type est la seule colonne affich&eacute;e en plus de la colonne Nom.</li>
  <li> Zoom : Changement du zoom de l'image.</li>
  <li>Plein &eacute;cran : Affichage de l'image sur tout l'&eacute;cran.</li>
  <li>Configurer : Permet de s&eacute;lectionner les types d'images &agrave; afficher. Par d&eacute;faut , seules les images FITS et GIF sont affich&eacute;es.</li>
  <li>Aide : Afficher cette aide.</li>
  <li>Voir le film : Activer l'animation d'un fichier GIF anim&eacute; ou d'un film.</li>
</ul>
<h2>Autres commandes</h2>
<ul>
  <li>Diaporama : Affiche les images s&eacute;lectionn&eacute;es l'une apr&egrave;s l'autre. </li>
  <li>Connexion FTP : Affiche la liste des fichiers pr&eacute;sents sur une autre machine connect&eacute;e au r&eacute;seau. L'autre machine doit &ecirc;tre &eacute;quip&eacute;e d'un serveur FTP.</li>
</ul>
<h2><a NAME="config" id="config"></a> Configuration de &quot;Visionneuse bis&quot;</h2>
<p>La fen&ecirc;tre de configuration de la &quot;Visionneuse bis&quot; est accessible &agrave; partir du popup-menu de la liste de fichiers.</p>
<p>Fichiers reconnus : S&eacute;lectionner les types de fichiers qui doivent &ecirc;tre affich&eacute;s sous forme d'image ou de film </p>
<p>Afficher les autres fichiers : Affiche les noms des fichiers non reconnus dans la liste. </p>
<h2><a name="fullscreen" id="fullscreen"></a> Mode Plein &eacute;cran</h2>
<p>Le mode &quot;Plein &eacute;cran&quot; affiche les images et les films sur la totalit&eacute; de l'&eacute;cran.</p>
<p>Il peut &ecirc;tre lanc&eacute; depuis le menu &quot;Afficher&quot; ou depuis la &quot;Visionneuse bis&quot;</p>
<h2>Commandes clavier </h2>
<ul>
  <li>Fl&egrave;che vers le bas : Affiche l'image suivante.</li>
  <li>Fl&egrave;che vers le haut : Affiche l'image pr&eacute;c&eacute;dente.</li>
  <li>Escape : Arr&ecirc;te l'affichage plein &eacute;cran.</li>
</ul>
<h2>Commandes avec la souris</h2>
<ul>
  <li>Molette vers l'avant : Affiche l'image suivante</li>
  <li>Molette vers l'arri&egrave;re : Affiche l'image pr&eacute;c&eacute;dente</li>
  <li>Bouton droit : Affiche le popup menu</li>
</ul>
<h2>Popup-menu du mode Plein &eacute;cran</h2>
<ul>
  <li>Image suivante : Affiche l'image suivante.</li>
  <li>Image pr&eacute;c&eacute;dente : Affiche l'image pr&eacute;c&eacute;dente.</li>
  <li>Diaporama : Affiche automatiquement l'image suivante apr&egrave;s une dur&eacute;e d&eacute;finie dans la fen&ecirc;tre de configuration du mode Plein &eacute;cran.</li>
  <li>Zoom : Change l'&eacute;chelle d'affichage de l'image.</li>
  <li>Animation : Lance le d&eacute;roulement d'un image anim&eacute;e (par exemple image GIF anim&eacute;e) ou d'un film.</li>
  <li>Configurer : Ouvre la fen&ecirc;tre de configuration du mode Plein &eacute;cran.</li>
  <li>Aide : Afficher l'aide.</li>
  <li>Fermer : Arr&ecirc;te l'affichage Plein &eacute;cran.</li>
</ul>
<h2><a name="fullscreen_config" id="fullscreen_config"></a> Configuration du mode Plein &eacute;cran</h2>
<p>La fen&ecirc;tre de configuration du mode Plein &eacute;cran est accessible &agrave; partir du popup-menu de la fen&ecirc;tre Plein &eacute;cran.</p>
<p>D&eacute;marrer les animations automatiquement : Quand cette option est activ&eacute;e, les images anim&eacute;es ou les films sont lanc&eacute;s automatiquement d&egrave;s leur affichage. </p>
<p>Couleur du fond : Cliquer sur le rectangle color&eacute; pour changer la couleur de fond.</p>
</body>

</html>


